[
    {"name":"overwatch","level":0,"stat":"default","tags":"technique, weapon, reaction","strain":0,"dice":1,"effect":"Reaction (Locked #); Melee Attack against a target that moves into/out of your Weapon Range. Use 3+# for sum.","activators":1},
    {"name":"move","level":0,"stat":"default","tags":"movement","strain":0,"dice":1,"effect":"Spend #; Move your SPEED. If you need to climb something, do a Body check.\n- Jumping: When you do a move you may do a standing jump up 1+(BODY/2) or long-jump 2+BODY horizontally.","activators":1},
    
    
    {"name":"fortify","level":1,"stat":"body","tags":"technique, protection","strain":2,"dice":1,"effect":"Spend # and 2 Strain; Until the beginning of your next turn you are Rooted, immune to Knockback, and gain Bonus SHIELDING equal to the dice spent.","activators":1},
    {"name":"flex","level":1,"stat":"body","tags":"technique, power","strain":0,"dice":1,"effect":"Spend #; If a 5 or 6 is given, become Empowered until the end of your turn.","activators":1},    
    {"name":"charge","level":1,"stat":"body","tags":"technique, movement","strain":1,"dice":2,"effect":"Spend ## and 1 Strain; Move your SPEED. If you move at least 3 tiles, do a Melee Attack against a target you move next to.","activators":1},
    {"name":"reach for it","level":1,"stat":"body","tags":"technique, weapon","strain":0,"dice":2,"effect":"Spend ##; Do a Melee Attack with Reaching 2 (or +1 Reaching if it already has Reaching).","activators":1},

    {"name":"destructive swing","level":2,"stat":"body","tags":"technique, weapon, power","strain":0,"dice":2,"effect":"Spend ##; Do a Melee Weapon Attack with -3 to the Attack Sum. (This -3 does not give Bonuses or Downsides only the original sum does). This Attack gains +5 damage.","activators":3},
    {"name":"guardian's riposte","level":2,"stat":"body","tags":"technique, weapon, reaction","strain":0,"dice":1,"effect":"Reaction (Locked #); Do a Melee Weapon Attack against a target that Attacks you or ally within 1 tile of you. Use 3+# for sum.","activators":3},
    {"name":"bull rush","level":2,"stat":"body","tags":"technique, movement","strain":1,"dice":1,"effect":"Spend # and 1 Strain; Move your SPEED, you may move through creatures and weak walls. You Knockback creatures you moved through equal to your BODY, or destroy segments of the wall you move through. ","activators":1},
    {"name":"get behind me","level":2,"stat":"body","tags":"technique, protection","strain":0,"dice":1,"effect":"Spend #; until the start of your next turn (10 seconds), you Obscure anything behind you. You must be larger than things that are behind you for this effect to work.","activators":1},

    {"name":"cleave","level":3,"stat":"body","tags":"technique, weapon","strain":1,"dice":2,"effect":"Spend ## and 1 Strain; Do a Melee Weapon Attack against up to 3 targets within your Weapon Range.","activators":1},
    {"name":"headbutt","level":3,"stat":"body","tags":"technique, support","strain":2,"dice":2,"effect":"Spend ## and 2 Strain; Do a Fist Attack. If you hit, give the target 2 Stun, or if you are Grappling the target give them 4 Stun instead.\nDownside: Gain 1 Stun.","activators":1},
    {"name":"i'll take it","level":3,"stat":"body","tags":"technique, protection, reaction","strain":1,"dice":1,"effect":"Reaction (Locked #) and 1 Strain; When a creature within 1 tile of you fails a Dodge roll against an Attack, you may take the Attack instead.","activators":3},
    {"name":"battle trance","level":3,"stat":"body","tags":"technique, buff, self","strain":4,"dice":1,"effect":"Spend # and 4 Strain; Focus on the Battle. For the next minute you have +1 to BODY rolls and at the beginning of your turn you are Empowered until the end of your turn.","activators":3},

    {"name":"power swing","level":4,"stat":"body","tags":"technique, utility, weapon","strain":2,"dice":2,"effect":"Spend ## and 2 Strain; Do a Melee Weapon Attack. If you hit gain one of the following bonuses:\n- Replace any damage done with Knockback.\n- Give the target 2 Stun.\n- Do not gain the Attack Downside on this Attack.\n","activators":1},
    {"name":"meteor leap","level":4,"stat":"body","tags":"technique, movement, weapon","strain":2,"dice":2,"effect":"Spend ## and 2 Strain; Do a jump that sends you up to 2xBody tiles. If you land on a target, do a Weapon Attack with a bonus to the damage equal to half (rounded up) of how far you fell. You do not take fall damage if you hit the target.","activators":1},
    {"name":"lightstep aura","level":4,"stat":"body","tags":"spell, aura, movement","strain":4,"dice":1,"effect":"Spend # and 4 Strain; Once per turn, when a target starts its turn in or enters your Aura they gain +1 SPEED until the beginning of your next turn. (This affects you and can affect enemies.)","activators":5},

    {"name":"bring it down","level":5,"stat":"body","tags":"technique, weapon, damage","strain":4,"dice":2,"effect":"Spend ## and 4 Strain; Do a Melee Weapon Attack. If you hit do BODY bonus damage or if the target is Large or a structure do 2xBODY bonus damage instead.","activators":1},
    {"name":"long volley","level":5,"stat":"body","tags":"technique, utility","strain":1,"dice":1,"effect":"Spend # an 1 Strain; The next target you Throw has its Range increased by 2x the value of the dice spent. ","activators":1},
    {"name":"harden","level":5,"stat":"body","tags":"technique, protection, self, focus","strain":4,"dice":1,"effect":"Spend # and 4 Strain; Focus on hardening your body for up to 1 minute. While hardened you take 1 less damage from Attacks (minimum of 1) and gain +1 Body on checks.","activators":1},

    {"name":"blade spin","level":6,"stat":"body","tags":"technique, weapon","strain":3,"dice":2,"effect":"Spend ## and 3 Strain; Do a Melee Weapon Attack against all targets within your Weapon Range.","activators":1},
    {"name":"feel the way","level":6,"stat":"body","tags":"technique, focus, utility","strain":3,"dice":1,"effect":"Spend # and 3 Strain; Focus on your Senses for up to 1 minute. For this duration you are Blinded, but you can target anything within BODY+MIND tiles of you, and are immune to illusions based on sight.","activators":1},
    {"name":"power though","level":6,"stat":"body","tags":"technique, utility, reaction","strain":0,"dice":1,"effect":"Reaction (Locked #); You may use Body instead of Mind or Soul in a contest or gain Empowered until the start of your next turn.","activators":1},

    {"name":"double strike","level":7,"stat":"body","tags":"technique, weapon","strain":2,"dice":2,"effect":"Spend ## and 2 Strain; Do a Melee Weapon Attack. Afterwards do another Melee Weapon Attack with the same attack sum.","activators":1},

    {"name":"armor rip","level":8,"stat":"body","tags":"technique, power","strain":5,"dice":2,"effect":"Spend ## and 5 Strain; Do a Grapple contest against a target.\nIf you win or are already Grappling the target, the target is Grappled and loses half of its Shielding (rounded up).\nIf you lose, the target spends 3 Strain. (Targets that are immune to the Grappled condition can still lose Shielding)","activators":3},

    {"name":"raw power","level":9,"stat":"body","tags":"technique, utility, reaction","strain":3,"dice":1,"effect":"Reaction (Locked #) and 3 Strain; You may use Body instead of other stats for a check or contest.","activators":1},
    {"name":"unbreakable","level":9,"stat":"body","tags":"technique, self, protection, reaction","strain":3,"dice":1,"effect":"Reaction (Locked #) and 3 Strain; Set a single source of damage taken to 1.","activators":1},





    {"name":"mark","level":1,"stat":"mind","tags":"insight, ranged, debuff","strain":0,"dice":1,"effect":"Spend #; Give a target you can see Marked until the start of your next turn. If you give a 6, give them Marked for 1 hour instead.","activators":3},
    {"name":"train of thought","level":1,"stat":"mind","tags":"insight, dice, self","strain":1,"dice":2,"effect":"Spend ## and 1 Strain; Gain a dice with a value equal to the sum of the dice spent. (Add the dice together.)","activators":2},
    {"name":"size up","level":1,"stat":"mind","tags":"insight, utility, dice","strain":0,"dice":1,"effect":"Spend #; Look at a creature you can see then roll a d12. The next d12 roll you make against them (check, contest, dodge, etc) uses this value. You cannot activate this Art if you already have a rolled d12.","activators":1},
    {"name":"point out","level":1,"stat":"mind","tags":"insight, debuff, ranged","strain":0,"dice":2,"effect":"Spend ##; Do a Senses contest against all illusions, Hidden, and Invisible targets within 18 tiles of you. If you win, the target gains Glow and Marked for 1 minute (6 turns). Or if it's an illusion it is dispelled.","activators":3},
    
    {"name":"feint","level":2,"stat":"mind","tags":"technique, movement, weapon","strain":1,"dice":2,"effect":"Spend ## and 1 Strain; Do a Melee Weapon Attack then move 3 tiles, you gain +3 Dodge during this Attack and move.","activators":1},
    {"name":"parry","level":2,"stat":"mind","tags":"technique, reaction, protection","strain":1,"dice":1,"effect":"Reaction (Locked #) and 1 Strain; When you take damage from a Weapon Attack, reduce the damage by the dice spent (to a minimum of 1).","activators":1},
    {"name":"command","level":2,"stat":"mind","tags":"insight, buff, ranged, control","strain":1,"dice":2,"effect":"Spend ## and 1 Strain; Give a target the dice spent. They may use this dice on your turn to do any action.","activators":2},

    {"name":"coordinated strike","level":3,"stat":"mind","tags":"insight, weapon, control","strain":2,"dice":2,"effect":"Spend ## and 2 Strain; Do a Weapon Attack, afterwards an ally within 1 tile of the target may make a Melee Attack against the target. They use a sum of 9 for this Attack.","activators":3},
    {"name":"marking strike","level":3,"stat":"mind","tags":"insight, weapon, debuff","strain":1,"dice":2,"effect":"Spend ## and 1 Strain; Do a Weapon Attack. If you hit, give the target Marked until the start of your next turn.","activators":3},
    {"name":"think ahead","level":3,"stat":"mind","tags":"insight, dice, self","strain":1,"dice":1,"effect":"Spend # and 1 Strain; Up to your MIND times per turn, gain 2 dice which are half of the dice given. This cannot split a 1. If this is used on an odd value, split into one dice of even value and one of odd value (5=>3,2).","activators":2},

    {"name":"piercing shot","level":4,"stat":"mind","tags":"technique, weapon","strain":2,"dice":2,"effect":"Spend ## and 2 Strain; Do a Weapon Attack. It damages all targets in a line up to your Weapons Range. This may go through weak walls.","activators":1},
    {"name":"dolphin dive","level":4,"stat":"mind","tags":"technique, movement","strain":0,"dice":1,"effect":"Spend #; Move your SPEED then go Prone.","activators":1},
    {"name":"setup","level":4,"stat":"mind","tags":"insight, dice, buff","strain":2,"dice":0,"effect":"Spend 1 minute and 2 Strain; Roll a d12 and save the result. You may use this value on any check or contest. You cannot get a new value with this Art until you spend a current value.","activators":2},

    {"name":"shrapnel shot","level":5,"stat":"mind","tags":"creation, aoe, weapon","strain":3,"dice":2,"effect":"Spend ## and 3 Strain; Using a Ranged Weapon, pick a point within your Weapon's Range. Do a Ranged Weapon Attack against everything within 2 tiles of that point.","activators":1},
    {"name":"line them up","level":5,"stat":"mind","tags":"insight, debuff, ranged","strain":2,"dice":1,"effect":"Spend # and 2 Strain; Pick a number of targets equal to the dice spent. Give them Marked until the start of your next turn.","activators":2},
    {"name":"change of thinking","level":5,"stat":"mind","tags":"insight, dice","strain":2,"dice":1,"effect":"Spend # and 2 Strain; Gain a randomly rolled dice.","activators":2},

    {"name":"ricochet","level":6,"stat":"mind","tags":"technique, weapon","strain":3,"dice":2,"effect":"Spend ## and 3 Strain; Do a Ranged Weapon Attack. If you hit, pick a new target within 3 tiles of this one and repeat this Art without spending Strain or dice. Use the same Attack sum. (You cannot bounce to an already chosen target.)","activators":1},
    {"name":"outsmart","level":6,"stat":"mind","tags":"insight, reaction, dice, utility","strain":2,"dice":1,"effect":"Reaction (Locked #) and 2 Strain; When a creature that you can see does a roll, you may replace one of the dice rolled with the given dice. (If this is done with a d12 outside of combat roll the d12 then give them the roll regardless of value.)","activators":2},

    {"name":"certainty","level":7,"stat":"mind","tags":"insight, dice","strain":4,"dice":1,"effect":"Spend # and 4 Strain; Gain a dice with a value of your choosing. (If you spend a d12 you may only activate this when you are the one initiating the roll and cannot re-roll already rolled dice. You cannot use this for Dodge or defending against Contests.)","activators":2},
    
    {"name":"change the fates","level":9,"stat":"mind","tags":"insight, dice, utility","strain":8,"dice":1,"effect":"Spend # and 8 Strain; Target a creature you can see, the next time the creature does a roll all dice rolled are the value given or as close as possible. (This cannot make dice higher than their max value. So a given 6 will not make a d4 into a d6.)","activators":6},





    {"name":"soul shard","level":1,"stat":"soul","tags":"spell, ranged, damage","strain":0,"dice":2,"effect":"Spend ##; Spell Attack a target within 18 tiles of you. (Damage changes stack and are applied AFTER the activation of the art.)\nOn Hit: Do 2 damage and until your next turn increase this damage by 1.\nBonus: Until your next turn, increase this damage by 1.\nDownside: Until your next turn, decrease this damage by 1.","activators":5},
    {"name":"bless","level":1,"stat":"soul","tags":"spell, divine, buff, ranged","strain":1,"dice":1,"effect":"Spend # and 1 Strain; If a 5 or 6 is given, give a creature within 3 tiles of you Reinforced and Rallied until the start of your next turn.","activators":7},
    {"name":"covenant whispers","level":1,"stat":"soul","tags":"spell, divination, utility","strain":0,"dice":0,"effect":"Spend 1 minute and 0 Strain; Ask a powerful entity (a god, demon, dragon, eldritch being, etc) a question about the future. They will tell the truth but only with one word. For every time you activate this, increase the Strain cost by 2. This cost goes back to 0 at the end of a Rest.","activators":6},
    {"name":"divine detection","level":1,"stat":"soul","tags":"spell, aoe, divination, utility","strain":1,"dice":1,"effect":"Spend # and 1 Strain; For 1 hour, you know the approximate location of any Undead, Planar, or Mythical creatures (creatures with one or more of these types) and any place or item that has been blessed or cursed within 1 large tile (2,160x2160 tiles) of you. You know the type of creature you sense, but not its name.","activators":6},

    {"name":"soul pulse","level":2,"stat":"soul","tags":"spell, damage, aoe","strain":2,"dice":2,"effect":"Spend ## and 2 Strain; Do a Spell Attack against everything within 3 tiles of you.\nOn Hit, do SOUL damage and you gain Rallied or Empowered. (Each hit activates separately.)\nBonus: Do 2xSOUL damage.\nDownside: You do not gain Rallied or Empowered.","activators":7},
    {"name":"smite","level":2,"stat":"soul","tags":"spell, weapon","strain":1,"dice":2,"effect":"Spend ## and 1 Strain; Do a Weapon Attack it does an extra 2 Damage. If the target is a Monstrosity, Planar, or Undead do an extra 1d4+1 Damage instead.","activators":5},
    {"name":"soul shield","level":2,"stat":"soul","tags":"spell, protection, ranged","strain":2,"dice":1,"effect":"Spend # and 2 Strain; Give a target within 8 tiles of you 1 Ward and Bonus SHIELDING equal to the dice spent until the beginning of your next turn .","activators":5},
    {"name":"soul skip","level":2,"stat":"soul","tags":"spell, movement","strain":1,"dice":1,"effect":"Spend # and 1 Strain; Teleport to a location within 6 tiles of you.","activators":6},

    {"name":"spear of light or dark","level":3,"stat":"soul","tags":"spell, damage, ranged","strain":1,"dice":2,"effect":"Spend ## and 1 Strain then pick Light or Dark; Make a Thrown Spell Attack against a target within 18 tiles of you. \n- *Light*: On Hit: Do 2+SOUL damage, and the target gains Glow until the start of your next turn. Bonus: You gain Rallied. Downside: Do 2 less damage and do not apply Glow.\n- *Dark*: On Hit: Do 2xSOUL damage. Bonus: You gain Empowered. Downside: Do SOUL damage instead.\n","activators":5},
    {"name":"summon lesser planar","level":3,"stat":"soul","tags":"spell, follower","strain":3,"dice":3,"effect":"Spend ### and 3 Strain then pick Radiant, Fallen, or Elemental; Summon a lesser Planar Follower. The Planar has 2xSOUL Maximum Health and Strain, 6 Speed, 0 Dodge, 1 Body, 1 Arcana, 0 in every other Stat, has the Planar tag, and the below bonuses.\n- *Radiant*: The Radiant has a 'Paladin Hammer' (see weapons), SOUL Shielding, and the Art 'Bless'.\n- *Fallen*: The Fallen has a 'Crossbow' (see weapons), 2 Charm, and the Art 'covenant whispers'.\n- *Elemental*: The Elemental has 'Claws' (see weapons) with the Art 'Imbue' activated on them and the Art 'control elements'.\nThe lesser Planar lasts until your next Break or Rest.\n","activators":7},
    {"name":"scryers eye","level":3,"stat":"soul","tags":"spell, divination","strain":0,"dice":0,"effect":"Spend 1 minute; Create a floating Orb (within 1 tile of you) about the size of your eye which you may spend # to have Move up to 8 tiles. When you close at least one eye you are able to see through the Orb. The Orb has 1 Health, 0 Dodge, and lasts until you dispel it or your next Break or Rest.","activators":7},
    {"name":"bound souls","level":3,"stat":"soul","tags":"spell, protection, buff","strain":3,"dice":1,"effect":"Spend # and 3 Strain; Focus on two willing creatures within 8 tiles of you. For the next hour, you bind the souls of both creatures together. While bound together whenever either creature is healed or takes damage instead both creatures gain half healing or half damage respectively (divided as people choose).","activators":5},
    
    {"name":"branding smite","level":4,"stat":"soul","tags":"spell, weapon","strain":2,"dice":2,"effect":"Spend ## and 2 Strain; Do a Weapon Attack. If you hit, the target is Marked and Glowing until the beginning of your next turn and gains 3 Burn.","activators":5},
    {"name":"(tempname) mage spot","level":4,"stat":"soul","tags":"spell, damage, ranged, aoe","strain":3,"dice":3,"effect":"Spend ### and 3 Strain then pick Blind or Glow; Focus on a point within 36 tiles of you for up to 1 minute. You may spend # to move this point up to 6 tiles. Once per turn, targets within 2 tiles of this point must do a SOUL contest against you.\nIf you win the target takes SOUL damage and gains the chosen Status until the beginning of your next turn.\nIf you lose, the target gains chosen Status until the beginning of your next turn.","activators":7},
    {"name":"stepping stones","level":4,"stat":"soul","tags":"spell, movement","strain":3,"dice":1,"effect":"Spend # and 3 Strain; Teleport to a location that you can see up to a total of 12 tiles away. You can break up this teleportation into any number of 'steps' where you can do other actions. If you do not use up all of the teleportation by the end of your turn you lose the remaining steps.","activators":6},
    {"name":"farsight","level":4,"stat":"soul","tags":"spell, divination","strain":4,"dice":0,"effect":"Spend 1 minute and 4 Strain; Focus on observing a location far away from you for up to 1 hour. Pick a location you have been or know of. The better you know an area the closer you see it. For instance if you pick your home then you are able to be inside it and move around it. Or alternatively if you pick somewhere you have never been, such as a strange city, you are only able to observe it from far above it. You can see and hear through the location as if you were there but lose your own senses.","activators":7},

    {"name":"(tempname) mage bolts","level":5,"stat":"soul","tags":"spell, damage, ranged","strain":2,"dice":2,"effect":"Spend ## and 2 Strain; Pick SOUL targets within 18 tiles of you. You may pick the same target multiple times. Do a Spell Attack against each of them (if the same target is chosen multiple times they do multiple Dodge rolls).\nOn Hit: Do 4+SOUL damage.\nBonus: +2 damage.\nDownside: -2 Damage.","activators":7},
    {"name":"hallowed armor","level":5,"stat":"soul","tags":"spell, protection, touch","strain":3,"dice":1,"effect":"Spend # and 3 Strain, then pick Monstrosity, Planar, or Undead; Touch a set of armor. For the next hour, when the wearer takes damage from a creature with the chosen type, reduce it by 2. This cannot reduce damage below 1.","activators":7},
    {"name":"flight","level":5,"stat":"soul","tags":"spell, movement, focus, touch","strain":3,"dice":1,"effect":"Spend # and 3 Strain; Focus on giving a creature you touch the ability to fly for up to 1 hour.","activators":3},

    {"name":"reverberating smite","level":6,"stat":"soul","tags":"spell, weapon","strain":2,"dice":2,"effect":"Spend ## and 2 Strain; Do a Weapon Attack. If you hit, for the next 6 turns (1 minute) the target takes 2 damage for every 1 or 2 they roll. (This can stack, and is for ANY roll.)","activators":5},
    {"name":"far skip","level":6,"stat":"soul","tags":"spell, movement","strain":4,"dice":1,"effect":"Spend # and 4 Strain; Teleport to a location that is up to 1 medium tile (36x36 tiles) away.","activators":6},
    {"name":"dawn or dusk","level":6,"stat":"soul","tags":"spell, aoe, focus, utility","strain":5,"dice":1,"effect":"Spend # and 5 Strain then pick Dawn or Dusk; Focus on covering everything within 1 medium tile (36x36 normal tiles) or 1 large tile of you (2,160x2,160 normal tiles) in bright sunlight or thick darkness for up to 1 day.\n- Dawn: Once a minute, creatures who stand in the sunlight unprotected gain 2 Burn or Blinded for 1 minute (your choice). \n- Dusk: Non-magical lights are snuffed out and everywhere counts as shadow. Creatures moving through this area are Invisible unless a light is shined directly on them.\n","activators":7},

    {"name":"starfall","level":8,"stat":"soul","tags":"spell, damage, aoe, ranged","strain":5,"dice":3,"effect":"Spend ### and 5 Strain; At the beginning of your next turn, before other effects end (such as States or Statuses), a 'star' falls from the sky at a point of your choice within 36 tiles of you. Targets within 3 tiles of this point take 2xSOUL damage and gain Glow until the beginning of your next turn. If the target is Marked or has Glow they take 3xSOUL damage instead and go Prone.","activators":7},
    {"name":"astral projection","level":8,"stat":"soul","tags":"spell, divination, utility","strain":0,"dice":0,"effect":"Spend 10 minutes; You leave your physical body and turn into an astral Projection until your next Break or Rest. While in this form you are able to fly and move through non-metal walls and floors. Your Projection takes double damage and you cannot feel or sense anything from your physical body.","activators":7},

    {"name":"miracle","level":9,"stat":"soul","tags":"spell, utility, damage, movement, divination, buff, debuff","strain":6,"dice":2,"effect":"Spend ## and 6 Strain; Immediately activate any Art of your choice that is level 8 or lower. You do not need to spend dice, time, or strain on the Art, nor do you need to know the Art.","activators":7},





    {"name":"shooting star","level":1,"stat":"arcana","tags":"spell, damage, ranged, debuff","strain":0,"dice":2,"effect":"Spend ##; Spell Attack a target within 18 tiles of you. Until the beginning of your next turn they take 1 damage for every tile they are forcefully moved and have Glow.\nOn Hit: You may Knockback up to 2+ARCANA.\nBonus: 2+2xARCANA instead.","activators":7},
    {"name":"telepathy","level":1,"stat":"arcana","tags":"spell, utility","strain":0,"dice":1,"effect":"Spend #; Bind your mind to a willing creature's mind that you can see. You can choose to see/hear through their senses instead of your own or send/receive simple messages. You can only be bound to one creature at a time.","activators":5},
    {"name":"magic trick","level":1,"stat":"arcana","tags":"spell, utility","strain":0,"dice":1,"effect":"Spend # then pick Move, Soul Fragment, or Small Hole; These effects last for up to 1 minute (6 turns) or until you dispel it.\n- Move - Touch a small item. Once per turn, you may spend # (1 dice) to make that item move up to 4 tiles in a straight line.\n- Memory Perl - Create a Memory Perl with 1 memory or thought that is no longer than 1 minute long. When a creature touches the Perl they then telepathically hear and/or see this memory/thought.\n- Small Hole - Create a portal, no larger than your fist, in front of you with an exit up to 1 tile away. You do not need to see the exit point to make this portal. (It can be on the other side of a wall.)\n","activators":7},
    {"name":"arcane pop","level":1,"stat":"arcana","tags":"spell, damage, ranged, aoe","strain":0,"dice":2,"effect":"Spend ##; Target a point within 8 tiles of you that you can see. Do a Spell Attack against all targets within 1 tile of this point. \nOn Hit: Do damage equal to your ARCANA.\nBonus: Do a Spell Attack against all targets within 2 tiles of this point instead.","activators":5},

    {"name":"telekinetic toss","level":2,"stat":"arcana","tags":"spell, control","strain":1,"dice":2,"effect":"Spend ## and 1 Strain; Do an Arcana contest against a creature or freestanding item within 18 tiles of you.\nIf you win, the target is thrown 2+ARCANA tiles. Items may be thrown 2+2xARCANA. (This movement counts as Knockback and can take Knockback damage.)\nIf you lose, the target gains Slow.","activators":5},
    {"name":"weightless","level":2,"stat":"arcana","tags":"spell, utility, control","strain":2,"dice":2,"effect":"Spend ## and 2 Strain; Focus on making a target within 3 tiles of you weightless for up to 10 minutes. If the target is unwilling, do an Arcana Contest against them. If you win, the target is no longer tied down by gravity and can move in air as though it was Water (Swim). All terrain is counted as Rough Terrain while 'swimming'.","activators":7},
    {"name":"big or small","level":2,"stat":"arcana","tags":"spell, utility, control","strain":3,"dice":2,"effect":"Spend ## and 3 Strain; Focus on picking a target within 6 tiles of you. You cannot target objects being worn or carried by another creature or a target that is larger than 2 tiles square. If the target is unwilling, do an Arcana Contest against them. If you win, for up to the next hour, the target is either made Bigger or Smaller. \n- Bigger: The target doubles in size and weight, gains +1 to Body rolls, +1 to Melee Weapon damage, and -1 to Thieving rolls. If you target a creature all items they are wearing or carrying grow with the creature. Dropped items shrink to normal size and items picked up after becoming bigger do not grow.\n- Smaller: The target halves in size and weight, gets -1 to Body rolls, -1 to Melee Weapon damage, and +1 to Thieving rolls. You can not reduce damage below 1. If you target a creature all items they are wearing or carrying shrink with the creature. Dropped items grow to normal size and items picked up after becoming smaller do not shrink.","activators":7},
    {"name":"arcanist's seal","level":2,"stat":"arcana","tags":"spell, protection","strain":3,"dice":3,"effect":"Spend ### and 3 Strain; Pick an entryway, container, or similar target within 1 tile of you. You create a Seal on the target locking it with magical force. The Seal can be locked or unlocked by presenting some form of password or object (such as a special symbol) which is declared when activated. This Seal lasts until it is left unlocked for 1 full day.","activators":7},

    {"name":"blade wave","level":3,"stat":"arcana","tags":"spell, weapon","strain":1,"dice":2,"effect":"Spend ## and 1 Strain; Do a Melee Weapon Attack against any target within 2+ARCANA tiles of you.","activators":5},
    {"name":"redirect energies","level":3,"stat":"arcana","tags":"insight, protection","strain":2,"dice":1,"effect":"Reaction (Locked #) and 2 Strain; Until the end of the current turn you may choose to absorb and negate any Status effects gained (Burn, Slow, Marked, etc). The next Melee Attack you do applies any absorbed Status effect(s) until the beginning of your next turn. (Only apply 2 stacks of Burn or Stun.)","activators":6},
    {"name":"dispel magic","level":3,"stat":"arcana","tags":"spell, control","strain":3,"dice":1,"effect":"Spend # and 3 Strain; Pick a Target being affected by magic within 8 tiles of you. Reduce the magic's duration by a number of turns (10 second intervals) based on the dice value given. If the magic has no duration or if its duration is an hour or longer it is instead suppressed (not active) for this duration instead.","activators":7},
    {"name":"intrusive thoughts","level":3,"stat":"arcana","tags":"spell, control, illusion","strain":2,"dice":2,"effect":"Spend ## and 2 Strain; Do a Senses contest against a non-Undead/Construct creature you can see.\nIf you win, you may read the creature's innermost thoughts for up to 10 minutes or may end it early to implant a thought into the target's mind. They believe the thought was their own. (The target does not need to act on the thought if it goes against their nature.)\nIf you lose, you are able to read the creature's current thoughts for up to 10 minutes. (This has no effect on creatures that don't know a language, such as an Animal.)","activators":5},

    {"name":"displacement","level":4,"stat":"arcana","tags":"spell, protection, self","strain":4,"dice":1,"effect":"Spend # and 4 Strain; You become blurry gaining +1 Dodge and an additional d4 on rolls to Hide. This effect ends after 1 hour or until you take damage.","activators":5},
    {"name":"deja vu","level":4,"stat":"arcana","tags":"spell, control, illusion","strain":3,"dice":2,"effect":"Spend ## and 3 Strain; Do a Senses contest against a creature within 6 tiles of you.\nIf you win, you make the creature forget up to the last 5 minutes.\nIf you lose, you make the creature forget up to the last minute.","activators":6},

    {"name":"counterspell","level":5,"stat":"arcana","tags":"spell, control, protection, reaction","strain":2,"dice":1,"effect":"Reaction (Locked #) and 2 Strain; You counter a spell that you can see being cast within 18 tiles of you. That spell must have a Strain cost less than or equal to the locked dice value.","activators":6},
    {"name":"telekinesis","level":5,"stat":"arcana","tags":"spell, control, focus","strain":5,"dice":2,"effect":"Spend ## and 5 Strain; Focus on moving targets around for up to 1 hour. When cast or by spending ##, you may do an ARCANA contest against a creature or item within 18 tiles of you. If you win the target is Grappled by you and you may spend # to move the target up to 6 tiles. (This is classified as Knockback, and can take Knockback damage.) Creatures may break the Grapple by spending ## and doing an ARCANA contest against you. If you target an object you may manipulate it as if you were holding it.","activators":7},
    {"name":"haste","level":5,"stat":"arcana","tags":"spell, buff, focus, touch","strain":4,"dice":1,"effect":"Spend # and 4 Strain; Focus on a willing creature you touch for 1 minute. When they do a roll give them 2d6 on that roll. When this Art ends the creature gains 10 Stun and is Rooted for 2 turns (20 seconds).","activators":7},

    {"name":"rune gate","level":6,"stat":"arcana","tags":"spell, movement","strain":0,"dice":0,"effect":"Spend 5 minutes drawing, or 1 day carving, a set of runes onto a flat surface; When written you can create a gate to another Rune Gate. The gate lasts for 1 minute after which it closes. If the runes were drawn they burn away leaving an illegible scorch mark after the gate closes. If the runes were carved they stay on the surface. If there is more than one other Rune gate with the same rune code the gate opens to one of them randomly.","activators":5},

    {"name":"mental break","level":7,"stat":"arcana","tags":"spell, damage, debuff, ranged","strain":3,"dice":2,"effect":"Spend ## and 3 Strain; Do a Senses contest against a creature you can see.\nIf you win, they take damage equal to 4x the stat they rolled (minimum of 8 damage) and gain ARCANA stacks of Stun.\nIf you lose, the creature gains ARCANA stacks of Stun.","activators":6},




    {"name":"dramaturgy","level":1,"stat":"charm","tags":"spell, utility, illusion","strain":0,"dice":1,"effect":"Spend # and pick Grow or Wither, Set the Stage, Strange Steps, or BE LOUD; These effects last for up to 1 minute (6 turns) or until you dispel it.\n- Grow or Wither - Touch a small plant or seed. You make that plant grow or die and decay.\n- Set the Stage - You create a weak illusion that can cover everything within 3 tiles of you. This illusion can do things such as make the room noticeably darker, add colored lighting, simple effects such as sparks or thin smoke, or other similar effects.\n- Strange steps - Your footprints change, instead of leaving normal footprints you may instead grow small plants or flowers, leave behind illusionary fire, glowing foot prints, or a similar effect.\n- BE LOUD - Sounds you make become 3 times as loud.","activators":7},
    {"name":"minor illusion","level":1,"stat":"charm","tags":"spell, illusion, focus","strain":0,"dice":1,"effect":"Spend #; Focus on creating an Illusion of your choice that is no larger in size than 1 square tile within 8 tiles of you. A creature may do a Senses contest against you, to discern if it is an illusion. The illusion lasts for up to 1 minute, or can be animated to extend the duration.","activators":7},
    {"name":"motivate","level":1,"stat":"charm","tags":"insight, buff, dice","strain":0,"dice":1,"effect":"Spend #; Give a creature that can see or hear you the dice spent on this Art. You can only use this Art a number of times per Rest equal to 2+MIND+CHARM. If this Art is used outside of combat it gives a random d4.","activators":2},
    {"name":"enthrall","level":1,"stat":"charm","tags":"insight, control","strain":3,"dice":2,"effect":"Spend ## and 3 Strain or remove Charmed from the target; Do a Charm contest against a target you can see within 8 tiles of you. If you win, make them do any simple action that wouldn't knowingly harm themselves. (Use a 4 for any sums needed.)","activators":3},
    {"name":"heckle","level":1,"stat":"charm","tags":"insight, buff, ranged","strain":1,"dice":1,"effect":"Reaction (Locked #) and 1 Strain; When a creature you can see does an Attack give them +CHARM damage On Hit. (This Art has no effect if the target of the Attack can't hear you.)","activators":2},

    {"name":"footwork lure","level":2,"stat":"charm","tags":"technique, control, weapon","strain":1,"dice":2,"effect":"Spend ## and 1 Strain; Do a Melee Weapon Attack; if the target is within 1 tile of you, move the target to any tile within 2 tiles of you. (This ability counts as Knockback)","activators":1},
    {"name":"taunt","level":2,"stat":"charm","tags":"insight, control, debuff","strain":2,"dice":2,"effect":"Spend ## and 2 Strain; Do a CHARM contest against all creatures within 8 tiles of you. If you win, the creature can only look at and target you or themselves on their next turn.","activators":2},
    {"name":"for the crowd","level":2,"stat":"charm","tags":"insight, buff, debuff, aoe","strain":2,"dice":2,"effect":"Spend ## and 2 Strain and pick Empowered, Rallied, Charmed, or Marked; Do a CHARM contest against any number of creatures that can see or hear you within 18 tiles of you. If you win, the creature gains the chosen Status until the beginning of your next turn.","activators":2},

    {"name":"lightshow","level":3,"stat":"charm","tags":"spell, debuff, aoe, ranged","strain":1,"dice":2,"effect":"Spend ## and 1 Strain; Pick a tile you can see within 18 tiles of you. Do a Senses contest against all creatures within 3 tiles of this point.\nIf you win, the target gains 2 Stun and is Blinded for a number of turns equal to the stat they rolled (minimum of 1).\nIf you lose, the target is Blinded until the beginning of your next turn (10 seconds).","activators":5},
    {"name":"undeniable challenge","level":3,"stat":"charm","tags":"insight, control, debuff","strain":2,"dice":2,"effect":"Spend ## and 2 Strain; Do a BODY or CHARM contest against a creature within 8 tiles of you.\nIf you win, the target gets -1 damage, to a minimum of 1, against everything but you for up to 1 minute.\nIf you lose, the target gains 1 Stun.","activators":3},
    {"name":"dance of fools","level":3,"stat":"charm","tags":"spell, control, debuff, ranged","strain":2,"dice":2,"effect":"Spend ## and 2 Strain; Do a Charm contest against a non-Undead/Construct creature you can see.\nIf you win, for 1 minute (6 turns) the creature is Slowed and Charmed and at the beginning of your turn you may have the creature move 3 tiles in a direction you choose.\nIf you lose, the creature is Slowed and Charmed until the beginning of your next turn.","activators":6},

    {"name":"radiating aura","level":4,"stat":"charm","tags":"spell, aura, buff, debuff","strain":2,"dice":1,"effect":"Spend # and 2 Strain then pick Charmed, Glow, or Rallied;  Once per turn, when a target starts its turn in or enters your Aura they gain the chosen Status until the beginning of your next turn. ","activators":7},
    {"name":"quip","level":4,"stat":"charm","tags":"insight, debuff, ranged, reaction","strain":3,"dice":1,"effect":"Reaction (Locked #) and 3 Strain; When a creature does a contest or Attacks a target, do a CHARM contest against them.\nIf you win, force them to roll a d12 and replace the rolled d12 or Attack Sum.\nIf you lose, they have -1d4 on the roll or Sum.","activators":2},
    {"name":"greater illusion","level":4,"stat":"charm","tags":"spell, illusion, focus","strain":3,"dice":1,"effect":"Spend # and 3 Strain; Focus on creating an Illusion of your choice that is no larger in size than 6 square tiles within 18 tiles of you. A creature may do a Senses contest against you, to discern if it is an illusion. The illusion lasts for up to 10 minutes.","activators":7},

    {"name":"nightmare","level":5,"stat":"charm","tags":"spell, damage, ranged","strain":2,"dice":2,"effect":"Spend ## and 2 Strain; Spell Attack a creature within 18 tiles of you.\nOn Hit: The creature takes 2+2xCHARM damage. If the creature is asleep they cannot be woken up except by damage and don't wake up from this damage.\nBonus: The target gains 2 Stun.\nDownside: If the creature is sleeping they wake up.","activators":6},
    {"name":"fearsome roar","level":5,"stat":"charm","tags":"insight, control, ranged, aoe","strain":2,"dice":2,"effect":"Spend ## and 2 Strain; Do a CHARM or BODY contest against all creatures of your choice that can hear you. Undead, Constructs, and creatures you choose are unaffected by this Art.\nIf you win, the creature has -1 on all rolls against you (Attacks, Contests, etc) until the start of your next turn and must spend a dice on their next turn moving until they can no longer see you or run out of movement.\nIf you lose, the creature cannot willingly move toward you on their next turn.","activators":2},
    {"name":"captivated audience","level":5,"stat":"charm","tags":"insight, debuff, aoe, focus","strain":4,"dice":2,"effect":"Spend ## and 4 Strain; Focus on doing a Charm contest against all non-Undead/Constructs creatures of your choice that can hear or see you.\nIf you win, for up to 1 hour the creature is Charmed and has -1d4 on all rolls that do not relate to you.\nIf you lose, until the start of your next turn the creature is Charmed and has -1d4 on its next roll.","activators":3},

    {"name":"illusionary world","level":7,"stat":"charm","tags":"spell, illusion, control, focus","strain":4,"dice":3,"effect":"Spend ### and 4 Strain; Focus on trapping any number of creatures you can see in an illusionary World. These creatures become unconscious until they break free, take damage, or another creature spends ## to wake them. You may choose what this World looks like and how it acts. If a creature realizes they are in an illusionary World they may make a Senses contest against you in order to leave the world.\nIf you win, they lose their next turn (10 seconds) and cannot do this contest again until the end of your next turn.\nIf you lose, they wake up and are free from the World.","activators":7},

    {"name":"mind control","level":8,"stat":"charm","tags":"spell, control, focus","strain":6,"dice":3,"effect":"Spend ### and 6 Strain; Focus on doing a Charm contest against a non-Undead/Construct creature you can see. If you win, for 1 minute the creature becomes a Follower of you. When the creature would normally take its turn, or if it takes damage from any source, redo this Charm contest (This may happen multiple times a turn.). If you lose or lost Focus, the creature gains 4 Stun.","activators":7},
    




    {"name":"pocket dimension","level":1,"stat":"crafting","tags":"spell, utility","strain":0,"dice":1,"effect":"Spend #; Using a container you are touching no larger than 1 tile large, you may create a portal to empty space accessible through the opening of the container. The space is 1 square tile large, and every time you cast this spell it connects to the same space regardless of container. Only you can access this space, and if you die its contents are scattered through the planes. This effect lasts for 1 minute (6 turns) before the door to the pocket dimension closes.","activators":5},
    {"name":"awaken item","level":1,"stat":"crafting","tags":"spell, follower, touch","strain":2,"dice":3,"effect":"Spend ### and 2 Strain; Make a freestanding item into an Awakened Follower. The Awakened has 2+CRAFTING Max Health and Strain, 5 Speed, 0 in all Stats, and has the Construct tag. The Awakened can use its item as if it had the minimum stats to do so and gains any bonus as if the item was equipped. If the Awakened dies the item drops to the ground. If the item is destroyed (such as exploding a grenade) the Awakened dies.\n- The Awakened lasts until your next Break or Rest.","activators":7},
    {"name":"alarm","level":1,"stat":"crafting","tags":"technique, divination","strain":0,"dice":2,"effect":"Spend ## then pick Item, Sound, or Mark; Place an Alarm on an item or tile within 1 tile of you. An Alarm is triggered by specific events or creatures of your choice within 3 tiles of it (it may be timed). You may also state what won't trigger it, such as specific creatures. The Alarm lasts until you disable it or it triggers. Creatures may do a Senses contest against you to detect the Alarm. When triggered, do the chosen effect.\n- Item: The alarm triggers an item of your choice within 3 tiles of it.\n- Sound: The alarm rings out to a maximum of 1 large tile (2,160x2160 tiles). Creatures within 3 tiles of it are deafened for 1 minute. Alternatively, you may make it silent and only you may hear it.\n- Mark: The target that triggered the Alarm is Marked for 1 hour.","activators":1},
    {"name":"find object","level":1,"stat":"crafting","tags":"insight, divination, focus","strain":2,"dice":1,"effect":"Spend # and 2 Strain; Name or describe an object. The object can be a general item, such as a sword or crate, or it can be more specific such as a letter with a gold bird on its front. You can be as specific as you would like, such as 'My golden short sword'. You then Focus on knowing the approximate distance and direction of the nearest object you described. This has a max range of 1 large tile (2,160x2,160 tiles), failing if no item is within this range. This effect lasts 1 hour or until you see/touch the object.","activators":3},

    {"name":"oil patch","level":2,"stat":"crafting","tags":"technique, creation, utility, control, ranged","strain":1,"dice":1,"effect":"Spend # and 1 Strain; Create and burst a patch of oil at a point you can see within 18 tiles of you. Everything within 3 tiles of that point becomes covered in oil. If a creature moves across this patch they fall Prone unless the dice spent was a 5 or 6 (roll a d6 if not in combat). Targets covered in oil gain 2 extra Burn when they first gain Burn stacks. (Fire will spread through the oil).","activators":1},
    {"name":"spiny shield","level":2,"stat":"crafting","tags":"technique, protection, touch","strain":3,"dice":1,"effect":"Spend # and 3 Strain; Give a creature you touch Bonus SHIELDING equal to 2+CRAFTING. For the next minute or while they have this Bonus SHIELDING, they do 2 damage to any creature that hits them with a Melee Attack. ","activators":1},
    {"name":"spectral parachute","level":2,"stat":"crafting","tags":"spell, utility, movement","strain":1,"dice":1,"effect":"Spend # and 1 Strain; Pick up to 5 targets within 8 tiles of you. For the next 10 minutes, they are able to glide 2 tiles for every 1 tile they fall and cannot take fall damage.","activators":6},

    {"name":"spectral artillery","level":3,"stat":"crafting","tags":"spell, ranged, damage, aoe, utility","strain":3,"dice":2,"effect":"Spend ## and 3 Strain, then pick Explosive, Impact, Flash, or Smoke; Pick a number of tiles, up to your CRAFTING, that you can see. At the start of your next turn, artillery shots are fired from some far off place and land at the targeted tiles doing the chosen shots' effect. The artillery will hit roofs or tops of caves if its landing zone is covered.\n- *Explosive:* An explosion does 2 damage to everything within 2 tiles of the chosen tile.\n- *Impact:* A jolt of energy impacts the location dealing 5 damage to whatever it lands on.\n- *Flash:* A glowing orb lands giving all creatures within 2 tiles of the chosen area Blinded until the end of their turn. Afterwards the orb floats right above impact, lighting up everything within its radius for 10 minutes. \n- *Smoke:* A cloud of thick smoke (you may pick its color) encompasses everything within 3 tiles of the chosen tile. This effect can go around walls. For 10 minutes anything within this area is Obscured. \n","activators":7},
    {"name":"cube","level":3,"stat":"crafting","tags":"spell, creation, utility, focus","strain":1,"dice":1,"effect":"Spend # and 1 Strain; For up to 1 hour Focus on creating a freestanding Cube within 6 tiles of you. The Cube can be up to 1 tile long on any side, has 1 Health, and 4+2xCRAFTING SHIELDING. If you create the cube on a creature and do a Grapple contest against them, you may use Crafting for this contest.\nIf you win, the creature is confined within this Cube.\nIf you lose, the creature is pushed 1 tile.","activators":6},
    {"name":"tent","level":3,"stat":"crafting","tags":"spell, creation, utility","strain":0,"dice":0,"effect":"Spend 1 minute; Create a spectral tent for 12 hours. The tent can be up to 2 tiles square on the outside and 6 tiles square on the inside. When created you may have the tent contain: up to 3 beds, an empty chest 1 tile large, a table of any size, any number of chairs, a light which illuminates the entire tent, and a rug. Items made this way cannot leave the tent. Creatures and items inside the tent are placed in the nearest open tile when the tent disappears.","activators":5},

    {"name":"overclock","level":4,"stat":"crafting","tags":"insight, buff","strain":0,"dice":1,"effect":"Spend #; Touch a willing creature or machine. For a number of turns equal to the dice spent, a creature may spend 1 HEALTH or SHIELDING to do 2 extra damage on attacks (chosen before any Dodge rolls), gain 1 SPEED on a Move, or gain a 2 (dice with a value of 2). If a machine is targeted its abilities/effects are doubled and at the end of the duration roll a d6. On a 1 or 2 the machine breaks.","activators":1},
    {"name":"awaken swarm","level":4,"stat":"crafting","tags":"spell, follower","strain":3,"dice":3,"effect":"Spend ### and 3 Strain; Awaken up to 2xCRAFTING freestanding items nearby into a Swarm Follower. The Swarm counts as 1 creature, has 2xCRAFTING Max Health and Strain, 6 Speed, 0 in all other Stats, and has the Construct tag. It has a Ram Attack ('Club'), can use any item it is made of as if it had the minimum stats to do so, and can occupy another creature's space or vice versa. The swarm can move through any opening large enough for its objects.\n- The Swarm lasts until your next Break or Rest and cannot heal.\n","activators":7},
    {"name":"reinforce","level":4,"stat":"crafting","tags":"technique, protection, buff","strain":0,"dice":1,"effect":"Spend # and any amount of Strain; Give a creature within 1 tile of you Reinforced until the beginning of your next turn and Bonus Shielding equal to 2x the Strain spent. This Bonus Shielding lasts until your next Break or Rest.","activators":1},

    {"name":"equivalent exchange","level":5,"stat":"crafting","tags":"spell, control, utility","strain":6,"dice":0,"effect":"Spend 1 hour and 6 Strain; Choose an item or liquid no larger than 1 square tile. You may change one of the materials the item or liquid is made of into another. This change may turn lead into gold or water into wine. However, the mass of the material remains the same and so making a light wooden statue into a gold statue would change its size or structure.","activators":5},
    {"name":"create airship","level":5,"stat":"crafting","tags":"insight, creation, utility, movement","strain":10,"dice":0,"effect":"Spend 1 hour and 10 Strain; You may turn a boat, cart, or similar entity into a makeshift airship. This airship has 1 Health, 4xCRAFTING Shielding, 4 Speed, and has a max height of 1 medium tile (36 normal tiles) off the ground. This lasts for 1 day after which the airship returns to normal.","activators":5},
    {"name":"wall","level":5,"stat":"crafting","tags":"spell, creation, focus, protection","strain":2,"dice":1,"effect":"Spend # and 2 Strain; For up to 1 hour Focus on creating a Wall within 6 tiles of you. The Wall is up to 1 tile wide and can be up to 10 tiles long or tall. The Wall has 2+2xCRAFTING Health and Shielding. If a wall is made under a creature that creature is pushed up or to one side of the wall. If a creature cannot be pushed (from hitting a ceiling or wall) then the creature becomes Grappled and gains 8 stacks of Stun. Creatures and objects cannot move through the wall once made.","activators":6},
    {"name":"metal skin","level":5,"stat":"crafting","tags":"spell, protection, focus","strain":3,"dice":1,"effect":"Spend # and 3 Strain; Focus on making a willing creature you touch more resilient to damage. For the next hour, when the creature takes damage reduce it by 1. This cannot reduce damage below 1.","activators":3},

    {"name":"prop","level":6,"stat":"crafting","tags":"spell, control, focus, utility","strain":1,"dice":3,"effect":"Spend ### and 1 Strain; Focus on turning yourself into a freestanding  item of your choosing no smaller than your fist or larger than yourself. This effect lasts for up to 1 hour or until you dispel it. While you are a prop you do not need to breathe, are Rooted, and cannot activate Arts or use Items.","activators":5},

    {"name":"replicate","level":7,"stat":"crafting","tags":"technique, creation, utility","strain":0,"dice":0,"effect":"Spend 1 hour and money equal to the cost of the item being replicated; Pick a non-legendary item you are in possession of. You create a near exact copy of this item. A creature may do a Senses contest against you to determine if it is a replica. You have +2d4 on these contests.","activators":1},
    {"name":"sphere","level":7,"stat":"crafting","tags":"spell, creation, focus, protection","strain":3,"dice":1,"effect":"Spend # and 3 Strain; For up to 1 hour Focus on creating a Sphere within 6 tiles of you. The Sphere can be up to 3 tiles in radius (6 diameter) and may go through walls/floors. If the Sphere does not go through a wall or floor it may be moved by forces from the inside or outside. The Sphere has 2+2xCRAFTING Health and Shielding. While being made, if a creature would be inside the Sphere the creature is confined within it, and they have a Speed of 4. Creatures and objects cannot move through the Sphere once made.","activators":6},

    {"name":"awaken anything","level":9,"stat":"crafting","tags":"spell, follower, focus","strain":0,"dice":0,"effect":"Spend 1 week focusing on a non-living target or location; Make an item into an Awakened Follower (See 'Awaken Item') or something larger (such as a building) into an Animated Follower. The Animated has 8xCRAFTING Max Health and Strain, 5 Speed, 3 in all Stats, and has the Construct tag. The Animated does not take damage from effects that deal 4 or less damage (except Burn or Strain), may use any item inside of it as if it was apart of itself, has the Ram Attack with +8 on damage and Knockback, and becomes sentient, obeying its creator. If the Awakened dies the location returns to normal (maybe a little broken).","activators":7},





    {"name":"nature's tools","level":1,"stat":"nature","tags":"spell, utility, ranged","strain":0,"dice":1,"effect":"Spend #; Plants bloom or grow out from a surface within 6 tiles of you. These plants can be used to store items, as a rope, or removed for plant matter.","activators":7},
    {"name":"vine whip","level":1,"stat":"nature","tags":"spell, damage, movement, ranged","strain":0,"dice":2,"effect":"Spend ##; Spell Attack a target within 8 tiles of you.\nOn Hit: Do NATURE damage, and you may pull the target 2 tiles towards you or if you target a wall pull yourself NATURE tiles towards it.\nBonus: Double the distance pulled.","activators":5},
    {"name":"control elements","level":1,"stat":"nature","tags":"spell, utility, control","strain":0,"dice":1,"effect":"Spend #; You can change the general shape, color, and temperature of loose earth (such as dirt, gravel, or sand), non-magical gasses (such as fog, smoke, or air), fires, and water up to a maximum of 1 cubic tile. \n- *Some examples are; being able to freeze water, ignite or snuff out small fires, dry wet objects or creatures (remove 2 Wet per cast), make air bubbles in water (extends breathable air up to 10 minutes), and remove grime from surfaces.*","activators":5},
    {"name":"track creature","level":1,"stat":"nature","tags":"insight, focus, divination","strain":0,"dice":0,"effect":"Spend 1 minute; For up to an hour you Focus on following the path of a creature which you have named or have evidence of. If the creature is within 1 large tile (2,160 tiles) of you a path will appear up to 4 tiles in front of you, moving as you move.","activators":1},

    {"name":"rip and tear","level":2,"stat":"nature","tags":"technique, weapon","strain":1,"dice":2,"effect":"Spend ## and 1 Strain; Do a Weapon Attack, if you hit remove 3 SHIELDING then do the other Weapon effects.","activators":1},
    {"name":"thorny roots","level":2,"stat":"nature","tags":"spell, ranged, aoe, control, damage","strain":2,"dice":1,"effect":"Spend # and 2 Strain; Focus on a grounded point within 18 tiles of you. For up to 1 minute, surfaces within your NATURE tiles of this point become overgrown with thorny roots. This area counts as Rough Terrain and creatures which move through this area take 1 damage for every tile they move through it.","activators":3},
    {"name":"imbue","level":2,"stat":"nature","tags":"spell, buff, touch","strain":3,"dice":1,"effect":"Spend # and 3 Strain, then pick 2 Burn, Wet, Slow, or 3 Knockback; For up to 10 minutes your Weapon Attacks apply the chosen Status On Hit.","activators":4},

    {"name":"wall of thorns","level":3,"stat":"nature","tags":"spell, focus, protection, creation","strain":3,"dice":1,"effect":"Spend # and 3 Strain; Focus on summoning a Wall of Thorns within 6 tiles of you for up to 10 minutes. The Wall is up to 1 tile wide and can be up to 6 tiles long or tall. The Wall has 4+2xNATURE Health, and when a creature touches the wall you may deal 2 damage to them at the beginning of their turn. If a creature is knocked back into the Wall they take 4 extra damage. Creatures may climb the wall without doing a roll.","activators":3},
    {"name":"summon packmates","level":3,"stat":"nature","tags":"spell, follower","strain":3,"dice":3,"effect":"Spend ### and 3 Strain then pick Hunters or Family; Summon 2 Packmate Followers. Each Packmate has 2+NATURE Maximum Health and Strain, 6 Speed, 0 Dodge, 1 Body, 1 Nature, 0 in every other Stat, and has the Animal tag. It has 'Claws' (see weapons), and the below bonuses\n- *Hunters*: The Packmate does an additional damage against Marked targets and the Art 'track creature'.\n- *Family*: The Packmate has +1 Dodge if they are within 1 tile of an ally and the Art 'motivate' (Can be activated twice per Packmate).\n- The Pack lasts until your next Break or Rest.\n","activators":7},
    {"name":"winds grace","level":3,"stat":"nature","tags":"spell, focus, buff, touch, movement","strain":2,"dice":1,"effect":"Spend # and 2 Strain; Focus on giving a creature you touch 2 Speed for up to 1 hour.","activators":5},

    {"name":"crippling strike","level":4,"stat":"nature","tags":"technique, weapon, debuff","strain":1,"dice":2,"effect":"Spend ## and 1 Strain; Do a Weapon Attack, on hit give the target Slow until the start of your next turn, or if they already have Slow give them Rooted until the start of your next turn.","activators":1},
    {"name":"forest aura","level":4,"stat":"nature","tags":"spell, aura, debuff","strain":1,"dice":1,"effect":"Spend # and 1 Strain; Your Aura acts as Rough Terrain for anyone other than yourself, and you are immune to non-Art Rough Terrain. Any plants within this area blossom or bloom, and grass or moss grows if there wasn't plant-life there already.","activators":5},
    {"name":"elemental aura","level":4,"stat":"nature","tags":"spell, aura, elemental, utility","strain":2,"dice":1,"effect":"Spend # and 2 Strain then pick 2 Burn, Wet, Marked, or Obscured; You may willingly gain the chosen Status, while this Aura is active. Once per turn, when a target starts its turn in or enters your Aura they gain the chosen Status.","activators":5},

    {"name":"grounding roots","level":5,"stat":"nature","tags":"spell, damage, ranged","strain":3,"dice":2,"effect":"Spend ## and 3 Strain; Spell Attack a target within 36 tiles of you.\nOn Hit: Do 2+2xNATURE damage. If the target is flying they are forced to the ground (They take fall damage if possible).\nBonus: The target gains Rooted until the beginning of your next turn.","activators":3},
    {"name":"summon ironwood spirit","level":5,"stat":"nature","tags":"spell, follower","strain":5,"dice":3,"effect":"Spend ### and 5 Strain then pick Plant or Animal; Summon an Ironwood Spirit Follower. The Spirit has 3xNATURE Maximum Health and Strain, LEVEL Shielding, 6 Speed, 1 Dodge, 3 Nature, 1 in every other Stat, and the below bonuses.\n- *Plant*: It has the Monstrosity tag, and the Arts 'Vine Whip', 'thorny roots', 'forest aura', 'Get Behind Me', and 'telepathy'. The Spirit blends into any plant life and can become Hidden without doing a roll when doing so.\n- *Animal*: It has the Animal tag, 'Ripping Claws' (see weapons), the Arts 'mark', 'precision strike', 'fearsome roar', and 'Point Out'. The Spirit only takes damage from Attacks or Arts that deal 2 or more damage, and can be used as a Mount.\n- The Ironwood Spirit lasts until your next Break or Rest.\n","activators":7},
    {"name":"wings","level":5,"stat":"nature","tags":"spell, focus, touch, movement","strain":4,"dice":1,"effect":"Spend # and 4 Strain; Focus on granting a creature you touch wings for up to 1 hour. They are able to fly their Speed and when they do a Melee Attack may divebomb a target to gain +1 on the Attack Sum.","activators":6},

    {"name":"nature's wrath","level":6,"stat":"nature","tags":"spell, damage, aoe","strain":0,"dice":2,"effect":"Spend ## and any amount of Strain; Do a NATURE contest against everything within 3 tiles of you.\nIf you win, they take damage equal to twice the Strain spent.\nIf you lose, they take the Strain spent damage.","activators":5},
    {"name":"natural power","level":6,"stat":"nature","tags":"technique, buff, self","strain":3,"dice":1,"effect":"Spend # and 3 Strain; For a number of turns equal to the dice spent, you may use Nature instead of Body on rolls, can expend Empowered to heal 3 health, and you cannot become Rooted.","activators":1},
    {"name":"tree hop","level":6,"stat":"nature","tags":"spell, movement","strain":5,"dice":1,"effect":"Spend # and 5 Strain or Spend 24 hours binding your Soul to a tree turning it into a Soulbound tree; While you have a Soulbound tree you are able to walk into another tree to teleport yourself, and anyone touching you, to one of your Soulbound trees. You can have any number of Soulbound trees.","activators":5},

    {"name":"prison of thorns","level":7,"stat":"nature","tags":"spell, focus, control","strain":3,"dice":2,"effect":"Spend ## and 3 Strain; Focus on creating a Prison around a target you can see within 18 tiles of you. All tiles around the target grow thick thorny plants which block vision into or out of the Prison. The Prison has 4xNATURE health, 0 Dodge, and deals 2 damage to any creature that touches it or does a Melee Attack against it. Do a Nature contest against them.\nIf you win, the Prison lasts for 10 minutes.\nIf you lose, the Prison lasts for 1 minute.","activators":3},
    {"name":"sudden overgrowth","level":7,"stat":"nature","tags":"spell, focus, debuff, aoe","strain":5,"dice":1,"effect":"Spend # and 5 Strain; Focus on a grounded point within 18 tiles of you. For up to 1 minute, earth or plants erupt Rooting creatures within 4 tiles of this point until the bindings break. Each binding has 2xNATURE health and cannot heal.","activators":3},
    {"name":"life core","level":7,"stat":"nature","tags":"spell, focus, movement, utility","strain":3,"dice":1,"effect":"Spend # and 3 Strain; Focus on turning a willing creature you touch into a life core for up to 1 hour. All items they are wearing or carrying transform with them into their new form. While they are in this form they have +2 Speed, +2 Dodge, are 1/8th your normal size, have +1d4 on rolls to Hide, and cannot activate or use items. They may still move items.","activators":7},

    {"name":"conjure the ironwoods","level":8,"stat":"nature","tags":"spell, creation, control, aoe, focus","strain":5,"dice":3,"effect":"Spend ### and 5 Strain; Focus on growing a fragment of the Ironwoods around everything within 1 medium tile (36 tiles) of you for up to 1 hour. Plant life in this area becomes as hard as iron, everything in this area becomes Rough Terrain, and at the beginning of your turn (10 seconds) you may do a Spell Attack against up to NATURE creatures within the Ironwoods (Use a 8 for the Attack Sum).\nOn Hit: Do 1 damage, and move the target up to 2 tiles in a direction you choose.","activators":7},

    {"name":"dragon form","level":9,"stat":"nature","tags":"spell, control, buff, focus","strain":5,"dice":1,"effect":"Spend # and 5 Strain; Focus on transforming a willing creature into a Dragon. While they are a dragon, they may fly their Speed, become 1 size larger, Lock a 6 at the end of their turn, and once per turn may activate an Art of lvl 3 or less without spending Strain.","activators":7},




    
    {"name":"curse of pain","level":1,"stat":"medicine","tags":"spell, damage, ranged","strain":0,"dice":2,"effect":"Spend ##; Soul Attack a creature you can see within 18 tiles of you.\nOn Hit: For 1 minute or until you take damage from the creature The creature takes MEDICINE damage at the beginning of their turn. This cannot stack on the same target.\nBonus: Gain 1 Ward if you hit.","activators":6},
    {"name":"medical leeches","level":1,"stat":"medicine","tags":"insight, healing","strain":0,"dice":1,"effect":"Spend #; Touch a willing creature, remove all Statuses from them and do 3-MEDICINE damage (to a minimum of 0) to them.","activators":1},
    {"name":"blood transfusions","level":1,"stat":"medicine","tags":"insight, buff","strain":0,"dice":3,"effect":"Spend ### and 5-MEDICINE health; Give a target MEDICINE Bonus Max Health until the end of your next Rest. (This bonus max health is healed and this effect cannot Stack).","activators":1},
    {"name":"sleeping powder","level":1,"stat":"medicine","tags":"insight, debuff, control, ranged, aoe","strain":1,"dice":2,"effect":"Spend ## and 1 Strain; Pick a point you can see within 18 tiles of you. Do a SOUL or MEDICINE contest against creatures within 3 tiles of this point. Constructs, Undead, and already asleep Creatures are unaffected. \nIf you win, for 1 minute, a creature spends ##,  or until they take damage you forcefully put the creature to sleep.\nIf you lose, the creature gains Slow until the end of their next turn instead.","activators":1},

    {"name":"death's grasp","level":2,"stat":"medicine","tags":"spell, damage, ranged","strain":1,"dice":2,"effect":"Spend ## and 1 Strain; Do a Medicine contest against a creature you can see within 18 tiles of you.\nIf you win, the creature takes 2+MEDICINE damage, and cannot regain Health until the start of your next turn.\nIf you lose, the target cannot regain Health until the start of your next turn.","activators":5},
    {"name":"healing drop","level":2,"stat":"medicine","tags":"spell, healing, ranged","strain":2,"dice":1,"effect":"Spend # and 2 Strain; Heal a creature you can see within 8 tiles of you 2+MEDICINE. You cannot target Undead or Constructs. ","activators":6},
    {"name":"if these walls could talk","level":2,"stat":"medicine","tags":"spell, utility, divination","strain":3,"dice":0,"effect":"Spend 1 minute and 3 Strain at a specific location; The spirits whisper what happened up to 24 hours prior. You may ask up to your MEDICINE number of questions. The spirits will answer the best they can but will never give more than a rough description. The spirits also cannot describe something that happened through magic or if it was hidden with magic, such as a creature moving under the Invisibility spell.","activators":7},

    {"name":"healing bloom","level":3,"stat":"medicine","tags":"spell, healing, ranged, aoe","strain":4,"dice":1,"effect":"Spend # and 4 Strain; Heal all creatures within 4 tiles of you, except Undead and Constructs, up to 2+MEDICINE. ","activators":7},
    {"name":"summon zombie","level":3,"stat":"medicine","tags":"spell, follower","strain":3,"dice":3,"effect":"Spend ### and 3 Strain; Summon a Zombie Follower. The Zombie has 2xMEDICINE Maximum Health and Strain, LEVEL Shielding, 5 Speed, 0 Dodge, 1 Body, 0 in every other Stat, and has the Undead tag. It has 'Decaying Claws' (see weapons), the Art 'Lunge', and when it hits 0 Health roll 1d6. On a 2 or higher it lives on 1 hp. Increase this difficulty by 1 each time it survives.\n- The Zombie lasts until your next Break or Rest and cannot heal.\n- If you target a non-Undead/Construct dead body when activating this Art the Zombie lasts until it dies.","activators":3},
    {"name":"spirit walk","level":3,"stat":"medicine","tags":"spell, movement, utility","strain":3,"dice":1,"effect":"Spend # and 3 Strain; Touch a willing Creature. They gain Slow and can move through non-metal walls until the start of your next turn (10 seconds).","activators":6},

    {"name":"soul slash","level":4,"stat":"medicine","tags":"spell, damage, touch","strain":1,"dice":2,"effect":"Spend ## and 1 Strain; Do a Melee Spell Attack.\nOn Hit: The target spends 2+MEDICINE Strain.\nBonus: If you hit refund 2 Strain.\nDownside: You spend 1 extra Strain.","activators":5},
    {"name":"purge","level":4,"stat":"medicine","tags":"insight, protection","strain":3,"dice":1,"effect":"Spend # and 3 Strain; Touch a target under the effects of Magic. Remove all magical effects on the target for 1 hour. You learn the source of the magic and if the target is Cursed, you learn how to break the curse.","activators":5},
    {"name":"final words","level":4,"stat":"medicine","tags":"spell, utility, divination","strain":2,"dice":1,"effect":"Spend # and 2 Strain; Target a dead non-Construct creature within 3 tiles of you. The soul of the creature will then awaken to answer up to 3 questions. The soul has all of its memories from when it was alive and maintains its personality. (There is a high chance that if you killed the creature it would not talk to you.) This spell cannot make the creature intelligent or teach them your language (such as with an animal). This spell will end once 3 questions are asked of it or after an hour.","activators":7},
    {"name":"overexert","level":4,"stat":"medicine","tags":"insight, buff, movement, focus","strain":3,"dice":1,"effect":"Spend # and 3 Strain then pick Body, Mind, or Soul; Focus on making a willing creature you touch overexert themselves. For the next hour, the creature gains +1 on Checks and Contests for the chosen stat and the following bonus based on stat. After you lose Focus or the Art ends the creature gains one stack of Exhaustion.\n- *Body* - You may do 4 Movement actions per turn.\n- *Mind* - You may add +1 when you Lock a dice. (This can't make a dice value go above a 6.)\n- *Soul* - [!!May be Altered!!] When you refund Strain refund 1 additional Strain.","activators":5},

    {"name":"life from death","level":5,"stat":"medicine","tags":"spell, damage, aoe, ranged, healing","strain":3,"dice":2,"effect":"Spend ## and 3 Strain; Pick a point within 18 tiles of you. Do a Spell Attack against every creature within 3 tiles of that point.\nOn Hit, do MEDICINE damage to the target and Heal a creature you can see for that amount. (Each hit activates separately.)\nBonus: Do 2xMedicine damage.\nDownside: This does not heal.","activators":5},
    {"name":"summon undead","level":5,"stat":"medicine","tags":"spell, follower","strain":4,"dice":3,"effect":"Spend ### and 4 Strain then pick Ghost or Fleshbeast; Summon a Undead Follower. The Undead has 3xMEDICINE Maximum Health and Strain, LEVEL Shielding, 5 Speed, 0 Dodge, 3 Medicine, 1 in every other Stat, has the Undead tag, and the below bonuses. \n- *Ghost*: The Ghost Undead has the Arts 'curse of pain', 'death's grasp', 'spirit walk', and 'If These Walls Could Talk'. The Ghost Undead can fly and may move through walls or floors as if it was Rough Terrain.\n- *Fleshbeast*: The Fleshbeast Undead has the Monstrocity tag, 'Heavy Slap' (see weapons), and the Arts 'Lunge', 'Flex', and 'medical leeches'. The Fleshbeast Undead may consume a non-Construct dead body to gain MEDICINE maximum health (This also heals it that much). The body must be within 1 tile of the Fleshbeast Undead but this action does not require dice.\n- The Undead last until your next Break or Rest and cannot be healed by other sources.","activators":7},
    {"name":"ritual of revival","level":5,"stat":"medicine","tags":"spell, healing","strain":0,"dice":0,"effect":"Spend 1 minute; For the next minute (6 turns), once per turn, you and any creature nearby may roll a d6+MEDICINE. On a 5 or higher the ritual gets 2 stacks. On a 3 or higher, the ritual gets 1 stack. After 1 minute you may target a dead creature within 6 tiles of you. If the total number of stacks is 18 or higher the creature is revived. The creature's Soul must be free, and the creature cannot have been dead for more than an hour. If the creature has been revived with this ritual before, increase the stacks needed by 2x the number of times they have been revived this way.","activators":7},

    {"name":"spreading plague","level":6,"stat":"medicine","tags":"insight, debuff, damage, focus","strain":3,"dice":3,"effect":"Spend ### and 3 Strain then pick Decay, Sick, or Delusional; Focus on creating a Plague. Target a creature you can see. They get the Plague. You may spend 1 Strain to have another creature within 3 tiles of a Plague victim gain the Plague (you do not need to see the victims but must know of them).\n- *Decay*: At the end of their turn they take 2 damage, down to a minimum of 1 heath.\n- *Sick*: They are permanently Slow, and gain 2 Stun every other turn. \n- *Delusional*: They must roll a 1d4 when they target something with an Art or Attack. On a 3 or 4 they target what they want. On a 2 they activate the Art targeting nothing (still spending Strain/dice). On a 1 you may pick the target.\n","activators":1},
    {"name":"wings of mercy","level":6,"stat":"medicine","tags":"spell, healing, movement","strain":2,"dice":1,"effect":"Spend # and 2 Strain; Teleport to a creature (other than yourself) that you can see. Heal the target up to 2+MEDICINE. You cannot target Undead or Constructs.","activators":5},
    {"name":"ghost","level":6,"stat":"medicine","tags":"spell, movement, buff","strain":5,"dice":1,"effect":"Spend # and 5 Strain; Focus on turning a willing creature you touch into a ghost. They gain Slow, can move through non-metal walls for up to 10 minutes, and have +1 Dodge against non-Art attacks.","activators":6},

    {"name":"paralyzing touch","level":7,"stat":"medicine","tags":"technique, debuff, touch","strain":4,"dice":2,"effect":"Spend ## and 4 Strain; Do a Melee Spell Attack. On Hit: Give the target 99 Stun and Rooted.","activators":1},
    {"name":"regeneration","level":7,"stat":"medicine","tags":"spell, healing","strain":5,"dice":3,"effect":"Spend ### and 5 Strain; Touch a non-Undead/Construct Creature. They are healed to full health. They regenerate any lost limbs and heal all permanent wounds and scars.","activators":7},
    {"name":"summon spirit","level":7,"stat":"medicine","tags":"spell, follower","strain":7,"dice":3,"effect":"Spend ### and 7 Strain; Say the name of another creature. If the creature is willing a fragment of the creature's Soul then appears within 1 tile of you as a Spirit Follower. If the creature is unwilling the activation fails. The Spirit has 1/4'th the normal Health, Shielding, and Strain. They have all Traits, Arts, and Items that are currently on them, or was on them in life if they are dead. The Spirit lasts until it has 0 health or the end of your next Break or Rest.\n- If the creature is alive they go unconscious until the Spirit disappears.","activators":7},

    {"name":"well of souls","level":8,"stat":"medicine","tags":"spell, damage, aoe, ranged","strain":5,"dice":2,"effect":"Spend ## and 5 Strain; Do a Soul Contest against all targets of your choice within 6 tiles of you.\nIf you win, the target takes 4xMEDICINE damage.\nIf you lose, the target takes 2xMEDICINE damage.","activators":6},
    {"name":"door stop","level":8,"stat":"medicine","tags":"spell, healing, protection","strain":5,"dice":3,"effect":"Spend ### and 5 Strain; Touch a Creature, the next time the creature goes to 0 health they are healed to full and remove this effect. The creature is not given Death's Door for this action. This effect lasts for 12 hours. If this spell triggers or ends the creature cannot be affected by this spell for 1 week.","activators":7},
    
    {"name":"revivify","level":9,"stat":"medicine","tags":"spell, healing","strain":9,"dice":0,"effect":"Spend 1 hour and 9 Strain; Revive a dead creature. You must have at least 60% of the body (though it may be ash) and the creature's soul must be free. The creature comes back to life with 1 Health regenerating any lost limbs and healing all wounds and scars.","activators":7},
    {"name":"lichlife","level":9,"stat":"medicine","tags":"insight, healing","strain":0,"dice":0,"effect":"Spend 12 hours etching runes into a dead body; When you die your soul inhabits the dead body. You revive into this dead body, retaining your Traits and Arts, but having the Undead tag.","activators":5},
    {"name":"summon undead legion","level":9,"stat":"medicine","tags":"spell, follower","strain":10,"dice":0,"effect":"Spend 1 hour and 10 Strain; Summon 4 Undead Legionary Hordes as Followers (4 Undead Legionaries each). You may pick which version of Undead Legionary (see creatures) each Horde is.","activators":7},





    {"name":"phantom fishing rod","level":1,"stat":"thieving","tags":"spell, utility, control, ranged","strain":0,"dice":2,"effect":"Spend ##; Attack a target within 18 tiles of you, increase this range by your Max Strain. If you are targeting a small object or small creature you always hit. You can use this as a normal fishing rod.\nOn Hit: Pull small targets to you or pull the target 4 tiles towards you. (This counts as Knockback.)\nBonus: +THIEVING to distance pulled.","activators":5},
    {"name":"uncanny climb","level":1,"stat":"thieving","tags":"technique, focus, movement","strain":1,"dice":1,"effect":"Spend # and 1 Strain; Focus on making a creature you touch able to walk on walls and ceilings for up to 1 hour.","activators":1},
    {"name":"dark mists","level":1,"stat":"thieving","tags":"insight, focus, utility","strain":1,"dice":1,"effect":"Spend # and 1 Strain; Focus on creating a thick dark Mist for up to an hour. Pick a tile you can see within 18 tiles of you. The Mist spreads out from this point covering everything within 3+THIEVING tiles. The Mist will go around corners and through cracks in walls. Targets within this area are Obscured.","activators":1},
    {"name":"illusionary disguise","level":1,"stat":"thieving","tags":"spell, illusion","strain":0,"dice":0,"effect":"Spend 1 minute; Focus on surrounding yourself with illusions which visually change your appearance. The illusion can change your physical appearance, your clothes, and the way you smell. You may also add an unusual addition to your appearance, such as glowing eyes, tiny spirits around you, flames on your hat, etc. These changes are only illusions and attempting to interact with them will reveal them as such. A creature can do a Senses contest against you to discern if it is an illusion. This effect lasts until your next Break or Rest.","activators":5},

    {"name":"precision strike","level":2,"stat":"thieving","tags":"technique, weapon","strain":1,"dice":2,"effect":"Spend ## and 1 Strain; Do a Weapon Attack with +3 on the Attack sum (This +3 does not give Bonuses or Downsides only the original sum does).","activators":1},
    {"name":"invisibility","level":2,"stat":"thieving","tags":"spell, focus, illusion","strain":2,"dice":1,"effect":"Spend # and 2 Strain; Focus on making a creature you touch Invisible for up to 1 hour. If the creature does an Attack or activates an Art they lose Invisible. You may activate this Art again on a different creature Focusing on all instances of this spell without losing Focus or breaking Invisibility.","activators":4},
    {"name":"shadow self","level":2,"stat":"thieving","tags":"spell, illusion, utility","strain":1,"dice":1,"effect":"Spend # and 1 Strain; Turn your Shadow into a tangible creature. When cast or by spending # you may move your Shadow up to your SPEED. Your Shadow can manipulate items, and you may activate Arts or do Attacks through your shadow. Your Shadow has 1 Health and 0 Dodge. \n- While your shadow is a creature you do not have a shadow and if it was to die your shadow would be returned to you. You may have your shadow act independently of you, however it cannot activate Arts or do Attacks on its own. (It is not a Follower)","activators":2},
    {"name":"toppling bola","level":2,"stat":"thieving","tags":"technique, ranged, debuff","strain":1,"dice":2,"effect":"Spend ## and 1 Strain; Do a THIEVING contest against a target you can see within 18 tiles of you.\nIf you win, the target becomes Prone and can only do 2 Move actions on their turn. (Getting up from Prone is a Move action.)\nIf you lose, the target gains Slow until the beginning of your next turn.","activators":1},

    {"name":"hamstring","level":3,"stat":"thieving","tags":"technique, weapon","strain":2,"dice":2,"effect":"Spend ## and 2 Strain; Do a Melee Weapon Attack. If you hit, the target takes 1 damage for every tile they willingly move until the start of your next turn.","activators":1},
    {"name":"silencing aura","level":3,"stat":"thieving","tags":"spell, aura, utility, debuff","strain":0,"dice":1,"effect":"Spend #; Creatures in your Aura make no noise while moving and leave no trail. When a creature first moves into your Aura or starts their turn in it you may spend 2 Strain to silence them, making them unable to make sounds or activate Arts until the beginning of your next turn.","activators":5},
    {"name":"shadow step","level":3,"stat":"thieving","tags":"spell, movement","strain":2,"dice":1,"effect":"Spend # and 2 Strain; Teleport to a shadow you are aware of and would be completely covered by, that is within 18 tiles of you. ","activators":1},

    {"name":"exploit weakness","level":4,"stat":"thieving","tags":"insight, weapon","strain":1,"dice":2,"effect":"Spend ##, 1 Strain, and a negative Status on the target; Do a Weapon Attack with +1d4 to the Attack Sum and Damage. (This +1d4 does not give Bonuses or Downsides, only the original sum does.)","activators":3},
    {"name":"blind spot","level":4,"stat":"thieving","tags":"technique, buff, self","strain":2,"dice":1,"effect":"Spend # and 2 Strain; If the dice given was a 5 or 6 become Hidden until the start of your next turn.","activators":1},
    {"name":"hollow heart","level":4,"stat":"thieving","tags":"insight, buff, touch","strain":1,"dice":1,"effect":"Spend # and 1 Strain; Touch a willing creature. For the next hour their heart stops, skin turns pale, and they are perceived to be dead while not moving by both magic and investigation (They are still a creature). In this state they cannot be detected by magic and Undead will not attack them unless provoked.","activators":1},

    {"name":"open wounds","level":5,"stat":"thieving","tags":"technique, debuff, ranged","strain":4,"dice":1,"effect":"Spend # and 4 Strain; Target a wounded creature. Until the start of your next turn when that creature spends dice it takes 1 damage. If the creature is Wet it takes 2 additional damage instead.","activators":1},
    {"name":"mist form","level":5,"stat":"thieving","tags":"spell, focus, movement, touch","strain":4,"dice":1,"effect":"Spend # and 4 Strain; Focus on making a creature you touch into a misty form for up to 1 hour. While they are in this form they are able to fly and may move through cracks in walls.","activators":5},
    {"name":"illusionary costumes","level":5,"stat":"thieving","tags":"spell, illusion","strain":0,"dice":0,"effect":"Spend 10 minutes or 1 minute if you only target a single creature; Focus on surrounding any number of creatures you can see with illusions which visually change their appearance. The illusion can change physical appearance, clothes, and the creature's smell. You may also add an unusual addition to the appearances, such as glowing eyes, tiny spirits, flames on clothing, etc. These changes are only illusions and attempting to interact with them will reveal them as such. A creature can do a Senses contest against you to discern if it is an illusion. This effect lasts until your next Break or Rest.","activators":5},
    
    {"name":"bleed out","level":6,"stat":"thieving","tags":"insight, damage, debuff, ranged","strain":4,"dice":1,"effect":"Spend # and 4 Strain; Target a wounded creature. Until the start of your next turn when that creature takes damage it takes an additional damage. If the target is Marked it takes 2 additional damage instead.","activators":1},
    {"name":"monsters in the shadows","level":6,"stat":"thieving","tags":"spell, follower","strain":6,"dice":3,"effect":"Spend ### and 6 Strain; Create a Monster in the shadows Follower. The Monster has 4 Thieving, 0 in every other Stat, and has the Planar tag. It has Claws (see weapons), only exists in the shadows, and cannot be targeted. If the shadow it is in is fully illuminated it dies. It may Grapple one target and pull them into the shadows, and may teleport to any shadow within 1 large tile (2,160x2160 tiles) when it moves. If the Monster drops something it will appear in the nearest safe tile.\n- The Monster lasts until your next Break or Rest.\n","activators":7},
    {"name":"shroud","level":6,"stat":"thieving","tags":"spell, illusion, aoe","strain":3,"dice":1,"effect":"Spend # and 3 Strain; Focus on creating a thick Shroud of darkness or mist for up to an hour. Pick a tile you can see within 18 tiles of you. The Shroud spreads out from this point covering everything within 4+THIEVING tiles. The Shroud will go around corners and through cracks in walls. Targets within this area are Obscured and creatures of your choice have +1 Speed or take +1 Damage while within the Shroud.","activators":3},
    
    {"name":"unrelenting pursuit","level":7,"stat":"thieving","tags":"spell, movement","strain":4,"dice":1,"effect":"Spend # and 4 Strain; Focus on a target within 8 tiles of you. At the beginning of your turn, or when you cast the spell, you teleport to a safe tile within 1 tile of them.","activators":5},
    
    {"name":"undeniable strike","level":8,"stat":"thieving","tags":"technique, weapon","strain":3,"dice":2,"effect":"Spend ## and 3 Strain; Do a Weapon Attack. If you miss, hit the target with the Weapon Downside. You cannot gain a Weapon Bonus for this hit and you cannot gain a Downside multiple times.","activators":1},

    {"name":"perfect strike","level":9,"stat":"thieving","tags":"technique, weapon","strain":0,"dice":2,"effect":"Spend ## and any amount of Strain; Do a Weapon Attack with a bonus to the Attack Sum equal to the 2x Strain spent.","activators":1},





    {"name":"ignition","level":1,"stat":"nature","tags":"elemental, spell, ranged, damage, utility","strain":0,"dice":2,"effect":"Spend ##; Do a Thrown Spell Attack against a target within 8 tiles of you or you can hold it as a Burning Molt which has Glow.\nOn Hit: Apply 2 Burn.\nBonus: Ignite the tile they are standing on until the start of your next turn. Creatures which start their turn in this tile or move into it gain 1 Burn.","activators":5},
    {"name":"water whip","level":1,"stat":"nature","tags":"elemental, spell, damage, ranged, utility","strain":0,"dice":2,"effect":"Spend ##; Do a Spell Attack against a target within 8 tiles of you.\nOn Hit: Apply or remove Wet. If you remove Wet do damage equal to your SOUL+NATURE.\nBonus: Do both in the order of your choosing.","activators":1},
    {"name":"poprocks","level":1,"stat":"nature","tags":"elemental, spell, damage, control","strain":0,"dice":2,"effect":"Spend ##; Do a Thrown Spell Attack against a target within 8 tiles of you.\nOn Hit: Move the target in any direction up to your NATURE.\nBonus: The distance is equal to 2xNATURE.","activators":5},
    {"name":"short circuit","level":1,"stat":"nature","tags":"elemental, spell, ranged, damage, utility","strain":0,"dice":2,"effect":"Spend ##; Do a Spell Attack against a target within 8 tiles of you. If you target a Gadget or Mechanism you may activate or deactivate it for 1 minute (6 turns).\nOn Hit: Do damage equal to your NATURE.\nBonus: If the target is Wet, remove Wet then give them 2 Burn.","activators":5},

    {"name":"elemental burst","level":2,"stat":"nature","tags":"elemental, spell, ranged, aoe","strain":3,"dice":2,"effect":"Spend ## and 3 Strain then pick Fireball, Rain, Quake, or Freezing Winds; Pick a point you can see within 18 tiles of you. A burst covers everything within 3 tiles of the chosen point. \n- *Fireball*: Ignite all tiles within this area until the start of your next turn. When a target starts their turn in or enters these tiles they gain 2 Burn.\n- *Rain*: Refund 2 Strain then everything within this area gains Wet for 1 hour.\n- *Quake*: If this area is Wet, it becomes Rough Turrain. Creatures in this area do a Body contest against your Nature. If you win, they take NATURE damage (min 2) and fall Prone. If you lose, they take 2 damage.\n- *Freezing Winds*: Creatures in this area gain Slow until the start of your next turn. If they are Wet they gain Rooted until the start of your next turn.","activators":7},
    {"name":"waterdance aura","level":2,"stat":"nature","tags":"elemental, spell, aura, movement","strain":1,"dice":1,"effect":"Spend # and 1 Strain; Creatures that enter or start their turn in your Aura may walk on water until the start of their next turn and gain +1 SPEED when doing so. Affected creatures do not fall through snow and cannot slip on ice.","activators":5},
    {"name":"wind launch","level":2,"stat":"nature","tags":"elemental, spell, movement","strain":2,"dice":1,"effect":"Spend # and 2 Strain; Launch yourself in any direction of your choosing up to 4+MIND+NATURE tiles.","activators":3},

    {"name":"frozen flames","level":3,"stat":"nature","tags":"elemental, spell, damage, debuff, ranged","strain":2,"dice":2,"effect":"Spend ## and 2 Strain then pick Frost or Flames; Spell Attack a target you can see within 18 tiles of you. \n- *Frost*: On Hit: Give 2 Stun. If the target has Wet remove Wet and give NATURE Stun instead. \n- *Flame*: On Hit: Apply 3 Burn. \nBonus: Do Frost then Flame.\nDownside: -1 Stun or Burn.\n","activators":5},
    {"name":"chain lightning","level":3,"stat":"nature","tags":"elemental, spell, ranged, damage","strain":3,"dice":2,"effect":"Spend ## and 3 Strain; Attack a target you can see within 18 tiles of you. \nOn Hit: Do 2+NATURE damage. Then pick a new target within 4 tiles of this one and do this Attack against them. \nBonus: If the target is Wet, remove Wet then pick a new target within 4 tiles of this one and do this Attack against them (This happens regardless of if it hits). \nDownside: -2 damage.","activators":7},
    {"name":"earthen armor","level":3,"stat":"nature","tags":"elemental, spell, protection, focus, touch","strain":2,"dice":1,"effect":"Spend # and 2 Strain; Focus on a target you touch for up to 10 minutes. On activation the target gains NATURE Bonus Shielding. Until the Art ends, they can't be affected by Knockback, and only takes damage from Attacks or Arts that deal 2 or more damage.","activators":1},
    {"name":"still winds","level":3,"stat":"nature","tags":"elemental, spell, protection, utility, aoe, focus","strain":3,"dice":1,"effect":"Spend # and 3 Strain; Focus on point within 18 tiles of you. The air within 3 tiles of this point becomes still, sound within this area is muffled becoming impossible to understand and creatures cannot do Attacks and activate Traits or Arts that would enter or exit this area.","activators":6},

    {"name":"volatile steps","level":4,"stat":"nature","tags":"elemental, spell, movement, damage","strain":2,"dice":1,"effect":"Spend # and 2 Strain then pick Fire or Wind; Move your SPEED, Until the end of your turn when you move, do the chosen effect.\n- *Fire*: Ignite tiles you move on until the start of your next turn. When a target starts their turn in or enters any of these tiles they gain 2 Burn.\n- *Wind*: You may move through creatures. Do a Nature contest against creatures you move though. If you win, the creature takes NATURE damage, and if the target is Wet, remove Wet then give them 1 Stun.\n","activators":5},
    {"name":"drill shot","level":4,"stat":"nature","tags":"elemental, spell, damage, ranged","strain":2,"dice":2,"effect":"Spend ## and 2 Strain; Spell Attack a target within 18 tiles of you.\nOn Hit: Remove NATURE Shielding then do NATURE damage.\nBonus: Do 2x NATURE damage on Hit instead.","activators":1},
    {"name":"wave","level":4,"stat":"nature","tags":"elemental, spell, ranged, control","strain":2,"dice":2,"effect":"Spend ## and 2 Strain; Create a wave of water or mud starting from 1 tile behind you. The wave can be 6 tiles wide and up to 2 tiles tall. The wave moves forward 8 tiles in a line. Everything, excluding yourself, that is within this path must do a BODY contest against your NATURE. If you win, the target is pushed to the end of the wave and is Wet. If a creature cannot be pushed (from hitting a wall) then the target takes Knockback damage. If you lose, the target is Wet and is not pushed. You may ride this wave.","activators":7},

    {"name":"heat metal","level":5,"stat":"nature","tags":"elemental, spell, ranged, focus, damage","strain":3,"dice":2,"effect":"Spend ## and 3 Strain; Focus on a metal object you can see within 18 tiles of you for 1 minute. The object becomes white-hot and illuminates 2 tiles around it. Any creature that touches the object for the first time in a turn gains 3 Burn. Creatures gain an additional 1d4 when doing Crafting rolls with the object.","activators":7},
    {"name":"sandstorm","level":5,"stat":"nature","tags":"elemental, spell, ranged, aoe, debuff","strain":3,"dice":1,"effect":"Spend # and 3 Strain; Focus on a point within 36 tiles of you for up to 10 minutes. You may spend # to move this point up to 6 tiles. Everything within 3 tiles of this point becomes Rough Terrain, is Obscured, and Creatures within the area are Blinded.","activators":3},
    {"name":"puddle walker","level":5,"stat":"nature","tags":"elemental, spell, movement","strain":2,"dice":1,"effect":"Spend # and 2 Strain; Jump into a patch of Wet ground or liquid big enough to stand on. You then teleport to another patch of Wet ground or liquid within 18 tiles of you.","activators":5},

    {"name":"wildfire","level":6,"stat":"nature","tags":"elemental, spell, ranged, aoe, damage, focus","strain":4,"dice":3,"effect":"Spend ### and 4 Strain; Focus on starting a wildfire for up to 10 minutes. On activation or at the beginning of your turn ignite 2xNATURE tiles within 36 tiles of you until the Art ends. When a target starts their turn in or enters any of these tiles they gain 2 Burn.","activators":7},
    {"name":"storm","level":6,"stat":"nature","tags":"elemental, spell, ranged, aoe, damage, focus, utility","strain":4,"dice":3,"effect":"Spend ### and 4 Strain; Focus on conjuring a Storm covering everything within 1 medium tile (36x36 tiles) for up to 10 minutes. On activation or at the beginning of your turn all targets within the Storm gain Wet if not under cover and you may do a Nature contest against a target within 36 tiles of you.\nIf you win, they take 2xNATURE damage, and if they have Wet remove Wet and do 3xNATURE instead.\nIf you lose, they take 2 damage instead.","activators":7},
    {"name":"earthquake","level":6,"stat":"nature","tags":"elemental, spell, ranged, aoe, damage, focus","strain":4,"dice":3,"effect":"Spend ### and 4 Strain; Focus on making an Earthquake for up to 10 minutes. On activation or at the beginning of your turn do a Body contest against your Nature against everything within 36 tiles of you.\nIf you win, they take 2 damage and go Prone. Objects and Structures take 6 damage instead.\nIf you lose, they gain Slow.","activators":7},
    {"name":"tornado","level":6,"stat":"nature","tags":"elemental, spell, ranged, aoe, damage, focus","strain":4,"dice":3,"effect":"Spend ### and 4 Strain; Focus on a point within 36 tiles of you for up to 10 minutes. You may spend # to move this point up to 6 tiles. A tornado appears at this point and anything within 2 tiles of this point must do a Body contest against your Nature.\nIf you win, they are thrown 3xNATURE tiles in a direction you choose. Objects are thrown 4xNATURE instead. (This movement counts as Knockback and can take Knockback damage.)\nIf you lose, they are thrown NATURE tiles instead.","activators":7},

    {"name":"castle of stone","level":7,"stat":"nature","tags":"elemental, spell, protection, utility, creation","strain":0,"dice":0,"effect":"Spend 8 hours; Create a castle made of stone, earth, or plant matter. The castle may have up to 6 outer walls, 6 defensive towers, an inner keep with any number of rooms, and a moat with at least one drawbridge. The castle must have a way in and out, aside from the sky, and must be on solid ground. The castle may be up to 3 medium tiles square in size (108x108 normal tiles).","activators":5},

    {"name":"incinerate","level":8,"stat":"nature","tags":"elemental, damage, spell","strain":0,"dice":2,"effect":"Spend ## and any amount of Strain; Do a Spell Attack against a target you can see within 18 tiles of you.\nOn Hit: Give the target 2xStrain spent Burn.\nBonus: Give 3xStrain spent Burn instead.","activators":7}
]