[
  {
    "id": 89,
    "name": "rune maker",
    "effect": "At the end of a Rest you can craft 2 Lesser Runes of your choosing. If you craft different runes using this feature the oldest rune gets replaced. This skill can be taken multiple times to increase the number of runes by 1.",
    "req": [
      "arcana 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 90,
    "name": "discover rune of soul skip",
    "effect": "You have learned how to create a Unique Rune of Soul Skip. At the end of a rest, you can create 1 Rune of Soul Skip and apply it to an item. Only 1 instance of this rune can exist at any time and attempting to create a second will destroy the first.\nRune of Soul Skip: You can cast Soul Skip without gaining Soul Strain a number of times per day equal to your Arcana reseting at Dawn.",
    "req": [
      "arcana 3"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 91,
    "name": "runic carver",
    "effect": "At the end of a Rest you can craft 1 Greater Rune and 1 Lesser Runes of your choosing. If you craft different runes using this feature you replace the preveously made one of the same level.",
    "req": [
      "arcana 4"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 92,
    "name": "runic master",
    "effect": "At the end of a Rest you can craft 2 Greater Runes of your choosing. If you craft different runes using this feature the oldest rune gets replaced.",
    "req": [
      "arcana 6"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 2,
    "name": "weapon attack",
    "effect": "Use your weapon to hit a target. To hit a target you must give 2 dice, possibly doing a bonus effect based on the sum of the roll and the weapon used. Then when doing damage removing damage from the target based on its Armor and Ward.",
    "req": [
      "base 0"
    ],
    "dice": 2,
    "is_passive": false
  },
  {
    "id": 4,
    "name": "use an item",
    "effect": "Use an item that is from your bag, or is within 1 tile of you in the world.",
    "req": [
      "base 0"
    ],
    "dice": 2,
    "is_passive": false
  },
  {
    "id": 395,
    "name": "undergrounder",
    "effect": "Darkness does not scare you. You can cast Glow at will, and Fog Light once per Rest.",
    "req": [
      "base 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 3,
    "name": "spell casting",
    "effect": "Gain Soul Strain to Cast a spell from your Spell list. Soul Strain cost, dice cost, and effect depend on spell.",
    "req": [
      "base 0"
    ],
    "dice": 4,
    "is_passive": false
  },
  {
    "id": 399,
    "name": "sparked draconic",
    "effect": "Lightning: You can cast Lightning once per Rest without gaining Soul Strain. You use your Core Skill instead of Soul when casting this spell.",
    "req": [
      "base 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 391,
    "name": "shortstack",
    "effect": "You are small, and are able to squeeze into places you normally wouldn't. You act as 1 ft smaller when trying to get through or into a space you wouldn't fit in otherwise.",
    "req": [
      "base 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 401,
    "name": "shadow draconic",
    "effect": "Dark: You can cast Weak Curse once per Rest without gaining Soul Strain. You use your Core Skill instead of Soul when casting this spell.",
    "req": [
      "base 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 392,
    "name": "seeker",
    "effect": "Gain Dreams of the Future Trait for free, and at Level 3 gain Past and Future Trait for free.",
    "req": [
      "base 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 7,
    "name": "push",
    "effect": "Roll a Contested Body Check against a target within 1 tile of you. If you succeed then the target is pushed 3 tiles away from you.",
    "req": [
      "base 0"
    ],
    "dice": 2,
    "is_passive": false
  },
  {
    "id": 8,
    "name": "overwatch",
    "effect": "When a target moves into or out of your Weapon range you may spend your Locked Dice to do a Weapon Attack. Reduce your Locked dice value by 2 for this attack.",
    "req": [
      "base 0"
    ],
    "dice": 1,
    "is_passive": false
  },
  {
    "id": 404,
    "name": "nymph born",
    "effect": "Gain Nature Speak Trait for free.",
    "req": [
      "base 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 406,
    "name": "nagalike",
    "effect": "When you grapple a creature within 1 tile of you, you may Bite them (no cost) to give them Poisoned for a number of turns equal to your Level. Additionally, you gain an extra dice when trying to Identify an Illness or Curse.",
    "req": [
      "base 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 5,
    "name": "move",
    "effect": "Spend a dice to move your Speed. Swimming and Climbing use two tiles instead of 1. If you give a 1 you lose 1 Speed for this movement. If you give a 6 you gain 1 Speed for this Movement",
    "req": [
      "base 0"
    ],
    "dice": 1,
    "is_passive": false
  },
  {
    "id": 403,
    "name": "hellborn",
    "effect": "After taking damage from Burn reduce it by 2 instead of 1, and you reduce the time you are Frozen by 1 when you first become Frozen.",
    "req": [
      "base 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 6,
    "name": "grapple",
    "effect": "Roll a Contested Body Check against a target within 1 tile of you. If you succeed then the target is Grappled.",
    "req": [
      "base 0"
    ],
    "dice": 2,
    "is_passive": false
  },
  {
    "id": 400,
    "name": "glowing draconic",
    "effect": "Light: You can cast Fog Light once per Rest without gaining Soul Strain. You use your Core Skill instead of Soul when casting this spell.",
    "req": [
      "base 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 390,
    "name": "generic humanoid",
    "effect": "Pick an extra Skill that doesn't require more than 1 in a base skill (Body, Mind, Soul), you must still meet it's requirement.",
    "req": [
      "base 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 397,
    "name": "frozen draconic",
    "effect": "Ice: You can cast Freezing Wave once per Rest without gaining Soul Strain. You use your Core Skill instead of Soul when casting this spell.",
    "req": [
      "base 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 396,
    "name": "flaming draconic",
    "effect": "Fire: You can cast Fire Breath once per Rest without gaining Soul Strain. You use your Core Skill instead of Soul when casting this spell.",
    "req": [
      "base 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 402,
    "name": "elemental",
    "effect": "Gain the Spell Control Elements.",
    "req": [
      "base 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 398,
    "name": "earthen draconic",
    "effect": "Earth: You can cast Bolder Toss once per Rest without gaining Soul Strain. You use your Core Skill instead of Soul when casting this spell.",
    "req": [
      "base 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 416,
    "name": "dice lock",
    "effect": "When you roll dice you may Lock any one unused dice in the roll. When you do that dice is removed from the dice pool/sum. On later turns you may replace a rolled dice with the dice you locked, 'unlocking' the locked dice. You may only lock 1 dice at a time, if you lock a dice while still having a locked dice replaced the locked dice.",
    "req": [
      "base 0"
    ],
    "dice": 1,
    "is_passive": false
  },
  {
    "id": 407,
    "name": "constructed",
    "effect": "You gain the Creature type; Construct in addition to Humanoid. Gain your Level additional Armor Health.",
    "req": [
      "base 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 394,
    "name": "beastkin",
    "effect": "Increase your Speed by 1.",
    "req": [
      "base 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 393,
    "name": "avian",
    "effect": "You are able to glide 2 tiles for every 1 tile you fall. This effect does not work if your arms are hindered in any way (Being Grappled, caring something, ext.)",
    "req": [
      "base 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 405,
    "name": "aquatic",
    "effect": "You can breath underwater without needing air, and you can swim your Speed.",
    "req": [
      "base 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 53,
    "name": "swimmer",
    "effect": "Can move your Speed through normal liquids without needing to roll 'Acrobatics or Athletics', additionally you no longer suffer a speed penalty for swimming.",
    "req": [
      "body 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 23,
    "name": "strong punches",
    "effect": "When doing an Attack with a Fist Weapon the damage is equal to half your Level (rounded up) plus 1.",
    "req": [
      "body 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 47,
    "name": "pitcher",
    "effect": "Double the Throw Range for all items you Throw. Items that don't have a displayed Throw Range have a Throw Range of 3.",
    "req": [
      "body 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 54,
    "name": "jumper",
    "effect": "When you roll Physical Feats to Jump, add 2 to the distance jumped.",
    "req": [
      "body 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 24,
    "name": "hearty",
    "effect": "Gain additional Max Health equal to your Body.\nAdditionally, when you roll to lift, pull, or push an object, you roll with Advantage.",
    "req": [
      "body 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 25,
    "name": "climber",
    "effect": "Can move your Speed up vertical walls without needing to roll 'Acrobatics or Athletics', additionally you no longer suffer a speed penalty when climbing.",
    "req": [
      "body 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 28,
    "name": "quick runner",
    "effect": "Gain 1 additional Speed. This can be taken multiple times to gain another additional Speed.",
    "req": [
      "body 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 27,
    "name": "obstruct",
    "effect": "Target creatures cannot move through tiles adjacent to you. They may, however, stop within this area (for instance in doing a melee attack).",
    "req": [
      "body 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 26,
    "name": "dual wield",
    "effect": "You can do an attack with a different one handed weapon for half damage (rounded down). This second attack is done with a 7 for the sum. Any weapon that does not say specifically it is two handed is one handed.",
    "req": [
      "body 2"
    ],
    "dice": 1,
    "is_passive": false
  },
  {
    "id": 48,
    "name": "bull rush",
    "effect": "Move up to half your speed in a strait line in any direction, you may move through creatures during this move. Do a Body Contest against any creature within 1 tile during the move. On Success, knock the target back 3 tiles away from your path.",
    "req": [
      "body 2"
    ],
    "dice": 2,
    "is_passive": false
  },
  {
    "id": 51,
    "name": "bloodhound",
    "effect": "Gain 2 extra Speed when moving to a Marked or Bleeding (has Bleed stacks) creature.",
    "req": [
      "body 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 246,
    "name": "barbarian fighting group",
    "effect": "Gain the following traits: Hearty, Dual Wield, and Bull Rush. This trait costs 2 trait points. You may only select this trait at level 1.",
    "req": [
      "body 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 247,
    "name": "athlete group",
    "effect": "You gain the following traits: Climber, Quick Runner, and Pitcher. This trait costs 2 trait points. You can only select this trait at level 1.",
    "req": [
      "body 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 31,
    "name": "tag team",
    "effect": "When you attack a target while another ally is within 1 tile of that target, you may roll an additional dice and pick which rolled dice activates effects.\nAdditionally, if you are standing next to an Ally, both you and the Ally get Advantage on Body checks.",
    "req": [
      "body 3"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 52,
    "name": "bashing strike",
    "effect": "Do a Melee Attack, this attack does no damage instead giving Stun 2. On a Low Roll give the target 1 Stun instead. On a High Roll give the target 3 Stun instead.\nAlternatively, if the target is unaware of you you can do a Body Contest against the target. On success the target is knocked unconscious for 1 minute (6 turns), until another creature spends 2 dice to wake them up, or they take damage.",
    "req": [
      "body 3"
    ],
    "dice": 2,
    "is_passive": false
  },
  {
    "id": 30,
    "name": "defensive duelist",
    "effect": "When you give a Low Roll for a Melee Weapon Attack you gain 1 Stack of Dodge until the end of your next Rest.",
    "req": [
      "body 3",
      "OOC 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 49,
    "name": "cleave",
    "effect": "Do a Melee Weapon Attack against all target's in front of you (Directly in front, to the left, and right of that tile). You can only do this once per turn.",
    "req": [
      "body 3",
      "OOC 0"
    ],
    "dice": 3,
    "is_passive": false
  },
  {
    "id": 454,
    "name": "rip and tear",
    "effect": "The next Melee Attack you do gives the target an additional 2 stacks of Bleed.",
    "req": [
      "body 3",
      "ooc 0"
    ],
    "dice": 1,
    "is_passive": false
  },
  {
    "id": 29,
    "name": "battle ready",
    "effect": "When you do a Melee Weapon Attack dice, if you spend a 1 you may change that dice to a 3. You may do this once per turn.\nAdditionally, when you roll Initiative dice you may roll 3 dice and pick which 2 dice to use.",
    "req": [
      "body 3",
      "ooc 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 33,
    "name": "disarm",
    "effect": "Do a Melee Attack, this attack does no damage. If the target is holding an item they drop the item sending it 3 tiles away. This may or maynot start combat depending on situation.",
    "req": [
      "body 4"
    ],
    "dice": 2,
    "is_passive": false
  },
  {
    "id": 32,
    "name": "critical",
    "effect": "When you give a sum attack of 12 for a Melee Weapon Attack dice, you do double damage for that attack.\nAdditionally, when you give two or more 6's for a roll you may add 3 to that roll without spending another dice.",
    "req": [
      "body 4"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 34,
    "name": "improved auras",
    "effect": "Your Auras have an increased Range of 1 tile.",
    "req": [
      "body 5"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 44,
    "name": "spear master",
    "effect": "When you activate a Spear's Weapon effect the Range is increased by 1 tile.\nAdditionally, when you do a running jump you can do a Pole Vault with your Spear instead giving 4 tiles per activation instead of 2.",
    "req": [
      "body 6"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 36,
    "name": "guarding aura",
    "effect": "You know how many creatures are within your Aura, even if they are Hidden. At the beginning of your turn, for every creature in your Aura you get 1 Armor Health. If you do not have an Aura you get one with the following effect: \nRadiating Aura: Spend a dice to toggle on or off this Aura. You can only have one Aura active at a time. While this Aura is active you emanate a soft glow illuminating everything within 2 tiles of you.",
    "req": [
      "body 6"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 43,
    "name": "dagger master",
    "effect": "When attacking with a Dagger you may only give a 6 instead of 2 dice to do a Weapon Attack.\nAdditionally, when you Scavenge you find 1 extra item each time you succeed.",
    "req": [
      "body 6"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 45,
    "name": "hammer master",
    "effect": "When you activate a Hammer's Weapon effect you can knock the target down instead of knocking them back.",
    "req": [
      "body 6",
      "OOC 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 35,
    "name": "death's reaper",
    "effect": "When you kill a creature with a Melee Attack. Regain one of the dice spent on this attack.",
    "req": [
      "body 6",
      "OOC 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 46,
    "name": "axe master",
    "effect": "When you activate a Axe's Weapon effect you do triple damage to Armor instead of double.",
    "req": [
      "body 6",
      "OOC 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 111,
    "name": "taunt",
    "effect": "Do a Charm contest against a creature you can see. On a success, the creature cannot willingly move away from you and must spend a dice to move closer if possible.",
    "req": [
      "charm 2"
    ],
    "dice": 2,
    "is_passive": false
  },
  {
    "id": 452,
    "name": "quip",
    "effect": "Do a Charm contest against a creature within 6 tiles who can hear you. On a success, reduce the target's next sum (attack, check, or contest) by 4. On a failure, reduce the target's next sum by 2.\nYou can use this a number of times per rest equal to your Charm.",
    "req": [
      "charm 2"
    ],
    "dice": 2,
    "is_passive": false
  },
  {
    "id": 112,
    "name": "jackpot",
    "effect": "When you spend only 6’s on a sum (attack, check, or contest) you may add 3 to the roll.",
    "req": [
      "charm 3"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 113,
    "name": "universal language",
    "effect": "You can attempt to converse with Humanoids, Planar, Monstrosities, or Mythic creatures who cannot understand your spoken language. When you roll to Convince Someone of Something you can target one of these creatures, with a -7 penalty to the sum.",
    "req": [
      "charm 6"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 114,
    "name": "first impression",
    "effect": "When interacting with a creature for the first time, you gain an additional dice to the first Charm roll you make against it.",
    "req": [
      "charm 6"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 130,
    "name": "rocket jump",
    "effect": "You take half damage from explosions you detonate (rounded up). The explosions you create can be used as tools for propelling yourself through the air. Whenever you detonate an explosion within 1 tile of yourself, you can launch yourself in a direction of your choosing up to 4 tiles. If the explosion would give you knockback, such as with the Poprocks Spell, you can replace this distance with the knockback from the explosion.",
    "req": [
      "crafting 3"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 436,
    "name": "remote control",
    "effect": "You can control complex items, traps, and other mechanical things from up to 8 tiles away. You are able to do 'Understand a Contraption' rolls from up to 8 tiles away so long as you can see the contraption. If you have controlled the contraption in the past you may do this roll without seeing it.\nIf you made the contraption, you may do this roll with # (1 dice) rather than ## (2 dice).",
    "req": [
      "crafting 3"
    ],
    "dice": 2,
    "is_passive": false
  },
  {
    "id": 438,
    "name": "clockwork traps",
    "effect": "You can make 3 new traps when you do the action 'Make Trap' using Trapmaker's Tools. These 3 traps cost 10 gold instead of 5 to make. If you do not have Trapmaker's Tools when you take this trait, gain them. These traps may be activated with Remote control using a locked dice on another creatures turn.\n\nCaltrops: A bag of caltrops that when activated spreads thorny metal shards in a 3 tile area (Burst 3). Any creature that moves through an area affected by caltrops take 1 damage per tile moved. Caltrops do not disappear but can be cleaned up over the course of 5 minutes and reused even if triggered.\nNoise Boy: A wooden box containing a small smoke bomb and a dummy. When triggered a puff of smoke reveals the dummy, making all creatures unaware of the trap within 3 tiles of the trap must roll a die. On a 3 or less the must spend their remaining dice to flee. On a 4 or higher they must move closer and attack the dummy. \nLandmine: A thick metal plate that when activated explodes damaging all creatures within 2 tiles (Burst 2), dealing 3 damage.",
    "req": [
      "crafting 4"
    ],
    "dice": 2,
    "is_passive": false
  },
  {
    "id": 131,
    "name": "potent grenades",
    "effect": "Grenades you create or throw have an additional 1 tile effect radius, and do 1 additional damage.",
    "req": [
      "crafting 5"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 185,
    "name": "medicinal cooking",
    "effect": "Meal's you make with the Cooking action heal any creature that eats them. Travel Meals heal 1 health, Cheap Meals heal 2, Decent Meals heal 3, Rich Meals heal 4, Royal Meals heal 5.\nAdditionally, you can make Treats instead of Travel Meals. These Treats heal 3 and remove all stacks of Bleeding when eaten. Treats only last 1 day and become mush after this time.",
    "req": [
      "medicine 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 186,
    "name": "professional cook",
    "effect": "When you make food using the Cooking action you may make 3 more meals than normal. \nAdditionally, you may add 4 to any Cooking roll you do.",
    "req": [
      "medicine 4"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 57,
    "name": "motivate",
    "effect": "You can activate this ability using a die spent from any dice roll, such as a check, contest, or in combat with combat dice. You give the spent dice to another creature within 12 tiles of you. You lose any dice spent this way and do not add it to your sum and can't use it in other actions.\n\nAlternatively, this can be used to give another creature within 12 tiles of you an extra dice on one of their rolls. You may only do this option outside of combat, and once every 5 minutes.",
    "req": [
      "mind 1"
    ],
    "dice": 1,
    "is_passive": false
  },
  {
    "id": 55,
    "name": "mental mage",
    "effect": "If your Max Soul Strain is 0 it becomes 2. Otherwise, increase it by 2.",
    "req": [
      "mind 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 56,
    "name": "mark",
    "effect": "Apply 3 stacks of Marked to a target you can see within Range 6.",
    "req": [
      "mind 1"
    ],
    "dice": 1,
    "is_passive": false
  },
  {
    "id": 71,
    "name": "think ahead",
    "effect": "Split a dice. Cannot split a 1.",
    "req": [
      "mind 2"
    ],
    "dice": 1,
    "is_passive": false
  },
  {
    "id": 248,
    "name": "tactician group",
    "effect": "You gain the following traits: Think Ahead, Command, and Motivate. This trait costs 2 trait points. You can only select this trait at level 1.",
    "req": [
      "mind 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 58,
    "name": "crippling shot",
    "effect": "Do a Ranged Weapon attack, this attack reduces the target's Speed by 2, to a maximum of 4 reduced from this trait, until the begining of your next turn.\nAlternatively, throw a Bola that trips and sets the Speed of the target to 0. Until the end of the target's next turn.",
    "req": [
      "mind 2"
    ],
    "dice": 3,
    "is_passive": false
  },
  {
    "id": 59,
    "name": "marking shot",
    "effect": "Do a Ranged Weapon Attack, it gives them 2 stacks of Marked. If you activated your weapons effect give them another stack of Marked. This cannot be used more than once in a turn.",
    "req": [
      "mind 2",
      "OOC 0"
    ],
    "dice": 3,
    "is_passive": false
  },
  {
    "id": 60,
    "name": "weak spot",
    "effect": "When a Creature attacks a Target you Marked they may add 1 to the attack sum. They may only do this once per turn.\nAdditionally, when a creature you can see fails a roll, the next time you make a check, contest, or attack against them you may add 3 to the sum.",
    "req": [
      "mind 2",
      "ooc 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 73,
    "name": "command",
    "effect": "Give a creature within 6 tiles of you the 2 dice used on this action. They may then use these 2 dice to do any action on their character sheet during your turn. You cannot use this ability more than once per turn.",
    "req": [
      "mind 2",
      "ooc 0"
    ],
    "dice": 2,
    "is_passive": false
  },
  {
    "id": 62,
    "name": "train of thought",
    "effect": "If you don't have a locked die at the end of your turn lock a 3. This effect can go off once every minute (6 Turns).",
    "req": [
      "mind 3"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 63,
    "name": "marked as lost and found",
    "effect": "When Searching for a Hidden target, if you find something you can apply 2 Stacks of Marked without spending another dice.\nAdditionally, you get Advantage when you search for a target that you are familiar with. (Creatures you just met do not count)",
    "req": [
      "mind 3"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 61,
    "name": "forethought",
    "effect": "When you do a Weapon Attack, you may add an additional dice to activate weapon effects.\nIf you replace a dice with your Locked dice you may add half of the replaced dice's value (rounded down) to the locked dice value. This effect does not happen if the Locked dice value is 6.",
    "req": [
      "mind 3"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 65,
    "name": "size up",
    "effect": "Target a creature you can see. You determine which of the target's Primary Skills (Body | Mind | Soul) are highest and lowest. You do not know the values of these Skills.",
    "req": [
      "mind 4"
    ],
    "dice": 3,
    "is_passive": false
  },
  {
    "id": 64,
    "name": "recalculate",
    "effect": "You may flip this dice to show its opposite face. (1⇔6, 2⇔5, 3⇔4) You can only do this once per turn, and a number of times equal to your COMBAT DICE per Rest.",
    "req": [
      "mind 4"
    ],
    "dice": 1,
    "is_passive": false
  },
  {
    "id": 72,
    "name": "enhanced motivate",
    "effect": "When you use Motivate, increase the dice’s value by 1. This effect doesn’t apply if the dice is already 6.",
    "req": [
      "mind 4"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 66,
    "name": "change of thinking",
    "effect": "Set a dice to 4. You can do this a number of times equal to your COMBAT DICE per Rest.",
    "req": [
      "mind 4"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 68,
    "name": "longer marks",
    "effect": "When you Mark a creature, increase its marked stacks by 3.",
    "req": [
      "mind 5"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 67,
    "name": "duplicity",
    "effect": "When you roll multiple dice for a Weapon attack, you may use all of the dice to activate an effect rather than just 1.",
    "req": [
      "mind 5"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 69,
    "name": "outsmart",
    "effect": "When a creature that you can see rolls you may replace one of the dice rolled with your Locked dice.",
    "req": [
      "mind 6"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 70,
    "name": "illusion of choice",
    "effect": "Set a dice to any value you want. You can only do this once per turn, and a number of times equal to your COMBAT DICE per Rest.",
    "req": [
      "mind 6"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 20,
    "name": "undead (6,4)",
    "effect": "The creature is Undead. When this creature hits 0 or less health they roll deaths door rolls.",
    "req": [
      "monster 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 12,
    "name": "strong body",
    "effect": "When you roll Physical Feats for Lifting or Pulling multiply each roll by 3 times.",
    "req": [
      "monster 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 19,
    "name": "spirit",
    "effect": "Become Incorporeal until the start of your next turn.",
    "req": [
      "monster 0"
    ],
    "dice": 2,
    "is_passive": false
  },
  {
    "id": 419,
    "name": "spell battery",
    "effect": "When you are affected by a spell, you may learn the spell. On later turns you may cast that spell even if you normally don't know the spell. Another creature may spend 5 minutes teaching you a spell without gaining soul strain to cast it on you.\nYou may have 3 spells learned this way at a time. Learned spells are known until the end of your next Rest.",
    "req": [
      "monster 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 423,
    "name": "shadow skip",
    "effect": "While within a shadow that mostly covers you, you may gain 1 Soul Strain then teleport to another patch of shadow that would mostly cover you within 12 tiles of you that you can see.",
    "req": [
      "monster 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 15,
    "name": "movement choice 1",
    "effect": "Gain Climber and Swimmer, Flight, or Increase your Speed by 2.",
    "req": [
      "monster 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 13,
    "name": "mount",
    "effect": "When someone rolls to Handle a Beast on you they do so with an extra dice.\nAdditionally, you can carry another creature without needing to do a Physical Feats roll.",
    "req": [
      "monster 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 250,
    "name": "mimicry",
    "effect": "You may cast Prop without gaining Soul Strain",
    "req": [
      "monster 0"
    ],
    "dice": 1,
    "is_passive": false
  },
  {
    "id": 420,
    "name": "mechanical hunger",
    "effect": "Can consume inorganic material instead of normal foods for sustenance, and can use consumed materials to craft as if they had ‘Tinkers Tools’ or ‘Smiting Tools’.\n",
    "req": [
      "monster 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 421,
    "name": "keen tracker",
    "effect": "Gain an additional dice when rolling for 'Tracking a Creature'. You may use sight, smell, or sound to make this roll. When the creature you are tracking is found (you see the creature), give them Marked for 1 minute (6 stacks of Marked).",
    "req": [
      "monster 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 22,
    "name": "hover",
    "effect": "Floats up to 1 tile over the ground (isn't affected by ground based effects).",
    "req": [
      "monster 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 14,
    "name": "hidyhole",
    "effect": "Cast Pocket Dimension on yourself without needing a container. You cannot take items with you when you enter or leave. You are unconscious while inside and do not need to eat, sleep, or breathe until you leave the Hidyhole.",
    "req": [
      "monster 0"
    ],
    "dice": 1,
    "is_passive": false
  },
  {
    "id": 251,
    "name": "hatch",
    "effect": "Reduce your Nature by 1. At Nature 0 Hatch into a baby.",
    "req": [
      "monster 0"
    ],
    "dice": 3,
    "is_passive": false
  },
  {
    "id": 18,
    "name": "forced soul",
    "effect": "Get 2 Soul Strain, do not get any spells",
    "req": [
      "monster 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 10,
    "name": "flight",
    "effect": "You have permanent Flight.",
    "req": [
      "monster 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 21,
    "name": "equipable",
    "effect": "Can use Items that it meets the requirements for.",
    "req": [
      "monster 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 17,
    "name": "deathless",
    "effect": "Can be revived with a Crafting score of 20 or higher (sum).",
    "req": [
      "monster 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 249,
    "name": "consume",
    "effect": "When you damage a target with a Melee Attack and it would put that creature to your level or less Health they are eaten and become Grappled. Every turn while grappled this way they gain 3 Burn Stacks.",
    "req": [
      "monster 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 16,
    "name": "construct",
    "effect": "Does not require food, water, or air to function.",
    "req": [
      "monster 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 11,
    "name": "aquatic life",
    "effect": "You can only breathe in water.",
    "req": [
      "monster 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 149,
    "name": "knowledge of the forest",
    "effect": "You can use Nature when rolling to Remember information about: your approximate location, local flora, fauna, or aproximate time of day (even underground).\nAdditionally, when you Scroundge in area you are familiar with, you gain 1 extra item for every success.",
    "req": [
      "nature 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 151,
    "name": "scrounger",
    "effect": "Replace your Scrounge with the following:\n5+ Find 1 raw item (such as wood, herbs, or metal scraps), Travel Meal, or a clean water source.   \n7+ Find 1 small or tiny non-magical item, Cheap Meal, or a unique plant or animal from the local environment.\n14+ you may heal yourself or another creature 3 Health with local medicines. \nThese can be done multiple times in a roll.",
    "req": [
      "nature 2"
    ],
    "dice": 3,
    "is_passive": false
  },
  {
    "id": 150,
    "name": "natures friend",
    "effect": "You gain Advantage when rolling to Handle a Beast or Track a Creature.\nAdditionally, when you first tame a Beast you can control the Beast as if it was a Personal Minion.",
    "req": [
      "nature 2"
    ],
    "dice": 2,
    "is_passive": false
  },
  {
    "id": 152,
    "name": "improved traps",
    "effect": "Make one of 3 traps listed below. Each trap costs 5 gold to craft, and covers 1 tile or item. Some traps can be reclaimed if unused. Creatures roll a Nature contest to detect the trap.\nPitfall: A 5 tile deep hole covered in camouflage that breaks when stepped on. The edge is covered in a slick surface which prevents climbing up it. (Not reclaimable)\nPoison: A gas canister that when triggered unleashes poisonous gas. The gas explodes in Burst 3 lingering for 1 minute or until a strong wind blows it away. Any creature inside the gas becomes Blind, and at the start of the creatures turn, they take 1 damage if they are in the gas.\nGoo: An orb of strange goo that bursts on touch. The goo explodes in Burst 3, giving all target's in this area Burn 3 and destroying 3 Armor while this Burn affects them.",
    "req": [
      "nature 4"
    ],
    "dice": 2,
    "is_passive": false
  },
  {
    "id": 153,
    "name": "heightened scenses",
    "effect": "You can see in poorly light areas as if they were illuminated. \nAdditionally, you get Advantage when doing Perception rolls.",
    "req": [
      "nature 4"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 154,
    "name": "one with nature",
    "effect": "You do not get attacked by creatures with the Beasts type unless you attack them. \nAdditionally, you get an extra 2 dice when interacting with creatures with the Beasts type.",
    "req": [
      "nature 6"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 74,
    "name": "yoyo",
    "effect": "Move your Speed. At the end of the turn teleport back to where you started the turn.",
    "req": [
      "soul 1"
    ],
    "dice": 1,
    "is_passive": false
  },
  {
    "id": 75,
    "name": "telepathy",
    "effect": "Bind your mind to a willing creature's mind. You can use your action on later turns to see/hear through their senses or send/receive simple messages. You can only be bound to one creature at a time.",
    "req": [
      "soul 1"
    ],
    "dice": 1,
    "is_passive": false
  },
  {
    "id": 408,
    "name": "soul bound item",
    "effect": "You bind an object or weapon to your very soul. The object gains Returning and allowing you to return it to your hand with 1 dice. If it is a Weapon you may equip it with this dice.",
    "req": [
      "soul 1"
    ],
    "dice": 1,
    "is_passive": false
  },
  {
    "id": 88,
    "name": "dreams of the future",
    "effect": "At the end of a Rest roll a number of dice equal to your Level and Lock one of them.",
    "req": [
      "soul 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 76,
    "name": "create familiar",
    "effect": "At the end of a Rest you can create a Familiar (See Creatures). You may pick its type (Animal, Construct, Monstrosity, Planar, or Undead) and appearance each time it is created. The familiar goes immediately after your turn in combat, however it may only ever roll 3 dice regardless of level. If you die the familiar also dies.",
    "req": [
      "soul 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 78,
    "name": "meditate",
    "effect": "Grants the Action Meditate which uses Soul:\n5+ Spend 1 Hour to remove 1 Soul Strain  \n7+ Spend 1 Hour to remove 3 Soul Strain\n21+ Spend 1 Hour to remove Half your Soul Strain (rounded down)\nThese can be done multiple times in a roll without increasing the time spent Meditating.",
    "req": [
      "soul 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 77,
    "name": "illusionary mage",
    "effect": "When you cast an Illusion spell you can create it with both sound and visuals.",
    "req": [
      "soul 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 80,
    "name": "focused",
    "effect": "You do not lose Focus from taking damage.",
    "req": [
      "soul 3"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 81,
    "name": "familial flock",
    "effect": "You create up to 2 Familiars at the end of a Rest. At level 5 it becomes 3 familiars and at level 8 it becomes 4. \n\nWhen the familiars do their turn in combat you lump all of them into 1 group rather than individually. Combine all of their health together into one pool. All familiars use the same 3 dice rolled, acting as if they rolled those dice (though they may do different things with said dice). If the group was to take enough damage for one to die, unless it was targeted specifically, roll a dice to decide which dies.",
    "req": [
      "soul 3"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 79,
    "name": "conjure shield",
    "effect": "Gain 1 Soul Strain and spend your Locked dice to activate. Create a spectral flat shield shape between you and whatever is attacking you. This shield has 6 health. The damage first goes to the shield then to you. The shield cannot block Area damage and goes away at the end of your next turn.",
    "req": [
      "soul 3"
    ],
    "dice": 1,
    "is_passive": false
  },
  {
    "id": 82,
    "name": "soul ward",
    "effect": "When you take damage you can gain Ward 1, and gain 2 Soul Strain, then take the damage. This effect cannot happen if you are at max Ward.",
    "req": [
      "soul 4"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 85,
    "name": "summoners command",
    "effect": "At the start of your turn you may have all of your personal minions (constructs, undead, familiars, summons etc) move without you spending a dice.",
    "req": [
      "soul 5"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 84,
    "name": "mirror match",
    "effect": "Gain 3 Soul Strain to target all creatures within 3 tiles of you, excluding yourself. These creatures make a Soul roll against the 3 dice given. You make an Illusionary clone of that creature. On fail the clone has 2 Ward, on success it has 1. Any action that would effect a creature other than itself will get sucked into the clone. \nAdditionally, if the creature tries to move past the clone it must win a Soul contest against you. The clone has 1 health and is magical in nature.",
    "req": [
      "soul 5"
    ],
    "dice": 3,
    "is_passive": false
  },
  {
    "id": 86,
    "name": "soul shielded",
    "effect": "You can have a maximum of 5 Ward instead of 3 and gain an additional Ward on Rest.\nAdditionally, While you have Ward you cannot become dirty or wet by unwelcomed sources.",
    "req": [
      "soul 6"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 87,
    "name": "acceleration",
    "effect": "Gain Speed equal to half your current Soul Strain (rounded down). This effect goes away at the end of your turn.",
    "req": [
      "soul 6"
    ],
    "dice": 1,
    "is_passive": false
  },
  {
    "id": 215,
    "name": "thieves abound",
    "effect": "You know how to talk in special code known only to those who slink in the shadows. When talking to another creature that knows this code you may use Thieving instead of Charm to Convince Someone of Something.",
    "req": [
      "thieving 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 214,
    "name": "skeleton key",
    "effect": "You can Lockpick without needing tools (see Thieves Tools under Items). \nAdditionally, you get Advantage when you Lockpick with Thieves Tools.",
    "req": [
      "thieving 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 217,
    "name": "sneak thief",
    "effect": "Reduce the number of tiles you will be detected by by 1, to a minimum of 1. (This effect happens when someone searches.)",
    "req": [
      "thieving 3"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 216,
    "name": "backstab",
    "effect": "The next Melee Attack you do gains Armor Penetration if it does not already have it. If you attack while hidden or from the target's backside do an additional damage.",
    "req": [
      "thieving 3",
      "ooc 0"
    ],
    "dice": 1,
    "is_passive": false
  },
  {
    "id": 218,
    "name": "eyes of riches",
    "effect": "You can see in poorly light areas as if they were illuminated. You can tell the rough value of items with a glance, you can't tell if an item is fake with this trait.",
    "req": [
      "thieving 4"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 93,
    "name": "combative running",
    "effect": "You have figured out how to improve the flow of runic magic through your tools. Weapons you wield and armor you wear can have an additional rune inserted into it. \nAdditionally, at the end of a Rest craft a Lesser Rune. This rune must be put in your weapon or armor and will be replaced if you make another.",
    "req": [
      "arcana 2",
      "body 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 94,
    "name": "arcane armory",
    "effect": "You can cast pocket dimension on items you have applied runes to. When you cast pocket dimension in this way you target only the runed item, \nAdditionally you can equip or unequip armor or weapons this way.",
    "req": [
      "arcana 2",
      "body 1"
    ],
    "dice": 1,
    "is_passive": false
  },
  {
    "id": 98,
    "name": "discover rune of poison",
    "effect": "You have learned how to create a Unique Rune of Poison. At the end of a rest, you can create 1 Rune of Poison and apply it to any item. Only 1 instance of this rune can exist at any time and attempting to create a second will destroy the first.\nRune of Poison: This Rune has effects based what it is applied to.\nWeapon: On hit give the target Poisoned until the begining of your next turn. If the weapon already applies this effect increase its duration by 1 turn.\nArmor: You cannot become Poisoned, and heal 1 when you would be poisoned.\nItem: Once per day you may make a poison with a crafting value of 2 or less without needing to roll. This effect resets at Dawn.",
    "req": [
      "arcana 2",
      "mind 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 99,
    "name": "complex brews",
    "effect": "You can brew a potion with 2 effects.",
    "req": [
      "arcana 2",
      "mind 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 427,
    "name": "spell slinging familiar bonus",
    "effect": "Your Familiar gains the 'Spell Battery' trait.\n\nSpell Battery - When you are affected by a spell, you may learn the spell. On later turns you may cast that spell even if you normally don't know the spell. Another creature may spend 5 minutes teaching you a spell without gaining soul strain to cast it on you.\nYou may have 3 spells learned this way at a time. Learned spells are known until the end of your next Rest.",
    "req": [
      "arcana 2",
      "soul 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 105,
    "name": "scroll crafting",
    "effect": "At the end of a Rest you can create a magical Scroll. This scroll can contain any Spell you know when crafting, and can be used by anyone. The person using the scroll can cast the spell on the scroll for half its Soul Strain cost if they know the spell or at full cost if they don't. You can only have 1 scroll written with this trait at a time, if another one is written the first one loses its power.",
    "req": [
      "arcana 2",
      "soul 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 95,
    "name": "blade wave",
    "effect": "You can channel Arcane energy into a Melee Weapon Attack and expel it to attack at range. You can make a Melee Weapon Attack with an additional 4 Range. This attack does half damage (rounded down), and does not activate the weapons effect. On a Low Roll you reduce this damage by 1. On a High Roll you may activate the Weapons effect.\nAdditionally, once per day you may surge this energy. Each creature in a 6 tile line in front of you takes your Weapon's full damage. This attack does not activate the weapons effect. On a Low Roll you reduce this damage by 1. On a High Roll you may activate the Weapons effect.",
    "req": [
      "arcana 3",
      "body 2"
    ],
    "dice": 2,
    "is_passive": false
  },
  {
    "id": 101,
    "name": "skin absorbing",
    "effect": "You can throw potions and poisons to appy their effect. Potions and poisons thrown this way have their effect time reduced by 30 seconds (5 turns) to a minimum of 6 seconds (1 turn). (Items without a throw range have a default throw range of 3.)",
    "req": [
      "arcana 3",
      "mind 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 100,
    "name": "poisoned strikes",
    "effect": "When you hit an attack with a weapon that has no poison (or similar effect) on it you may give the target a stack of Poisoned until the start of your next turn.\nAdditionally, when you apply a potion or Poison effect to an item, it gets twice the number of uses before the potion or Poison runs out.",
    "req": [
      "arcana 3",
      "mind 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 107,
    "name": "spell manipulator",
    "effect": "Gain 1 Soul Strain then pick on of the following:  \nSoul Slinger: The next spell you cast this turn has an extra 4 Range. \nMaintain Spell Form: The next spell you cast this turn has its duration is increased by an extra 2 turns. \nIntensify Spell: The next spell you cast this turn does 1 extra damage.",
    "req": [
      "arcana 3",
      "soul 2"
    ],
    "dice": 1,
    "is_passive": false
  },
  {
    "id": 106,
    "name": "shaped explosions",
    "effect": "Cast an area of effect spell, with a sum reduction of 4. When you do, you can choose up to 3 creatures within the area. Those creatures succeed on the save without needing to roll.",
    "req": [
      "arcana 3",
      "soul 2"
    ],
    "dice": 4,
    "is_passive": false
  },
  {
    "id": 102,
    "name": "potent alchemy",
    "effect": "Potions and poisons you brew last 30 seconds (5 turns) longer, or have 2 more charges when applied to an item. (This is taken into effect after all other bonus effects.)",
    "req": [
      "arcana 4",
      "mind 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 108,
    "name": "spell book crafting",
    "effect": "At the end of a Rest you can create a magical Spell Book. This book can contain up to 3 Spells you know when crafting, and can be used by anyone. The person using the book can cast any spell in the book without gaining Soul Strain. Once a Spell is cast from the book that spell is then magically removed from the book. \nAlternatively you can remove a Spell page from the book turning it into a Spell Scroll which burns away at Dawn. You can only have 1 book written with this trait at a time, if another one is written the first one loses its power.",
    "req": [
      "arcana 4",
      "soul 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 428,
    "name": "soulbound familiar bonus",
    "effect": "Your Familiar gains the spell 'Swapper' with a Soul Strain cost of 1, however it only can target the Owner. The Owner can cast spells through the familiar as if they where the familiar. Spells cast this way target the familiar not the Owner. (Soul Skip teleports the familiar not the Owner)",
    "req": [
      "arcana 4",
      "soul 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 109,
    "name": "discover rune of gravity",
    "effect": "You have learned how to create a Unique Rune of Gravity. At the end of a rest, you can create 1 Rune of Gravity and apply it to any item. Only 1 instance of this rune can exist at any time and attempting to create a second will destroy the first.\nRune of Gravity: the wielder of the item this rune is applied to can activate it as a # (one dice) action. When you activate it you choose which effect takes place. This effect can be turned off for an additional # (one dice) action.\n1. Your Gravity is inverted, making it so you will fall upwards. You can take fall damage from this and can leave the atmosphere with this rune.\n2. Your Gravity is increased, making you immune to displacements, decreasing your speed by 2\n3. Your Gravity is decreased, effects of displacements are doubled and when you do a Physical Feats roll for jumping your jump height is increased by 1.\nThese effects can be activated a number of times equal to your Arcana, resetting at dawn.",
    "req": [
      "arcana 4",
      "soul 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 96,
    "name": "discover rune of absorption",
    "effect": "You have learned how to create a Unique Rune of Absorption. At the end of a rest, you can create 1 Rune of Absorption and apply it to any item. Only 1 instance of this rune can exist at any time and attempting to create a second will destroy the first.\nRune of Absorption: Once a day, you may cast the spell Counterspell without gaining soul strain. If a spell is successfully countered then this Rune has additional effects based what it is applied to.\nWeapon: If a spell is successfully countered the weapon glows with energy reminiscent of the spell countered and your next Weapon Attack has a -2 to the High Roll threshhold and the attack does 2 additional damage.\nArmor: If a spell is successfully countered the armor glows with energy reminiscent of the spell countered and you gain armor equivalent to double the countered spell's Soul Strain with a minimum of 2.\nItem: You counterspell with a value of 6 regardless of what value the locked die spent is.",
    "req": [
      "arcana 5",
      "body 3"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 110,
    "name": "reactive explosions",
    "effect": "When you do an area of effect spell, you can set one of the required dice to 5 (You still spend 3 dice, you just change the value of one dice).",
    "req": [
      "arcana 5",
      "soul 3"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 97,
    "name": "runic augmentation",
    "effect": "You are able to cast Flesh Shaper on yourself at will. However, the effects are Permanent instead of temporary.",
    "req": [
      "arcana 6",
      "body 4"
    ],
    "dice": 1,
    "is_passive": false
  },
  {
    "id": 104,
    "name": "potions of power",
    "effect": "You can brew potions that when ingested allow the drinker to cast a spell with a Soul Strain cost of 2 or less, once. This spell is chosen appon making the Potion, and goes away at the end of a Rest.",
    "req": [
      "arcana 6",
      "body 4"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 103,
    "name": "double dosing",
    "effect": "Potions and poisons you brew can be used twice before it is consumed.",
    "req": [
      "arcana 6",
      "body 4"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 450,
    "name": "rune gate",
    "effect": "Spend 5 minutes drawing, or 1 day carving, a set of runes onto a flat surface. At a later time or when written you can create a gate to another Rune Gate. The gate lasts for 1 minute after which it closes. \nIf the runes were drawn they burn away leaving an illegible scorch mark after the gate closes. If the runes were carved they stay on the surface. If there is more than one other Rune gate with the same rune code the gate opens to one of them randomly.",
    "req": [
      "arcana 6",
      "soul 5"
    ],
    "dice": 3,
    "is_passive": false
  },
  {
    "id": 37,
    "name": "defender",
    "effect": "When you use Overwatch and you hit a creature. That creature’s Speed is set to 0 and gets Webbed this turn.\nAdditionally, you know if a creatures intentions are hostile without needing to do a Discern Others Intentions roll.",
    "req": [
      "body 3",
      "mind 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 38,
    "name": "fortify",
    "effect": "Gain an amount of Armor Health equal to your Level. You cannot do this action more than 3 times per Rest.",
    "req": [
      "body 3",
      "mind 2",
      "OOC 0"
    ],
    "dice": 2,
    "is_passive": false
  },
  {
    "id": 40,
    "name": "paladin aura",
    "effect": "While you have your Aura up, you treat the area your Aura covers as your attack range for attacks made through Overwatch. If you do not have an Aura you get one with the following effect: Spend a dice to toggle on or off this Aura you can only have one Aura active at a time. While this Aura is Active a soft glow appears within 2 tiles of you.\nAdditionally, when you hit an overwatch attack the effects of your aura are applied immediately.",
    "req": [
      "body 3",
      "soul 2"
    ],
    "dice": 1,
    "is_passive": false
  },
  {
    "id": 41,
    "name": "blessed/cursed caster",
    "effect": "You have been gifted with power. You can cast Bless or Weak Curse once per Rest without gaining Soul Strain. \nAdditionally, all spells you cast do an extra 1 damage to Undead.",
    "req": [
      "body 3",
      "soul 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 42,
    "name": "protected",
    "effect": "When you are put on Death’s Door, gain 2 stacks of Ward.",
    "req": [
      "body 3",
      "soul 2",
      "OOC 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 39,
    "name": "combo finisher",
    "effect": "If you hit the same creature twice this turn you can do another Weapon Attack without spending more dice, this roll is always a 6. You cannot use this feature more than once per turn.",
    "req": [
      "body 5",
      "mind 3",
      "OOC 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 115,
    "name": "dance performer",
    "effect": "When you do the Action 'Performance' you may Dance. This action can be used with Charm or Body. You may Focus on dancing while in combat to continue dancing, roll at the beginning of your turn to determine the current turns outcome. While dancing you get the following bonus based on the roll:\nFailure: Loose your footing and stop dancing.\nSuccess: Gain 1 Dodge when you are hit with an attack, this takes place before damage is dealt.\nGreat Success: Gain 1 Speed for the turn and gain 1 Dodge when you are hit with an attack, this takes place before damage is dealt.\nPerfected Success: Gain 2 Speed for the turn and gain 2 Dodge when you are hit with an attack, this takes place before damage is dealt.",
    "req": [
      "charm 1",
      "body 1"
    ],
    "dice": 2,
    "is_passive": false
  },
  {
    "id": 125,
    "name": "vocal mimicry",
    "effect": "When you cast an Illusion spell with sound you can roll Charm to try to mimic someone's voice. You do not need to roll Charm to mimic your own voice.",
    "req": [
      "charm 1",
      "soul 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 124,
    "name": "ventriloquism",
    "effect": "Do a contested Soul roll against a creature within range 6. On success you make the target recites a sentence as well as it can and in the same tone.\nThey believe the sentence was their own and have no memory of the magic. On failure they someone tried to cast magic on them but not what it was or who cast it.",
    "req": [
      "charm 1",
      "soul 1"
    ],
    "dice": 2,
    "is_passive": false
  },
  {
    "id": 126,
    "name": "change face",
    "effect": "You can magically change your appearance to look like another. This illusion covers your entire body letting you change clothes, race, sex, and general appearance.\nIt is, however, still an illusion and touching it reveals the illusion. A creature can make a Core Roll against you to discern if it is an illusion.\nIf a creature discovers this illusion then they are able to see through it regardless of what you look like.",
    "req": [
      "charm 1",
      "soul 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 116,
    "name": "rain dance",
    "effect": "When you do a 'Performance: Dance' roll, you may cast one non-damaging water spell without gaining Soul Strain. When you do increase the DL of the roll based on the Soul Strain Cost of the spell you want to cast.",
    "req": [
      "charm 2",
      "body 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 451,
    "name": "good advice",
    "effect": "When a creature does a roll you may give them your locked dice as a bonus dice so long as they can see or hear you.",
    "req": [
      "charm 2",
      "mind 1"
    ],
    "dice": 1,
    "is_passive": false
  },
  {
    "id": 121,
    "name": "act like you belong",
    "effect": "When making a check to make pass as a member of a group or to blend in with a group of people, you may roll Charm instead of Thievery.",
    "req": [
      "charm 2",
      "mind 1",
      "OOC 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 128,
    "name": "rendition",
    "effect": "Using Artist's tools or a spellcasting focus, you can cast the Minor Illusion spell. When cast in this way, the illusions created can by physically interacted with.\nThey are unarmored and have 1 hit point. \nAdditionally, if the spell is focused on for its duration, the object does not disappear when the spell ends.",
    "req": [
      "charm 2",
      "soul 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 426,
    "name": "playing familiar bonus",
    "effect": "Your Familiar gains ‘Taunt’ trait, ‘Mimicry’ trait, and gains the Monstrosity type if they don't already have it.\n\nTaunt - ## - Make a Contested Charm roll against a creature you can see. On success the creature cannot willingly move away from you and must spend a dice to move closer if possible.\n\nMimicry - # - You may cast the spell 'Prop' without gaining Soul Strain.",
    "req": [
      "charm 2",
      "soul 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 127,
    "name": "intrusive soul",
    "effect": "You can cast Intrusive Thoughts without gaining Soul Strain. \nAdditionally you can use Charm instead of Soul when using the save.",
    "req": [
      "charm 2",
      "soul 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 117,
    "name": "sword dance",
    "effect": "When you do a Performance: Dance, you may do attacks while performing, gaining 1 extra damage if you would attract most people, 2 extra damage for nobility, and 3 extra damage for royalty. This effect lasts while you are dancing. If you gain stacks of Stun or lose Health you stop Dancing. (Armor Health is not health).",
    "req": [
      "charm 3",
      "body 2",
      "broken 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 122,
    "name": "expose",
    "effect": "Do a Charm contest against a creature you can see within 6 tiles of you. On a success, give the creature 2 stacks of Stun every turn for 30 seconds (3 turns). On a failure, they are immune to this feature for 1 minute.\nAdditionally, When you succeed on a Discern others Intentions roll and determine that a character is not telling the truth (roll at least a 9+) that character has disadvantage on checks for a minute.",
    "req": [
      "charm 3",
      "mind 2"
    ],
    "dice": 2,
    "is_passive": false
  },
  {
    "id": 118,
    "name": "shock and awe",
    "effect": "Do a Charm contest against a creature you can see. On Success, the creature gains 3 stacks of Stun.\nAdditionally, when you are Performing you may roll Charm to redo the Performance, taking the effects of the higher roll.",
    "req": [
      "charm 4",
      "body 2"
    ],
    "dice": 2,
    "is_passive": false
  },
  {
    "id": 119,
    "name": "fancy feet",
    "effect": "When you do a Performance: Dance, when you take damage from a Ranged Attack, you can spend your locked dice to half this damage (rounded up).\nAdditionally, you can ____",
    "req": [
      "charm 4",
      "body 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 453,
    "name": "good cop bad cop",
    "effect": "Good Cop: When you succeed on a Charm roll to Convince, the target's damage against you is decreased by 1 and you get +4 when rolling harm to Convince them. Attempting a Charm roll to Intimidate ends this effect.\nBad Cop: When you succeed on a Charm roll to Intimidate, your damage against the target is increased by 1 and you get +4 bonus to Charm rolls to Discern Intent. Attempting a Charm roll to Convince ends this effect.\nThe effect ends after 10 minutes of non-use.",
    "req": [
      "charm 4",
      "mind 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 123,
    "name": "clueless",
    "effect": "When a creature makes a Charm check to Discern your Intentions reduce their sum by 4.",
    "req": [
      "charm 4",
      "mind 2",
      "OOC 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 129,
    "name": "who are you",
    "effect": "Do a contested Soul roll against a creature within Range 6. On success, you make the creature forget all knowledge associated to your identity. Actions you undertook are still remembered by the creature but you all memories of you are replaced with that creatures idea of what the perpetrator might look like. Creatures that know you well will remember you and know who you are, but will have no memory of what actions you took. They will make up a reason for the memory loss and have no memory of the magic. On failure they know someone tried to cast magic on them but not what it was or who cast it.",
    "req": [
      "charm 4",
      "soul 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 120,
    "name": "the show must go on",
    "effect": "When you fail a Death's Door roll, you can instead turn it into a success. You can do this once per Rest.\nAdditionally, when you are Performing you cannot gain stacks of Stun or be interrupted by Charm Rolls.",
    "req": [
      "charm 6",
      "body 4"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 133,
    "name": "tunneler",
    "effect": "Grants the Action Tunneler which can be used with Body or Crafting:\n7+ Remove 1 tile cubed worth of soft material such as dirt or lose stones.\n11+ Remove 1 tile cubed worth of dense material such as constructed stone or thick wood.\n14+ Remove 1 tile cubed worth of reinforced material such as metal walls or solid stone.\nYou can do an of the above as many times as you can when you roll.",
    "req": [
      "crafting 2",
      "body 1"
    ],
    "dice": 2,
    "is_passive": false
  },
  {
    "id": 132,
    "name": "apprentice smith",
    "effect": "At the end of a Rest you can modify a Weapon or Armor to remove or add one of the following effects: \nGlow: Give the item the spell Glow. Glow can be cast by the user. (Weapons with this tag can be used to cast spells)\nLight Weight: Give armors +1 Speed. Give weapons -1 to the High Roll threshold.\n---\nAn item can only have one of the changes applied to it. Applying an additional change to an item replaces the first change.",
    "req": [
      "crafting 2",
      "body 1",
      "OOC 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 137,
    "name": "turreted weapon",
    "effect": "Spend 2 dice to turn one of your weapons into a semi automated Turret. If the Turret is destroyed the weapon drops and is broken. The weapon can be picked up by you and returns to being a normal weapon.\nYou can control up to your level of personal minions with your dice, but they must all be given the same Command. When you spend a dice to move you may also have the turrets move as well.",
    "req": [
      "crafting 2",
      "mind 1",
      "OOC 0"
    ],
    "dice": 2,
    "is_passive": false
  },
  {
    "id": 142,
    "name": "spectral grenade",
    "effect": "Gain 1 Soul Strain. Create a Spectral Grenade (it counts as a grenade for the purposes of other traits) within the palm of your hand. The grenade has a throw range of 6 and lasts 1 minute or until thrown (throwing is ##). The grenade detonates with Burst 1. All target's within this area take 1 damage.",
    "req": [
      "crafting 2",
      "soul 1"
    ],
    "dice": 1,
    "is_passive": false
  },
  {
    "id": 143,
    "name": "simple magical craftsman",
    "effect": "You can craft Lesser Magic items, excluding potions.",
    "req": [
      "crafting 2",
      "soul 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 429,
    "name": "golem familiar bonus",
    "effect": "Your Familiar gains ‘Soul Weapon’ weapon, ‘Mechanical Hunger’ trait, and gains the Construct type if they don't already have it.\n\nSoul Weapon - ## - Do 1 damage in Range 6, increases its damage by 1 every 2 levels you have. On a 9 or Higher: Knockback the Target 2 tiles away from you.\n\nMechanical Hunger - Can consume inorganic material instead of normal foods for sustenance, and can use consumed materials to craft as if they had ‘Tinkers Tools’ or ‘Smiting Tools’.",
    "req": [
      "crafting 2",
      "soul 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 135,
    "name": "weapon smithing master",
    "effect": "At the end of a Rest you can create an enhanced weapon, does 1 additional damage, reduces the Low Roll Threshold by 1, and can be sold for twice its value (on average). You can only gain this benefit if you wield this weapon.",
    "req": [
      "crafting 3",
      "body 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 134,
    "name": "flaming blow",
    "effect": "When you activate a Melee weapon's effect you may it give the target an additional 1 stack of Burn. You can light or snuff out small fires using your weapon instead of a",
    "req": [
      "crafting 3",
      "body 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 138,
    "name": "steam weapons",
    "effect": "At the end of a Rest you can create 1 of 3 specialty weapons. You may only have 1 of these weapons at a time. See Weapons for more info.\nThe Bronze Bolter; a repeating crossbow, \nSteamthrower: a steam based Flamethrower\nClockwork Cannon; a large blunderbuss that shoots scrap.",
    "req": [
      "crafting 3",
      "mind 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 139,
    "name": "overclock",
    "effect": "Gain a number of stacks of Overclock equal to the dice given. You cannot have more than 6 stacks at any given point in time. \nThen when you move, do a weapon attack or lock a dice you increase your speed, damage, or dice value by your stacks of Overclock. Loosing all stacks of Overclock after the action.",
    "req": [
      "crafting 3",
      "mind 2"
    ],
    "dice": 1,
    "is_passive": false
  },
  {
    "id": 140,
    "name": "grappling hook",
    "effect": "Target a location or target within within Range 6. If you target a location Pull yourself to that location. If you target an object or creature pull a light object to you or make a Mind Attack. On hit pull the target 3 tiles to you.",
    "req": [
      "crafting 3",
      "mind 2"
    ],
    "dice": 2,
    "is_passive": false
  },
  {
    "id": 144,
    "name": "spectral artillery",
    "effect": "Gain 2 soul strain, then pick up to half your level (rounded down) locations within 12 tiles. A spectral artillery shot is fired from some far off place. Next turn creatures within Burst 1 of the chosen location roll Mind against the 3 dice given when activating. On failure they take 3 damage. On success, they take 1 damage.",
    "req": [
      "crafting 3",
      "soul 2"
    ],
    "dice": 3,
    "is_passive": false
  },
  {
    "id": 136,
    "name": "reforge",
    "effect": "When holding a Melee weapon, you can instantly reforge it into another Melee weapon of equivalent crafting value. Any Runes or attributes applied to it from other traits are retained.",
    "req": [
      "crafting 4",
      "body 2"
    ],
    "dice": 3,
    "is_passive": false
  },
  {
    "id": 425,
    "name": "familiar ranger module",
    "effect": "Your Golem’s Soul Weapon gets +4 range and gains Armor Piercing. \nAdditionally, it’s Armor Becomes Light.",
    "req": [
      "crafting 4",
      "soul 2",
      "broken 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 146,
    "name": "master of magic items",
    "effect": "You can be Bound to twice as many magic items.",
    "req": [
      "crafting 6",
      "soul 4"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 147,
    "name": "magical craftsman",
    "effect": "You can craft Greater Magic items, excluding potions.",
    "req": [
      "crafting 6",
      "soul 4"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 187,
    "name": "blood magic",
    "effect": "Gain an amount of Max Health equal to your Maximum Soul Strain. You can no longer gain Soul Strain, instead you take damage equal to the amount of Soul strain you would have gained. This damage bypasses Armor, and cannot be reduced in anyway.\nIf you have no Soul Strain you gain an amount of Spells equal to twice your Medicine. \nYou can no longer cast Healing spells.",
    "req": [
      "medicine 2",
      "body 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 190,
    "name": "plague doctor",
    "effect": "You gain immunity to Poisons.\nAdditionally, you can use Alchemy Tools to Create poisons using Medicine instead of Arcana.",
    "req": [
      "medicine 2",
      "mind 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 431,
    "name": "medical assistant familiar bonus",
    "effect": "Your Familiar gains ‘Spirit Claw’ weapon, the ‘Halo of Light or Dark’ trait, and gains the Undead type if they don't already have it.\n\nSpirit Claw - ## - Do 2 damage. Increases its damage by 1 every 2 levels you have. On a 9 or Higher: give the target 1 stack of Soul Strain.\n\nHalo of Light or Dark - # - Gain 2 Soul Strain. Give a creature Armor Health equal to your Medicine. Then pick one Light or Dark, which changes the halo’s effect; the creature can only have one type of halo at a time.\nLight: While they have this Armor Health they Glow as if the spell Glow was cast on them.\nDark: While they have this Armor Health they cannot gain stacks of Marked.",
    "req": [
      "medicine 2",
      "soul 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 197,
    "name": "if these walls could talk",
    "effect": "Spend a moment at crime scene or dead body, the spirits whisper what happened up to 24 hours prior. You may ask up to 3 questions. The spirits will answer the best they can but will never give more than a rough discription. The spirits also cannot describe something that happend through magic or if it was hidden with magic, such as a creature moving under the Invisibility spell.",
    "req": [
      "medicine 2",
      "soul 1"
    ],
    "dice": 3,
    "is_passive": false
  },
  {
    "id": 210,
    "name": "healthy hands",
    "effect": "When you cast the 'Healing Hands' Spell use your full Medicine roll instead of half. Additionally, you learn the Spell 'Healing Hands'. This does not count against the number of known spells you may have.\n",
    "req": [
      "medicine 2",
      "soul 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 422,
    "name": "halo of light or dark",
    "effect": "Gain 2 Soul Strain. Give a creature Armor Health equal to your Medicine. Then pick one Light or Dark, which changes the halo’s effect; the creature can only have one type of halo at a time.\nLight: While they have this Armor Health they Glow as if the spell Glow was cast on them.\nDark: While they have this Armor Health they cannot gain stacks of Marked.\n",
    "req": [
      "medicine 2",
      "soul 1"
    ],
    "dice": 1,
    "is_passive": false
  },
  {
    "id": 189,
    "name": "bloody mess",
    "effect": "Whenever you would apply Bleed to a creature, regain an amount of HP equal to the number of Bleed stacks applied. \nAdditionally, over the course of one minute, you may do a 'Identify an Illness or Curse' roll to analyze blood. The DL for this check is equal to the creatures level. On a success, you may also learn the following information in addition to normal information; you learn the creatures lineage, the creatures highest Stat, and how old the blood is.\n",
    "req": [
      "medicine 3",
      "body 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 188,
    "name": "blood shards",
    "effect": "Gain 2 Soul Strain then shoot shards of blood at a target. Give the target half your level (rounded down) stacks of Bleeding. On a Low Roll reduce the stacks by 1. On a High Roll increase the stacks by 1.",
    "req": [
      "medicine 3",
      "body 2"
    ],
    "dice": 2,
    "is_passive": false
  },
  {
    "id": 192,
    "name": "trained medic",
    "effect": "When you heal with a Bandage or Medkit, increase the healing by your level. \nAdditionally, gain Advantage when you roll Identify an Illness or Curse.",
    "req": [
      "medicine 3",
      "mind 2"
    ],
    "dice": 1,
    "is_passive": false
  },
  {
    "id": 193,
    "name": "recycled meds",
    "effect": "You can use Bandages and Medkits twice before they are used.",
    "req": [
      "medicine 3",
      "mind 2",
      "OOC 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 191,
    "name": "placebo",
    "effect": "Give a Creature within Range 6 an amount of Armor Health equal to your Medicine. You can only do this up to half your Medicine (rounded up) times per Rest.",
    "req": [
      "medicine 3",
      "mind 2",
      "OOC 0"
    ],
    "dice": 1,
    "is_passive": false
  },
  {
    "id": 200,
    "name": "eyebite",
    "effect": "When you effect someone with a spell that you cast, you can Blinded them until the start of your next turn.",
    "req": [
      "medicine 3",
      "soul 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 198,
    "name": "curse of pain",
    "effect": "Gain 2 Soul Strain and target a Creature or Object within range 6. Give the target the following Curse. If this target's an object, the curse can affect anyone who touches the object. \nThe curse goes away after 1 minute (6 turns), until dispelled by Purge (must beat the number next to the curse), you use this curse on another creature, or the target dies. The target knows you cursed it.\nCurse of Pain (6,5): You get Disadvantage on all Checks and Contests for a Skill (Body, Mind, Soul). This skill is chosen by the Curse's Caster. \nAdditionally, when you take 3 or more damage (before armor) take an additional damage.",
    "req": [
      "medicine 3",
      "soul 2"
    ],
    "dice": 3,
    "is_passive": false
  },
  {
    "id": 199,
    "name": "armor of bones",
    "effect": "At the end of a Rest make a suit of armor made of bones. This armor gives the wearer an additional 2 Armor Health for every point you have in Medicine. The armor alows the wearer to float in water without the need to swim. This armor counts as Light Armor.",
    "req": [
      "medicine 3",
      "soul 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 212,
    "name": "soul healer",
    "effect": "Touch a living creature, cannot target Undead or Constructs. The creature regains Half their max Health. You can do this once per Rest.",
    "req": [
      "medicine 4",
      "soul 2"
    ],
    "dice": 2,
    "is_passive": false
  },
  {
    "id": 202,
    "name": "eyes of the night",
    "effect": "You can see in poorly light areas as if they were illuminated, and can see through magical darkness. You cannot be blinded by magic.",
    "req": [
      "medicine 4",
      "soul 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 201,
    "name": "curse ward",
    "effect": "You get Advantage when rolling to succeed against a Curse or using Purge to remove a Curse. \nAdditionally, you can cast Purge once per rest without gaining Soul Strain.",
    "req": [
      "medicine 4",
      "soul 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 213,
    "name": "chain healing",
    "effect": "When you heal a creature you may heal another creature within 1 tile of them for half the healing (rounded down).",
    "req": [
      "medicine 4",
      "soul 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 194,
    "name": "medical genius",
    "effect": "When you use a Medkit on a creature they gain all the benefits of a Rest except for fully healing. (Medkit healing is still the same)",
    "req": [
      "medicine 5",
      "mind 3"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 203,
    "name": "undead tinkerer",
    "effect": "When you cast the spell Raise Undead, Instead of making a Zombie you can make a Shambler, Burster, or Spitter instead.",
    "req": [
      "medicine 5",
      "soul 3"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 205,
    "name": "curse of fear",
    "effect": "Gain 4 Soul Strain and target a Creature or Object within range 6. Give the target the following Curse. You can only use this curse on one target at a time. If this target's an object, the curse can affect anyone who touches the object. \nThe curse goes away after 1 minute (6 turns), until dispelled by Purge (must beat the number next to the curse), you use this curse on another creature, or the target dies. The target knows you cursed it.\nCurse of Fear (6,5,4): You see things that are not real. At the begining of your turn a terifying visage appears in an empty tile nearby. Roll a dice, On a 1 or 2 you spend your turn runnning from that space trying to hide, On a 3 or 4, spend all dice attacking that space. On a 5, or 6 you act normaly.",
    "req": [
      "medicine 5",
      "soul 3"
    ],
    "dice": 3,
    "is_passive": false
  },
  {
    "id": 204,
    "name": "curse of bones",
    "effect": "Gain 4 Soul Strain and target a Creature or Object within range 6. Give the target the following Curse. You can only use this curse on one target at a time. If this target's an object, the curse can affect anyone who touches the object. \nThe curse goes away after 1 minute (6 turns), until dispelled by Purge (must beat the number next to the curse), you use this curse on another creature, or the target dies. The target knows you cursed it.\nCurse of Bones (6,5,4): You get Disadvantage on all Checks and Contests for Subskills (Arcana, Charm, Crafting, Nature, Medicine, Thieving).",
    "req": [
      "medicine 5",
      "soul 3"
    ],
    "dice": 3,
    "is_passive": false
  },
  {
    "id": 195,
    "name": "resuscitate",
    "effect": "Touch a creature. You Reduce the target’s Death’s Door Count by 3 to a minimum of 1. \nAdditionally, heal the creature as if you used a Medkit. You can do this once per Rest.",
    "req": [
      "medicine 6",
      "mind 4"
    ],
    "dice": 2,
    "is_passive": false
  },
  {
    "id": 206,
    "name": "undead king",
    "effect": "You do not get attacked by creatures with the Undead type unless you attack them. \nAdditionally, you can do a Soul Contest against uncontrolled Undead (No owner) to try to gain control of them. This has no effect on target's with this trait.",
    "req": [
      "medicine 6",
      "soul 4"
    ],
    "dice": 2,
    "is_passive": false
  },
  {
    "id": 207,
    "name": "curse of life",
    "effect": "Gain 6 Soul Strain and target a Creature or Object within range 6. Give the target the following Curse. You can only use this curse on one target at a time. If this target's an object, the curse can affect anyone who touches the object. \nThe curse goes away if dispelled by Purge (must beat the number next to the curse), you use this curse on another creature, or the target dies. The target knows you cursed it.\nCurse of Life (6,5,5): You get an additional 50% of your current health (rounded up). But you can nolonger roll Deaths Door Rolls. (You die if you reach 0 or less health)",
    "req": [
      "medicine 6",
      "soul 4"
    ],
    "dice": 3,
    "is_passive": false
  },
  {
    "id": 208,
    "name": "conqueror of darkness",
    "effect": "Reduce the Soul Strain cost by 1 for any Dark Spells you cast. (Dark Spells have the tag Dark) (Curses from traits do not activate this trait) This cannot reduce the cost of spells below 1.",
    "req": [
      "medicine 6",
      "soul 4"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 245,
    "name": "marshall artist group",
    "effect": "Gain the following traits: Strong Punches, Climber, and Motivate. This trait costs 2 trait points. You may only select this trait at level 1.",
    "req": [
      "mind 1",
      "body 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 242,
    "name": "past and future",
    "effect": "You can now Lock two dice. When you would Lock a dice while having two Locked you may pick which Locked dice to replace.",
    "req": [
      "mind 1",
      "soul 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 239,
    "name": "kite",
    "effect": "When you activate the effect of a Weapon you may then move half your Speed.",
    "req": [
      "mind 2",
      "body 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 241,
    "name": "lucky",
    "effect": "When you roll a 1 you can re-roll that dice. You can only do this a number of times equal to your level per Rest.",
    "req": [
      "mind 2",
      "soul 4"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 240,
    "name": "foresight",
    "effect": "When you lock a dice, increase its value by 1. This effect cannot increase a dice's value over 6.",
    "req": [
      "mind 2",
      "soul 4"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 171,
    "name": "nature speak",
    "effect": "You can have simple conversations with animals, and can use Nature instead of Charm when talking to them.",
    "req": [
      "nature 1",
      "soul 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 155,
    "name": "viney slam",
    "effect": "Do a ground slam. Vines burst out of the cracks left in the ground. In a 3 tile cone in front of you all creatures in this area make a Body roll against the 3 dice given. On failure the creature is grappled until the start of your next turn.",
    "req": [
      "nature 2",
      "body 1"
    ],
    "dice": 3,
    "is_passive": false
  },
  {
    "id": 156,
    "name": "nature's bind",
    "effect": "You can Grapple someone using earth or plants within 4 tiles of you instead of having touch. All other rules still apply to the Grapple.",
    "req": [
      "nature 2",
      "body 1"
    ],
    "dice": 2,
    "is_passive": false
  },
  {
    "id": 157,
    "name": "draw roots",
    "effect": "Heal 1. You must be standing on soil or stone to do this. You can do this a number of times equal to your Nature stat per Rest.\nAlternatively, you can emplant yourself to the surface you are on. While emplanted you cannot be affected by Knockback, and get Double Advantage on other effects trying to move you.",
    "req": [
      "nature 2",
      "body 1"
    ],
    "dice": 1,
    "is_passive": false
  },
  {
    "id": 165,
    "name": "hidden in the bush",
    "effect": "You can use Nature instead of Thieving to Hide, and can travel while Hidden at a normal Speed instead of 1 tile slower.",
    "req": [
      "nature 2",
      "mind 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 430,
    "name": "animal friend familiar bonus",
    "effect": "Your Familiar gains ‘Thick Hide’ armor replacing its current 'Hide' armor. Gains the ‘Keen Tracker' trait, and gains the Animal type if they don't already have it.\n\nThick Hide - Gives 4*Level Armor Health., Light Armor\n\nKeen Tracker - Gain an additional dice when rolling for 'Tracking a Creature'. You may use sight, smell, or sound to make this roll. When the creature you are tracking is found (you see the creature), give them Marked for 1 minute (6 stacks of Marked).",
    "req": [
      "nature 2",
      "soul 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 173,
    "name": "animal form",
    "effect": "Gain 2 Soul Strain, you can transform into an animal (creature with just the Beast tag) that you have seen. The creature must have a Difficulty Rating (DR) your level or lower. The Shapeshift lasts until dispelled or you die. While transformed you replace your Character sheet with the Animal’s sheet. Your Health and Ward remain unchanged.",
    "req": [
      "nature 2",
      "soul 1"
    ],
    "dice": 2,
    "is_passive": false
  },
  {
    "id": 158,
    "name": "volcano aura",
    "effect": "Spend a dice to toggle on or off this Aura you can only have one Aura active at a time. While this Aura is active molts of fire start bubbling within 2 tiles around you, this area gives 2 Burn to any creature, other than yourself, that starts its turn in it.\nAdditionally, while active ice melts, water dries, and flora wilts in this area, potentially removing difficult turain.",
    "req": [
      "nature 3",
      "body 2"
    ],
    "dice": 1,
    "is_passive": false
  },
  {
    "id": 184,
    "name": "thorny armor",
    "effect": "At the end of a Rest make a suit of armor made of thorny vines. This armor gives the wearer an additional 4 Armor Health for every point you have in Nature. While Grappling or when being Grappled give the other target 2 stacks of Bleed at the begining of your turn. This armor counts as Medium Armor (-1 Speed).",
    "req": [
      "nature 3",
      "body 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 159,
    "name": "sandstorm aura",
    "effect": "Spend a dice to toggle on or off this Aura you can only have one Aura active at a time. While this Aura is active you make a dense Sandstorm within 2 tiles around you, this area is heavily obscured giving all creatures in this area Advantage on Hiding rolls.\nAdditionally, while this Aura is active you take half damage from Ranged Weapon Attacks.",
    "req": [
      "nature 3",
      "body 2"
    ],
    "dice": 1,
    "is_passive": false
  },
  {
    "id": 160,
    "name": "forest aura",
    "effect": "Spend a dice to toggle on or off this Aura you can only have one Aura active at a time. While this Aura is active you stimulate the growth of plants within 2 tiles of you. This area acts as difficult turrain for anyone other than yourself. \nAdditionally, any plants within this area blossom or bloom, and grass or moss grows if their wasent plantlife there already.",
    "req": [
      "nature 3",
      "body 2"
    ],
    "dice": 1,
    "is_passive": false
  },
  {
    "id": 166,
    "name": "marked as prey",
    "effect": "When you damage a Marked target, you do an extra Damage and reduce the target's Mark stacks by 1. \nAdditionally, you know the rough direction of creatures you Mark.",
    "req": [
      "nature 3",
      "mind 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 167,
    "name": "marked as dangerous",
    "effect": "When a target you Marked does damage. You may remove 1 Stack of Marked to reduce the damage by 1. This cannot reduce the damage below 1.\nAdditionally, if the target is a creature, you know the creatures highest Stat and Substat (name and number).",
    "req": [
      "nature 3",
      "mind 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 183,
    "name": "stronger flames",
    "effect": "Non-cantrip Spells that apply Burn apply an additional stack of Burn.",
    "req": [
      "nature 3",
      "soul 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 174,
    "name": "poisoned magic",
    "effect": "When you effect a target with a spell that costs Soul Strain you may give them a stack of Poisoned until the start of your next turn. \n\nAlternatively, you can roll Nature instead of Arcana to make poisons, doing so without spending gold.",
    "req": [
      "nature 3",
      "soul 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 175,
    "name": "plant growth",
    "effect": "Gain 2 Soul Strain. Make plants in Burst 3 grow explosively. This area becomes rough turrain for 1 minute (6 turns) and any creature, other than yourself, that enters or starts its turn in this area must make a Body roll against the 3 dice given. On failure the creature is grappled until the start of your next turn.",
    "req": [
      "nature 3",
      "soul 2"
    ],
    "dice": 3,
    "is_passive": false
  },
  {
    "id": 181,
    "name": "frostbite",
    "effect": "When you effect a creature with Stun, Webbed, or effects that reduce movement, deal 1 damage to them.",
    "req": [
      "nature 3",
      "soul 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 182,
    "name": "crystalized soul",
    "effect": "Whenever you gain Soul Strain from the result of casting a spell. Gain 1 Armor Health for every 2 Soul Strain gained.",
    "req": [
      "nature 3",
      "soul 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 161,
    "name": "canopy",
    "effect": "A target on a tile directly behind you becomes Hidden from any creature in front of you. Creatures that stand on the side or behind you can see the Hidden target. You cannot Hide a target larger than yourself.",
    "req": [
      "nature 4",
      "body 2"
    ],
    "dice": 1,
    "is_passive": false
  },
  {
    "id": 168,
    "name": "mark of the hunter",
    "effect": "Your Marks don't go away while you are within 2 Large tiles (4,320x4,320 tiles) the Marked Creature.",
    "req": [
      "nature 4",
      "mind 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 178,
    "name": "updraft",
    "effect": "Whenever you gain Soul Strain you can Fly (Move your speed in the air) until end of your turn.",
    "req": [
      "nature 4",
      "soul 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 177,
    "name": "improved animal form",
    "effect": "When you Transform through the use of the Animal Form Trait you can gain half of the Creature’s Health as Armor Health. \n\nAdditionally, you can speak normally while transformed and if you have the Nature Speak trait you retain it when transformed.",
    "req": [
      "nature 4",
      "soul 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 176,
    "name": "soul hardened spirit animal",
    "effect": "Your Spirit Animal gains Ward 2 and 1 Armor stack. \nAdditionally, it’s Armor Becomes Medium",
    "req": [
      "nature 4",
      "soul 2",
      "broken 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 162,
    "name": "overgrowth",
    "effect": "You become noticeably larger. You get Advantage on Body rolls.",
    "req": [
      "nature 5",
      "body 3"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 170,
    "name": "longer marks",
    "effect": "When you Mark a creature, increase its marked stacks by 3.",
    "req": [
      "nature 5",
      "mind 3"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 169,
    "name": "elemental shots",
    "effect": "You infuse ammo with elemental energy. Make a Ranged Weapon Attack. The infused ammo does 1 additional damage. \nAdditionally, choose one of the following effects: \nFire: On hit, give the target 2 stacks of Burn \nIce: On hit, give the target 1 stack of Stun \nEarth: On hit, the target is knocked back 2 tiles \nWind: On hit, another target within 2 tiles takes half damage (rounded down).",
    "req": [
      "nature 5",
      "mind 3"
    ],
    "dice": 3,
    "is_passive": false
  },
  {
    "id": 179,
    "name": "elemental fangs",
    "effect": "When you Transform through the use of the Animal Form Trait you can imbue the animal with one of the following effects.\nFire: While transformed your Weapon Attacks inflict an additional 1 Burn, and when you are affected by Burn reduce the number of stacks you gain by 1.\nIce: You can't lose Speed from non magical sources, and take half damage from Water Spells. \nEarth: While transformed do an additional 1 Damage on your Weapon Attacks, and gain the Draw Roots Trait.\nWind: While transformed you get an additional 2 Speed.",
    "req": [
      "nature 5",
      "soul 3"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 163,
    "name": "warden's grasp",
    "effect": "Once per turn when you hit a target with a Melee Attack, you can do a Grapple check on them without spending extra dice.",
    "req": [
      "nature 6",
      "body 4"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 164,
    "name": "guarding aura",
    "effect": "You know how many creatures are within your Aura, even if they are Hidden. At the beginning of your turn, for every creature in your Aura you get 1 Armor Health. If you do not have an Aura you get one with the following effect: Spend a dice to toggle on or off this Aura you can only have one Aura active at a time. While this Aura is Active a soft glow appears within 2 tiles of you.",
    "req": [
      "nature 6",
      "body 4"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 180,
    "name": "soulbound tree hopper",
    "effect": "Spend 24 hours binding your Soul to a tree turning it into a Soulbound Tree. While this tree stands you are able to gain 5 Soul Strain and walk into another tree to teleport yourself, and anyone touching you, to this Soulbound tree. You can have any number of Soulbound Trees.",
    "req": [
      "nature 6",
      "soul 4"
    ],
    "dice": 3,
    "is_passive": false
  },
  {
    "id": 244,
    "name": "soul stealer",
    "effect": "When you kill an enemy with a Melee Attack, remove 2 stacks of Soul Strain",
    "req": [
      "soul 4",
      "body 2",
      "OOC 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 230,
    "name": "shadow walk",
    "effect": "While you are Hidden or unseen you may turn Invisible. This Invisibility lasts until the start of your next turn.",
    "req": [
      "thieving 1",
      "soul 1"
    ],
    "dice": 1,
    "is_passive": false
  },
  {
    "id": 219,
    "name": "slap back",
    "effect": "Spend your locked dice when using this trait. Make a Melee attack on a creature who has hit you with a Melee attack.",
    "req": [
      "thieving 2",
      "body 1"
    ],
    "dice": 1,
    "is_passive": false
  },
  {
    "id": 224,
    "name": "silent scaling",
    "effect": "You make no noise while climbing or falling up to half your Speed, and can climb using Thieving instead of Body.",
    "req": [
      "thieving 2",
      "mind 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 223,
    "name": "concealed item",
    "effect": "You can completely conceal a small item on your person. When you roll Thieving to hide an item on yourself you get Advantage on the roll, and creatures searching you get Disadvantage on their roll. \nAdditionally, when you make a Weapon Attack with a concealed weapon, the weapon is not visible.",
    "req": [
      "thieving 2",
      "mind 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 231,
    "name": "spell copying",
    "effect": "If you see a spell being cast by someone else, you temporarily know that spell and how to cast it for 1 minute (6 turns) regardless of if you know the spell innately.",
    "req": [
      "thieving 2",
      "soul 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 432,
    "name": "shadow-born familiar bonus",
    "effect": "Your Familiar gains ‘Spirit Claw’ weapon, the ‘Shadow Skip’ trait, the ‘Pocket Dimension’ spell, and gains the Planar type if they don't already have it.\n\nSpirit Claw - ## - Do 2 damage. Increases its damage by 1 every 2 levels you have. On a 9 or Higher: give the target 1 stack of Soul Strain.",
    "req": [
      "thieving 2",
      "soul 1"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 232,
    "name": "obscured spell",
    "effect": "You may roll Hide to conceal the fact that you are casting a spell. You roll against any creature who would see you cast the spell.",
    "req": [
      "thieving 2",
      "soul 1"
    ],
    "dice": 2,
    "is_passive": false
  },
  {
    "id": 233,
    "name": "shadow friend",
    "effect": "When you use the Create Familiar at the end of a Rest you can instead create a Shadow Friend (See Creatures). This replaces the familiar, dispelling the familiar if one already exists. \nYou can control up to your level of personal minions with your dice, but they must all be given the same Command. If the shadow is not given any commands it does not do any action. When you spend a dice to move you may also have the shadow move as well.",
    "req": [
      "thieving 2",
      "soul 1",
      "broken 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 235,
    "name": "spell disarmament",
    "effect": "You can spend 1 minute casting Dispel Magic with Thieves’ tools without gaining Soul Strain.",
    "req": [
      "thieving 3",
      "soul 2"
    ],
    "dice": 2,
    "is_passive": false
  },
  {
    "id": 234,
    "name": "silencing strike",
    "effect": "Gain 2 Soul Strain, then make a Weapon Attack. Give the target a Stack of Silence. If you activate the effect of your weapon give them 2 stacks of Silence instead. \nAlternatively you can do no damage to the target and give 3 stacks instead.",
    "req": [
      "thieving 3",
      "soul 2"
    ],
    "dice": 2,
    "is_passive": false
  },
  {
    "id": 236,
    "name": "now you see me",
    "effect": "When you do the Move action while under the effects of a movement based spell or Soul trait you are Invisible.",
    "req": [
      "thieving 3",
      "soul 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 220,
    "name": "larceny",
    "effect": "Roll a contested Body Check against a target within 1 tile of you. On success you wrestle an item you can see the target holding or wearing away from them.",
    "req": [
      "thieving 4",
      "body 2"
    ],
    "dice": 2,
    "is_passive": false
  },
  {
    "id": 222,
    "name": "off balance",
    "effect": "Successful Push actions reduce the target's Speed by half.",
    "req": [
      "thieving 4",
      "body 2",
      "OOC 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 221,
    "name": "get rough",
    "effect": "You can push creatures a number of tiles based on your Body +1 instead of just 3 tiles.",
    "req": [
      "thieving 4",
      "body 2",
      "OOC 0"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 225,
    "name": "in the shadows",
    "effect": "You can do Hidden Checks with 1 less dice in combat. When you kill a creature while Hidden you do not become revealed.",
    "req": [
      "thieving 4",
      "mind 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 226,
    "name": "hidden in plain sight",
    "effect": "While disguised, you can roll Thieving instead of Charm to Convince Someone of Something as your disguise.",
    "req": [
      "thieving 4",
      "mind 2"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 237,
    "name": "spell thief",
    "effect": "If you successfully Counterspell a Spell. You can Cast that spell for half its Soul Strain cost (rounded up) on your next turn.\nAdditionally, you can gain 2 Soul Strain to learn 1 random spell from creature you can see, you know this spell for 1 hour.",
    "req": [
      "thieving 4",
      "soul 2"
    ],
    "dice": 1,
    "is_passive": false
  },
  {
    "id": 227,
    "name": "assassinate",
    "effect": "When you do a Melee Weapon attack, after damaging them, if the target has half your Level (rounded up) or less health set their health to 0. If they roll Deaths Door rolls they roll 3 times.",
    "req": [
      "thieving 5",
      "mind 3"
    ],
    "dice": 0,
    "is_passive": true
  },
  {
    "id": 228,
    "name": "redirect",
    "effect": "When you get hit spend your Locked dice to redirect the attack to a creature within 1 tile of you. You cannot do this if there are no creatures within 1 tile of you.",
    "req": [
      "thieving 5",
      "mind 3",
      "OOC 0"
    ],
    "dice": 1,
    "is_passive": false
  },
  {
    "id": 238,
    "name": "body possession",
    "effect": "You can take over another humanoids living body for up to 10 minutes. The affected creature must be unconscious and will wake up if it takes damage. At the end of the effect, if you choose to leave the body, or if the creature wakes up from damage, you are booted to the nearest safe tile next to the creature. You cannot enter the same creature for 1 day after using this effect on them.",
    "req": [
      "thieving 5",
      "soul 3"
    ],
    "dice": 3,
    "is_passive": false
  },
  {
    "id": 229,
    "name": "toys a plenty",
    "effect": "Use an item that is from your bag, or is within 1 tile of you in the world.",
    "req": [
      "thieving 6",
      "mind 4"
    ],
    "dice": 1,
    "is_passive": false
  }
]