{
    "1": {
        "name": "Weapon Attack",
        "effect": "Use your weapon to hit a target. To hit a target you must give 2 dice. Then when doing damage removing damage from the target based on its Armor and Ward.",
        "req": [
            "Base"
        ],
        "dice": 2,
        "is_passive": false
    },
    "2": {
        "name": "Spell Casting",
        "effect": "Gain Soul Strain to Cast a spell from your Spell list. Soul Strain cost and dice cost depend on spell.",
        "req": [
            "Base"
        ],
        "dice": 0,
        "is_passive": false
    },
    "3": {
        "name": "Use an Item",
        "effect": "Use an item that is from your bag, or is within 1 tile of you in the world.",
        "req": [
            "Base"
        ],
        "dice": 2,
        "is_passive": false
    },
    "4": {
        "name": "Move",
        "effect": "Spend a dice to move your Speed. Swimming and Climbing use two tiles instead of 1.",
        "req": [
            "Base"
        ],
        "dice": 1,
        "is_passive": false
    },
    "5": {
        "name": "Hide",
        "effect": "Roll a Contested Thieving roll against all a Core roll of all creatures that can see you. If you succeed you become Hidden. You do not need to beat your ally’s Search to still go Hidden, unless you are trying to hide from them or they are trying to stop you.",
        "req": [
            "Base"
        ],
        "dice": 2,
        "is_passive": false
    },
    "6": {
        "name": "Search",
        "effect": "Roll your Core Skill. Pick the top 3 dice. If you meet or beat the dice values of the hidden creature they are no longer Hidden.",
        "req": [
            "Base"
        ],
        "dice": 2,
        "is_passive": false
    },
    "7": {
        "name": "Grapple",
        "effect": "Roll a Contested Body Check against a target within 1 tile of you. If you succeed then the target is Grappled.",
        "req": [
            "Base"
        ],
        "dice": 2,
        "is_passive": false
    },
    "8": {
        "name": "Push",
        "effect": "Roll a Contested Body Check against a target within 1 tile of you. If you succeed then the target is pushed 3 tiles away from you.",
        "req": [
            "Base"
        ],
        "dice": 2,
        "is_passive": false
    },
    "9": {
        "name": "Overwatch",
        "effect": "Make a Melee Attack at the first target that moves within your weapon range.",
        "req": [
            "Base"
        ],
        "dice": 1,
        "is_passive": false
    },
    "10": {
        "name": "Lock",
        "effect": "You may Lock any unused dice at the end of your Turn.",
        "req": [
            "Base"
        ],
        "dice": 1,
        "is_passive": true
    },
    "11": {
        "name": "MONK 1:",
        "effect": "When you get this you may use your Level instead of a set skill plus 2. \nSet your Unarmed Damage to 2. \nYour unarmored Armor Score is the same as Light Armor. You still retain the benefits of being unarmored.",
        "req": [
            "BROKEN",
            "body 1",
            "mind 1",
            "soul 1"
        ],
        "dice": 0,
        "is_passive": true
    },
    "12": {
        "name": "MONK 2:",
        "effect": "Your Unarmed Attacks can damage Incorporeal things as if you where Incorporeal.\nSet your Unarmed Damage to 4. \nYour unarmored Armor Score is the same as Medium Armor. You still retain the benefits of being unarmored.",
        "req": [
            "BROKEN",
            "body 2",
            "mind 2",
            "soul 2"
        ],
        "dice": 0,
        "is_passive": true
    },
    "13": {
        "name": "MONK 3:",
        "effect": "You have achieved inner balance, perfect hegemony inside yourself.\nUsing 2 dice you can purify yourself of curse and various other negative effects.\nAdditionally, you can not be knocked prone unless you allow it.\nSet your Unarmed Damage to 6. \nYour unarmored Armor Score is the same as Heavy Armor. You still retain the benefits of being unarmored.",
        "req": [
            "BROKEN",
            "body 3",
            "mind 3",
            "soul 3"
        ],
        "dice": 2,
        "is_passive": true
    },
    "14": {
        "name": "Meditate",
        "effect": "You can spend 1 hour meditating to cleanse half your Soul Strain.",
        "req": [
            "Base"
        ],
        "dice": 0,
        "is_passive": true
    },
    "15": {
        "name": "Power Attack",
        "effect": "If a 6 was spent doing a non AOE Attack it does an extra damage.",
        "req": [
            "Base"
        ],
        "dice": 2,
        "is_passive": true
    },
    "16": {
        "name": "soul Manipulator",
        "effect": "While soul is your Core Skill, Triple your Soul when Calculating Max Soul Strain instead of Doubling it.",
        "req": [
            "Base"
        ],
        "dice": 0,
        "is_passive": true
    },
    "17": {
        "name": "Stance Fighting Group",
        "effect": "Gain the following traits: Pushing Strike, Feint, and Bash. This trait costs 2 trait points. You may only select this trait at level 1.",
        "req": [
            "BROKEN",
            "body 2"
        ],
        "dice": 0,
        "is_passive": true
    },
    "18": {
        "name": "Marshall Artist Group",
        "effect": "Gain the following traits: Strong Punches, Climber, and Setup.  This trait costs 2 trait points. You may only select this trait at level 1.",
        "req": [
            "body 1",
            "mind 1"
        ],
        "dice": 0,
        "is_passive": true
    },
    "19": {
        "name": "Barbarian Fighting Group",
        "effect": "Gain the following traits: Hearty, Shredder, and Bull Rush.  This trait costs 2 trait points. You may only select this trait at level 1.",
        "req": [
            "body 2"
        ],
        "dice": 0,
        "is_passive": true
    },
    "20": {
        "name": "Athlete Group",
        "effect": "You gain the following traits: Climber, Quick Runner, and Pitcher.  This trait costs 2 trait points. You can only select this trait at level 1.",
        "req": [
            "body 2"
        ],
        "dice": 0,
        "is_passive": true
    },
    "21": {
        "name": "Bloodhound",
        "effect": "Gain 2 extra Speed when moving to a Marked or Bleeding (has Bleed stacks) creature.\nThis can be taken multiple times to increase the Speed by 2 each time this is taken.",
        "req": [
            "body 1"
        ],
        "dice": 0,
        "is_passive": true
    },
    "22": {
        "name": "Strong Punches",
        "effect": "When doing an Attack with a Fist Weapon the damage is equal to half your Level (rounded up) plus 1.",
        "req": [
            "body 1"
        ],
        "dice": 2,
        "is_passive": true
    },
    "23": {
        "name": "Climber",
        "effect": "Can move your Speed up vertical walls without needing to roll or spending extra Speed.",
        "req": [
            "body 1"
        ],
        "dice": 1,
        "is_passive": true
    },
    "24": {
        "name": "Pushing Strike",
        "effect": "Do a Melee Attack it has an additional 3 Knockback.",
        "req": [
            "body 1"
        ],
        "dice": 3,
        "is_passive": false
    },
    "25": {
        "name": "Hearty",
        "effect": "Gain additional Max Health equal to your Body.",
        "req": [
            "body 1"
        ],
        "dice": 0,
        "is_passive": true
    },
    "26": {
        "name": "Brace",
        "effect": "Take no damage from knockback.",
        "req": [
            "BROKEN",
            "body 2"
        ],
        "dice": 0,
        "is_passive": true
    },
    "27": {
        "name": "Shredder",
        "effect": "Do a Melee Attack, this attack does no damage. Remove Armor equal to your damage. You can only do this once per turn. Additionally, you gain advantage when trying to break objects that are smaller than you.",
        "req": [
            "body 2"
        ],
        "dice": 2,
        "is_passive": false
    },
    "28": {
        "name": "Feint",
        "effect": "Make a Weapon Attack. You may add 3 to one of the dice you use for the attack. At the end of your turn gain Stun 1. You can only do this once per turn.",
        "req": [
            "body 2"
        ],
        "dice": 2,
        "is_passive": false
    },
    "29": {
        "name": "Quick Runner",
        "effect": "Gain 1 extra Speed. This can be taken multiple times to increase the Speed by 1 each time this is taken.",
        "req": [
            "body 2"
        ],
        "dice": 0,
        "is_passive": true
    },
    "30": {
        "name": "Endure",
        "effect": "Gain 2 Temporary Health. This cannot be done while you have Temporary Health.",
        "req": [
            "body 3"
        ],
        "dice": 1,
        "is_passive": false
    },
    "31": {
        "name": "Bashing Strike",
        "effect": "Do a Melee Attack, this attack does no damage. Stun 3. Alternatively, if the target is unaware of you you can do a Body Contest against the target. On success the target is knocked unconscious for 1 minute (6 turns), until another creature spends 1 dice to wake them up, or they take damage.",
        "req": [
            "body 3"
        ],
        "dice": 2,
        "is_passive": false
    },
    "32": {
        "name": "Wall Bang",
        "effect": "When you Knockback a target into non destructible surface (wall) they take damage for every tile they do not move, instead of for every 2 tiles they dont move.",
        "req": [
            "body 3"
        ],
        "dice": 0,
        "is_passive": true
    },
    "33": {
        "name": "Disarm",
        "effect": "Do a Melee Attack, this attack does no damage. If the target is holding a weapon they drop the weapon and it goes 3 tiles away.",
        "req": [
            "body 4"
        ],
        "dice": 2,
        "is_passive": false
    },
    "34": {
        "name": "Critical Strike",
        "effect": "Do a Melee Attack. Roll a dice on a 5 or 6 it does Double damage. Otherwise it does normal damage. This can only be done once per turn.",
        "req": [
            "body 6"
        ],
        "dice": 2,
        "is_passive": false
    },
    "35": {
        "name": "Deaths Reaper",
        "effect": "When you kill a creature with a Melee Attack. Gain an additional Dice.",
        "req": [
            "body 6"
        ],
        "dice": 2,
        "is_passive": true
    },
    "36": {
        "name": "Deaths Knock",
        "effect": "While on Death’s Door you do an extra 2 damage from Weapon Attacks.",
        "req": [
            "body 2",
            "mind 1"
        ],
        "dice": 2,
        "is_passive": true
    },
    "37": {
        "name": "Defender",
        "effect": "When you use Overwatch and you hit a creature. That creature’s Speed is set to 0 and gets Webbed this turn.",
        "req": [
            "body 2",
            "mind 1"
        ],
        "dice": 1,
        "is_passive": true
    },
    "38": {
        "name": "Fortify",
        "effect": "Gain a Stack of Armor. You cannot gain more than 3 Armor from this trait per Rest.",
        "req": [
            "body 4",
            "mind 2"
        ],
        "dice": 2,
        "is_passive": false
    },
    "39": {
        "name": "Combo Finisher",
        "effect": "If you hit the same creature twice this turn you can do another Weapon Attack.",
        "req": [
            "body 4",
            "mind 2"
        ],
        "dice": 2,
        "is_passive": false
    },
    "40": {
        "name": "Blessed/Cursed Caster",
        "effect": "You have been gifted with power. You can cast Bless or Weak Curse using 1 Soul Strain instead of 2, and all spells you cast do an extra 1 damage to Undead.",
        "req": [
            "body 2",
            "soul 1"
        ],
        "dice": 0,
        "is_passive": true
    },
    "41": {
        "name": "Powerful Smites",
        "effect": "When you cast Smite, increase its damage by half your Soul rounded up.",
        "req": [
            "body 2",
            "soul 1"
        ],
        "dice": 2,
        "is_passive": true
    },
    "42": {
        "name": "Protected",
        "effect": "When you are put on Death’s Door, gain 2 stacks of Ward.",
        "req": [
            "body 4",
            "soul 2"
        ],
        "dice": 0,
        "is_passive": true
    },
    "43": {
        "name": "Spell Combo",
        "effect": "Cast a Damaging Melee Spell. After hitting with this Melee Spell, take the lowest die spent on the spell and the other given die to make a Melee Weapon Attack. This cannot be done more than once per turn.",
        "req": [
            "body 6",
            "soul 4"
        ],
        "dice": 3,
        "is_passive": false
    },
    "44": {
        "name": "Tactician Group",
        "effect": "You gain the following traits: Think Ahead, Command, and Motivate.  This trait costs 2 trait points. You can only select this trait at level 1.",
        "req": [
            "mind 2"
        ],
        "dice": 0,
        "is_passive": true
    },
    "45": {
        "name": "Marksman Group",
        "effect": "You gain the following traits: Crippling Shot, Dodge, and On Guard.  This trait costs 2 trait points. You can only select this trait at level 1.",
        "req": [
            "mind 2"
        ],
        "dice": 0,
        "is_passive": true
    },
    "46": {
        "name": "Mental Mage",
        "effect": "If your Max Soul Strain is 0 it becomes 2. If it is higher, increase it by 1.",
        "req": [
            "mind 1"
        ],
        "dice": 0,
        "is_passive": true
    },
    "47": {
        "name": "Setup",
        "effect": "Give yourself the dice spent on this skill next turn. This can only be done once per turn.",
        "req": [
            "mind 1"
        ],
        "dice": 1,
        "is_passive": false
    },
    "48": {
        "name": "On Guard",
        "effect": "If you end your turn without Attacking/Damaging anything. Go on Overwatch for free.",
        "req": [
            "mind 1"
        ],
        "dice": 2,
        "is_passive": true
    },
    "49": {
        "name": "Mark",
        "effect": "Mark a target for 3 turns. (Marked Targets cant become hidden and loose 1 Armor if they have Armor) [Marking an already Marked Target has no effect except to reset the duration of Marked]",
        "req": [
            "mind 1"
        ],
        "dice": 1,
        "is_passive": false
    },
    "50": {
        "name": "Motivate",
        "effect": "Target a creature you can see. Give the target the dice you used on this skill. This can be used outside of Combat when rolling a dice for a check. If you and the target both roll this check you spend one of your dice in the check, otherwise roll Mind then spend a dice.",
        "req": [
            "mind 1"
        ],
        "dice": 1,
        "is_passive": false
    },
    "51": {
        "name": "Dodge",
        "effect": "When you take damage you may spend your Locked dice to move 1 tile in any direction.",
        "req": [
            "mind 2"
        ],
        "dice": 1,
        "is_passive": true
    },
    "52": {
        "name": "Crippling Shot",
        "effect": "Do a Ranged Attack, on hit, reduce the target’s Speed by 2 to a max of 4 reduction.",
        "req": [
            "mind 2"
        ],
        "dice": 3,
        "is_passive": false
    },
    "53": {
        "name": "Think Ahead",
        "effect": "Split a dice. Cannot split a 1.",
        "req": [
            "mind 2"
        ],
        "dice": 1,
        "is_passive": false
    },
    "54": {
        "name": "Deadeye",
        "effect": "Spend 2 1’s to hit a target with a Ranged Attack. This cannot be used more than once in a turn. This can be taken multiple times to increase the number of times you can do this in a turn.",
        "req": [
            "mind 2"
        ],
        "dice": 1,
        "is_passive": false
    },
    "55": {
        "name": "Weakspot",
        "effect": "When a Creature attacks a Creature you Marked they may add 1 to a dice roll once per turn.",
        "req": [
            "mind 2"
        ],
        "dice": 0,
        "is_passive": true
    },
    "56": {
        "name": "Marking Shot",
        "effect": "Do a Ranged Attack, it gives them Marked for 2 turns on hit. This cannot be used more than once in a turn.",
        "req": [
            "mind 2"
        ],
        "dice": 3,
        "is_passive": false
    },
    "57": {
        "name": "Command",
        "effect": "Give an ally the ability to attack (2 dice) or move (1 dice). You cannot use this ability more than once per turn.",
        "req": [
            "mind 2"
        ],
        "dice": 2,
        "is_passive": false
    },
    "58": {
        "name": "Covering Fire",
        "effect": "Make a Ranged Attack. On hit stop the target from being able to do Overwatch, cast spells, or do actions until the start of their turn.",
        "req": [
            "mind 3"
        ],
        "dice": 3,
        "is_passive": false
    },
    "59": {
        "name": "Train of Thought",
        "effect": "If you don't have a locked die at the end of your turn lock a 3.",
        "req": [
            "mind 3"
        ],
        "dice": 0,
        "is_passive": true
    },
    "60": {
        "name": "Coordinated Attack",
        "effect": "Make a Weapon Attack against a single target. An ally within 1 tile of the target may spend their locked dice and the bonus dice spent on this trait to make an attack against the same target.",
        "req": [
            "mind 3"
        ],
        "dice": 3,
        "is_passive": false
    },
    "61": {
        "name": "Collateral",
        "effect": "Damage up to 3 creatures in a strait line with a Ranged Weapon Attack.",
        "req": [
            "mind 3"
        ],
        "dice": 3,
        "is_passive": false
    },
    "62": {
        "name": "Change of Thinking",
        "effect": "Set a dice to 4. You can do this once per turn.",
        "req": [
            "mind 4"
        ],
        "dice": 1,
        "is_passive": false
    },
    "63": {
        "name": "Size Up",
        "effect": "Target a creature you can see. You determine which of the targets Primary Skills (Body | Mind | Soul) are highest and lowest. You do not know the values of these Skills.",
        "req": [
            "mind 4"
        ],
        "dice": 3,
        "is_passive": false
    },
    "64": {
        "name": "Trick Shot",
        "effect": "Do a Ranged attack. You gain 3 additional range, and can hit targets you dont see, so long as there is a path to them from where you are within range.",
        "req": [
            "mind 5"
        ],
        "dice": 3,
        "is_passive": false
    },
    "65": {
        "name": "Ranged Overwatch",
        "effect": "Go on Overwatch with a Ranged Weapon.",
        "req": [
            "mind 5"
        ],
        "dice": 1,
        "is_passive": false
    },
    "66": {
        "name": "Outsmart",
        "effect": "During the enemy’s turn replace a creatures dice with the one given.",
        "req": [
            "mind 6"
        ],
        "dice": 1,
        "is_passive": false
    },
    "67": {
        "name": "Illusion of Choice",
        "effect": "You can Manipulate twice a turn instead of once.",
        "req": [
            "mind 6"
        ],
        "dice": 0,
        "is_passive": true
    },
    "68": {
        "name": "Kite",
        "effect": "When you land an attack. You may then move half your Speed.",
        "req": [
            "body 1",
            "mind 2"
        ],
        "dice": 2,
        "is_passive": true
    },
    "69": {
        "name": "Unbroken Sprint",
        "effect": "Move 3 times your Speed.",
        "req": [
            "body 1",
            "mind 2"
        ],
        "dice": 2,
        "is_passive": false
    },
    "70": {
        "name": "Rundown",
        "effect": "When an enemy moves within half your Speed; you can spend your locked dice to move half your Speed.",
        "req": [
            "body 1",
            "mind 2"
        ],
        "dice": 1,
        "is_passive": true
    },
    "71": {
        "name": "Reposition",
        "effect": "When an ally attacks; you can spend your locked dice to move half your Speed.",
        "req": [
            "body 2",
            "mind 4"
        ],
        "dice": 1,
        "is_passive": true
    },
    "72": {
        "name": "Go Faster",
        "effect": "Gain a bonus to your Speed equal to half of the higher dice expended (Rounded Down). Then Move your Speed.",
        "req": [
            "body 2",
            "mind 4"
        ],
        "dice": 2,
        "is_passive": false
    },
    "73": {
        "name": "mind Reader",
        "effect": "Attempt to force your mind into another creature's mind that you can see. Roll a Contested Mind check. On success you can read the creatures surface thoughts. Additionally, you can roll another Contested Mind check to look for some information the creature may have memories about. You can only be bound to one creature at a time.",
        "req": [
            "mind 2",
            "soul 1"
        ],
        "dice": 2,
        "is_passive": false
    },
    "74": {
        "name": "mind over Matter",
        "effect": "When you take damage you can spend your Locked dice and gain Stun 1 and negate the damage. This does not negate other effects such as Knockback or Ward removal.",
        "req": [
            "mind 4",
            "soul 2"
        ],
        "dice": 1,
        "is_passive": true
    },
    "75": {
        "name": "Telekinetic Mind",
        "effect": "You learn the spells Telekinesis, Phantom Fishing Rod, and Poprocks if you don't already know them. Additionally, you can cast Telekinesis for only 1 Soul Strain instead of 3.",
        "req": [
            "mind 4",
            "soul 2"
        ],
        "dice": 1,
        "is_passive": false
    },
    "76": {
        "name": "The Swarm Group",
        "effect": "You gain the following traits: Create Familiar, Simple Golem (Crafting), and Simple Golem (Arcana).  This trait costs 2 trait points. You can only select this trait at level 1.",
        "req": [
            "arcana 2",
            "BROKEN",
            "crafting 2",
            "soul 1"
        ],
        "dice": 0,
        "is_passive": true
    },
    "77": {
        "name": "Apprentice Wizard Group",
        "effect": "You gain the following traits: Yoyo, Force Field, and Create Familiar.  This trait costs 2 trait points. You can only select this trait at level 1.",
        "req": [
            "soul 2"
        ],
        "dice": 0,
        "is_passive": true
    },
    "78": {
        "name": "Telepathy",
        "effect": "Bind your mind to a willing creature's mind. You can use your action on later turns to see/hear through their senses or send/receive simple messages. You can only be bound to one creature at a time.",
        "req": [
            "soul 1"
        ],
        "dice": 1,
        "is_passive": false
    },
    "79": {
        "name": "Create Familiar",
        "effect": "At the end of a Rest you can create a https://www.notion.so/04fed09659e84ab0a24fecdec3d0d64b?pvs=21 (See Creatures). You may pick its type (Animal, Construct, Monstrosity, Planar, or Undead) and appearance each time it is created. \nYou can control up to your level of personal minions with your dice, but they must all be given the same Command. If the familiar is not given any commands it does not do any action. When you spend a dice to move you may also have the familiar move as well.",
        "req": [
            "soul 1"
        ],
        "dice": 2,
        "is_passive": true
    },
    "80": {
        "name": "Dreams of the Future",
        "effect": "At the end of a Rest roll a number of dice equal to your Level and Lock one of the dice.",
        "req": [
            "soul 1"
        ],
        "dice": 0,
        "is_passive": true
    },
    "81": {
        "name": "Yoyo",
        "effect": "Move your Speed. At the end of the turn teleport back to where you started the turn.",
        "req": [
            "soul 1"
        ],
        "dice": 1,
        "is_passive": false
    },
    "82": {
        "name": "Split Soul",
        "effect": "Cleanse 2. You can do this a number of times equal to your Soul per Rest.",
        "req": [
            "soul 2"
        ],
        "dice": 3,
        "is_passive": false
    },
    "83": {
        "name": "Shield",
        "effect": "Spend your Locked dice to activate. Cast Cube, making a flat shield shape between you and whatever is attacking you. The damage first goes to the cube then to you. The cube cannot block Area damage and goes away at the end of your next turn.",
        "req": [
            "soul 2"
        ],
        "dice": 1,
        "is_passive": true
    },
    "84": {
        "name": "Shaped Explosions",
        "effect": "Cast an area of effect spell. When you do, you can choose up to 3 creatures within the area. Those creatures succeed on the save without needing to roll.",
        "req": [
            "soul 3"
        ],
        "dice": 4,
        "is_passive": false
    },
    "85": {
        "name": "Focused",
        "effect": "You do not lose Focus from taking damage.",
        "req": [
            "soul 3"
        ],
        "dice": 0,
        "is_passive": true
    },
    "86": {
        "name": "soul Ward",
        "effect": "When you take damage you can gain Ward 1, and gain 2 Soul Strain, then take the damage. This effect cannot happen if you are at max Ward.",
        "req": [
            "soul 4"
        ],
        "dice": 0,
        "is_passive": true
    },
    "87": {
        "name": "Familial Flock",
        "effect": "You create up to 2 Familiars (or equivalent such as Personal Construct) at the end of a Rest. At level 6 it becomes 3 familiars and at level 9 it becomes 4.",
        "req": [
            "soul 4"
        ],
        "dice": 0,
        "is_passive": true
    },
    "88": {
        "name": "Soulbound Familiar",
        "effect": "Your Familiar gains the spell Swapper with a St cost of 1, however it only can target the Owner (you).\nThe Owner (you) can cast spells through the familiar as if they (you) where the familiar.",
        "req": [
            "soul 4"
        ],
        "dice": 0,
        "is_passive": true
    },
    "89": {
        "name": "Reactive Explosions",
        "effect": "When you do an area of effect spell, you can set one of the required dice to 5 (You still spend 3 dice, you just change 1 dice).",
        "req": [
            "soul 5"
        ],
        "dice": 0,
        "is_passive": true
    },
    "90": {
        "name": "soul Shielded",
        "effect": "You can have a maximum of 5 Ward instead of 3. Additionally, gain an additional Ward on Rest.",
        "req": [
            "soul 6"
        ],
        "dice": 0,
        "is_passive": true
    },
    "91": {
        "name": "Acceleration",
        "effect": "Gain Speed equal to 1/3 your current Soul Strain (rounded down). This effect goes away at the end of your turn.",
        "req": [
            "soul 6"
        ],
        "dice": 1,
        "is_passive": false
    },
    "92": {
        "name": "Summoners Command",
        "effect": "At the start of your turn you may have all of your personal minions (constructs, undead, familiars, summons etc) move without you spending a dice.",
        "req": [
            "soul 6"
        ],
        "dice": 0,
        "is_passive": true
    },
    "93": {
        "name": "soul Bind",
        "effect": "You bind an object or weapon to your very soul. The object gains Returning and if it's a weapon you can do Soul Attack Roll instead of its default Stat attack roll. You must still meet the minimum requirements to use the weapon.",
        "req": [
            "body 1",
            "soul 2"
        ],
        "dice": 2,
        "is_passive": true
    },
    "94": {
        "name": "soul Stealer",
        "effect": "When you kill an enemy with a non-spell Melee Attack, Cleanse 2.",
        "req": [
            "body 2",
            "soul 4"
        ],
        "dice": 2,
        "is_passive": true
    },
    "95": {
        "name": "Past and Future",
        "effect": "You can now Lock two dice. When you would Lock a dice while having two Locked you may pick which Locked dice to replace.",
        "req": [
            "mind 1",
            "soul 2"
        ],
        "dice": 1,
        "is_passive": false
    },
    "96": {
        "name": "Glimpse into the Future.",
        "effect": "You can Lock dice when outside of Combat. Dice locked this way are removed from the roll pool.",
        "req": [
            "mind 1",
            "soul 2"
        ],
        "dice": 0,
        "is_passive": true
    },
    "97": {
        "name": "Foresight",
        "effect": "When you lock a dice, increase its value by 2. This effect cannot increase a dice’s value over 6.",
        "req": [
            "mind 2",
            "soul 4"
        ],
        "dice": 0,
        "is_passive": true
    },
    "98": {
        "name": "Skilled",
        "effect": "Gain an additional 2 Sub-skill increases.",
        "req": [
            "BROKEN",
            "Level 1"
        ],
        "dice": 0,
        "is_passive": true
    },
    "99": {
        "name": "Lucky",
        "effect": "When you roll a 1 you can re-roll that dice. You can only do this once per Rest.",
        "req": [
            "mind 2",
            "soul 4"
        ],
        "dice": 0,
        "is_passive": true
    },
    "100": {
        "name": "Cat Burglar Group",
        "effect": "You gain the following traits: Yoyo, Skeleton Key, and Silent Scaling.  This trait costs 2 trait points. You can only select this trait at level 1.",
        "req": [
            "soul 1",
            "thieving 1"
        ],
        "dice": 0,
        "is_passive": true
    },
    "101": {
        "name": "Skeleton Key",
        "effect": "You can lockpick without needing tools. Additionally, you roll an extra dice when you lockpick with tools.",
        "req": [
            "thieving 1"
        ],
        "dice": 0,
        "is_passive": true
    },
    "102": {
        "name": "Silent Scaling",
        "effect": "You make no noise while climbing or falling up to half your Speed.",
        "req": [
            "thieving 1"
        ],
        "dice": 0,
        "is_passive": true
    },
    "103": {
        "name": "Shadow Walk",
        "effect": "While you are Hidden or unseen you may turn Invisible. This Invisibility lasts until the start of your next turn.",
        "req": [
            "thieving 2"
        ],
        "dice": 1,
        "is_passive": false
    },
    "104": {
        "name": "Backstab",
        "effect": "Do a Melee Attack, it does an extra 1 Damage. The Attack gains Armor Penetration if it does not already have it. You can only do this once per turn. This can be taken multiple times to increase the bonus damage by 1 each time this is taken.",
        "req": [
            "thieving 3"
        ],
        "dice": 3,
        "is_passive": false
    },
    "105": {
        "name": "Imposing",
        "effect": "You can use Body instead of Charm when deceiving or intimidating someone.",
        "req": [
            "body 1",
            "thieving 2"
        ],
        "dice": 2,
        "is_passive": true
    },
    "106": {
        "name": "Strangle Hold",
        "effect": "While you have a creature Grappled. They cannot cast spells or speak.",
        "req": [
            "body 1",
            "thieving 2"
        ],
        "dice": 0,
        "is_passive": true
    },
    "107": {
        "name": "Slap Back",
        "effect": "Spend your locked dice when using this trait. Make a Melee attack on a creature who has hit you with a Melee attack.",
        "req": [
            "body 2",
            "thieving 3"
        ],
        "dice": 1,
        "is_passive": false
    },
    "108": {
        "name": "Get Rough",
        "effect": "You can push creatures a number of tiles based on your Body +1 instead of just 3 tiles.",
        "req": [
            "body 2",
            "thieving 4"
        ],
        "dice": 0,
        "is_passive": true
    },
    "109": {
        "name": "Off Balance",
        "effect": "Successful Push actions reduce the targets Speed by half.",
        "req": [
            "body 2",
            "thieving 4"
        ],
        "dice": 0,
        "is_passive": true
    },
    "110": {
        "name": "Larceny",
        "effect": "Roll a contested Body Check against a target within 1 tile of you. On success you wrestle an item away from the target.",
        "req": [
            "body 2",
            "thieving 4"
        ],
        "dice": 2,
        "is_passive": false
    },
    "111": {
        "name": "In the Shadows",
        "effect": "When you kill a creature while hidden you do not become revealed.",
        "req": [
            "mind 1",
            "thieving 2"
        ],
        "dice": 2,
        "is_passive": true
    },
    "112": {
        "name": "Redirect",
        "effect": "When you get hit spend your Locked dice to redirect the attack to a creature within 1 tile of you. You cannot do this if there are no creatures within 1 tile of you.",
        "req": [
            "mind 2",
            "thieving 3"
        ],
        "dice": 1,
        "is_passive": true
    },
    "113": {
        "name": "Toys A Plenty",
        "effect": "Use an item that is from your bag, or is within 1 tile of you in the world.",
        "req": [
            "mind 4",
            "thieving 6"
        ],
        "dice": 1,
        "is_passive": false
    },
    "114": {
        "name": "Spell Copying",
        "effect": "If you see a spell being cast by someone else, you temporarily know that spell for 60 seconds (6 turns) regardless of if you know the spell innately.",
        "req": [
            "soul 1",
            "thieving 2"
        ],
        "dice": 0,
        "is_passive": true
    },
    "115": {
        "name": "Shadow Friend",
        "effect": "When you use the Create Familiar at the end of a Rest you can instead create a Shadow Friend (See Creatures). This replaces the familiar, dispelling the familiar if one already exists. \nYou can control up to your level of personal minions with your dice, but they must all be given the same Command. If the shadow is not given any commands it does not do any action. When you spend a dice to move you may also have the shadow move as well.",
        "req": [
            "soul 1",
            "thieving 2"
        ],
        "dice": 0,
        "is_passive": true
    },
    "116": {
        "name": "Spell Disarmament",
        "effect": "You can cast Dispel Magic with Thieves’ tools without gaining Soul Strain.",
        "req": [
            "soul 1",
            "thieving 2"
        ],
        "dice": 2,
        "is_passive": false
    },
    "117": {
        "name": "Silencing Strike",
        "effect": "Make a Weapon Attack. Until the end of the target’s next turn they are unable to cast spells.",
        "req": [
            "soul 2",
            "thieving 3"
        ],
        "dice": 3,
        "is_passive": false
    },
    "118": {
        "name": "Spell Thief",
        "effect": "If you successfully Counterspell a Spell. You can Cast that spell for half its Soul Strain cost (rounded up) on your next turn.",
        "req": [
            "soul 2",
            "thieving 4"
        ],
        "dice": 2,
        "is_passive": true
    },
    "119": {
        "name": "body Possession",
        "effect": "You can take over another humanoids living body for up to 10 minutes. The effected creature must be unconscious and will wake up if it takes damage. At the end of the effect, if you choose to leave the body, or if the creature wakes up from damage, you are booted to the nearest safe tile next to the creature. You cannot enter the same creature for 1 day after using this effect on them.",
        "req": [
            "soul 2",
            "thieving 4"
        ],
        "dice": 3,
        "is_passive": false
    },
    "120": {
        "name": "Huntsman Basics Group",
        "effect": "You gain the following traits: Trap Maker, Mark, and Hunter.  This trait costs 2 trait points. You can only select this trait at level 1.",
        "req": [
            "mind 1",
            "nature 1"
        ],
        "dice": 0,
        "is_passive": true
    },
    "121": {
        "name": "Hunter",
        "effect": "Roll Nature instead of Thievery when Hiding.",
        "req": [
            "nature 1"
        ],
        "dice": 0,
        "is_passive": true
    },
    "122": {
        "name": "nature Speak",
        "effect": "You can have simple conversations with animals, and can use Nature instead of Charm when talking to them.",
        "req": [
            "nature 1"
        ],
        "dice": 0,
        "is_passive": true
    },
    "123": {
        "name": "Natures Friend",
        "effect": "You can cast Beast Bond without gaining Soul Strain. \nYou can control up to your level of personal minions with your dice, but they must all be given the same Command. If the beast is not given any commands it does not do any action. When you spend a dice to move you may also have the beast move as well.",
        "req": [
            "nature 2"
        ],
        "dice": 2,
        "is_passive": true
    },
    "124": {
        "name": "Draw Roots",
        "effect": "Heal 1. You must be standing on soil or stone to do this. You can do this a number of times equal to your Nature stat (max 6) per Rest.",
        "req": [
            "body 1",
            "nature 2"
        ],
        "dice": 1,
        "is_passive": false
    },
    "125": {
        "name": "Natures Bind",
        "effect": "You can Grapple someone using earth or plants within 4 tiles of you instead of having touch. All other rules still apply to the Grapple.",
        "req": [
            "body 1",
            "nature 2"
        ],
        "dice": 2,
        "is_passive": true
    },
    "126": {
        "name": "Thorny Armor",
        "effect": "You may spend your Locked dice to do Nature (Rounded down) to a creature that has hit you with a Melee attack.",
        "req": [
            "body 1",
            "nature 2"
        ],
        "dice": 1,
        "is_passive": true
    },
    "128": {
        "name": "Elemental Arrows",
        "effect": "You infuse an arrow with elemental energy. Make a Weapon Attack with a weapon that can use arrows (bows/crossbows). The infused arrow does 1 additional damage, Additionally, choose one of the following effects:\nFire: On hit, the arrow applies Burn 2\nIce: On hit, the creature gains Stun 1\nEarth: On hit, the creature is knocked back 2 tiles \nWind: On hit, another creature within 2 tiles takes half damage (rounded down).",
        "req": [
            "mind 2",
            "nature 3"
        ],
        "dice": 3,
        "is_passive": false
    },
    "129": {
        "name": "Hunters Pride",
        "effect": "Marks you place only disappear once you dispel it or the Marked creature dies.",
        "req": [
            "mind 2",
            "nature 4"
        ],
        "dice": 0,
        "is_passive": true
    },
    "130": {
        "name": "Animal Form",
        "effect": "Gain 2 Soul Strain, you can transform into an animal that you have seen. The creature must have a Difficulty Rating (DR) your Nature or lower. The Shapeshift lasts until dispelled or you die. While transformed you replace your Character sheet with the Animal’s sheet. Your Health and Ward remain unchanged.",
        "req": [
            "nature 2",
            "soul 1"
        ],
        "dice": 2,
        "is_passive": false
    },
    "131": {
        "name": "Spirit Animal",
        "effect": "When you use the Create Familiar at the end of a Rest you can instead create a Spirit Animal (See Creatures). This replaces the familiar, dispelling the familiar if one already exists. \nYou can control up to your level of personal minions with your dice, but they must all be given the same Command. If the spirit is not given any commands it does not do any action. When you spend a dice to move you may also have the spirit move as well.",
        "req": [
            "nature 2",
            "soul 1"
        ],
        "dice": 0,
        "is_passive": true
    },
    "132": {
        "name": "Ignite",
        "effect": "Your damaging cantrips apply 1 stack of Burn.",
        "req": [
            "nature 2",
            "soul 1"
        ],
        "dice": 0,
        "is_passive": true
    },
    "133": {
        "name": "Frostbite",
        "effect": "When you effect a creature with Stun, Frozen, or effects that reduce movement, deal 1 damage to them.",
        "req": [
            "nature 2",
            "soul 1"
        ],
        "dice": 0,
        "is_passive": true
    },
    "134": {
        "name": "Crystalize Soul",
        "effect": "Whenever you gain Soul Strain from the result of casting a spell. Gain 1 Armor for every 2 Soul Strain gained. This effect goes away the next time you are hit or after 10 minutes.",
        "req": [
            "nature 2",
            "soul 1"
        ],
        "dice": 0,
        "is_passive": true
    },
    "135": {
        "name": "Improved Animal Form",
        "effect": "When you Transform through the use of the Animal Form Trait you can gain half of the Creature’s Health as Temporary Health. You can do this once per Rest. The Temporary Health does not go away if you transform back into your normal self.",
        "req": [
            "nature 4",
            "soul 2"
        ],
        "dice": 0,
        "is_passive": true
    },
    "136": {
        "name": "Stronger Flames",
        "effect": "Non-cantrip Spells that apply Burn apply an additional stack of Burn.",
        "req": [
            "nature 4",
            "soul 2"
        ],
        "dice": 0,
        "is_passive": true
    },
    "137": {
        "name": "Frozen Bomb",
        "effect": "Target up to 3 Creatures you can see. Those targets loose all stacks of Stun, and Frozen. Burst 1 centered on those creatures.  All creatures within this area creatures take an amount of damage equal to the Stun stacks lost.",
        "req": [
            "nature 4",
            "soul 2"
        ],
        "dice": 3,
        "is_passive": false
    },
    "138": {
        "name": "Updraft",
        "effect": "Whenever you gain Soul Strain you gain the Flight trait (Move your speed in the air) until end of your turn.",
        "req": [
            "nature 4",
            "soul 2"
        ],
        "dice": 0,
        "is_passive": true
    },
    "139": {
        "name": "Taunt",
        "effect": "Make a Contested Charm roll against a creature you can see. On success the creature cannot willingly move away from you and must spend a dice to move closer if possible.",
        "req": [
            "charm 2"
        ],
        "dice": 2,
        "is_passive": false
    },
    "140": {
        "name": "Universal Language",
        "effect": "You can attempt to converse with Humanoids, Planar, Monstrosities, or Mythic creatures who cannot understand your spoken language.",
        "req": [
            "charm 6"
        ],
        "dice": 0,
        "is_passive": true
    },
    "141": {
        "name": "First Impression",
        "effect": "When talking to a creature for the first time, you gain an additional dice to the first charm roll you make against it.",
        "req": [
            "charm 6"
        ],
        "dice": 0,
        "is_passive": true
    },
    "142": {
        "name": "Fearsome Roar",
        "effect": "All targets within 1 tile of you must make a Charm Roll against the 3 dice given when casting. All creatures that failed cannot willingly move towards you, and must spend a dice to move away from you.",
        "req": [
            "body 1",
            "charm 2"
        ],
        "dice": 3,
        "is_passive": false
    },
    "143": {
        "name": "Crowd Pleaser",
        "effect": "When you kill a creature with a Melee Attack. Gain half your Level (rounded up) plus 1 Temporary Health.",
        "req": [
            "body 1",
            "charm 2"
        ],
        "dice": 0,
        "is_passive": true
    },
    "144": {
        "name": "Insult to Injury",
        "effect": "When damaging with a Melee Attack do a Charm Contest, on Success do an additional damage.",
        "req": [
            "body 2",
            "charm 3"
        ],
        "dice": 0,
        "is_passive": true
    },
    "145": {
        "name": "Death's Howl",
        "effect": "When you are put on Death’s Door, release a Howl within 3 tiles of you. All creatures cannot willingly move towards you, and must spend a dice to move away from you.",
        "req": [
            "body 2",
            "charm 4"
        ],
        "dice": 0,
        "is_passive": true
    },
    "146": {
        "name": "Shock and Awe",
        "effect": "Make a Charm Contest against a creature you can see. On Success the creature gains 3 stacks of Stun (Stun 3).",
        "req": [
            "body 2",
            "charm 4"
        ],
        "dice": 2,
        "is_passive": false
    },
    "147": {
        "name": "Fancy Feet",
        "effect": "When you take damage from a Ranged Attack, you can spend your locked dice to half this damage (rounded up).",
        "req": [
            "body 2",
            "charm 6"
        ],
        "dice": 1,
        "is_passive": true
    },
    "148": {
        "name": "The Show Must Go On",
        "effect": "When you fail a Deaths Door roll, you can instead turn it into a success. You can do this once per Rest.",
        "req": [
            "body 4",
            "charm 6"
        ],
        "dice": 0,
        "is_passive": true
    },
    "149": {
        "name": "Distract",
        "effect": "Make a distraction within Range 6. Make a Contested Charm roll against a creature you can see. On success the creature cannot willingly move away from the distraction and must spend a dice to move closer if possible.",
        "req": [
            "charm 2",
            "mind 1"
        ],
        "dice": 2,
        "is_passive": false
    },
    "150": {
        "name": "To Me",
        "effect": "Until the beginning of your next turn creatures you choose gain 2 Speed when moving to you.",
        "req": [
            "charm 2",
            "mind 1"
        ],
        "dice": 1,
        "is_passive": false
    },
    "151": {
        "name": "Jackpot",
        "effect": "When you spend only 6’s on a single target attack do an extra 2 damage instead of 1.",
        "req": [
            "charm 3",
            "mind 2"
        ],
        "dice": 0,
        "is_passive": true
    },
    "152": {
        "name": "Engaging Speaker",
        "effect": "While you are talking to someone outside of combat they get Stun 1 on all checks that do not relate to you.",
        "req": [
            "charm 4",
            "mind 2"
        ],
        "dice": 0,
        "is_passive": true
    },
    "153": {
        "name": "Misdirection",
        "effect": "When talking to a creature you can state a clearly false statement. Then do a contested Charm roll against a creature. On success the creature believes whatever sentence you said regardless of how true it was. This effect lasts for 1 hour. After which they may or may not still believe the lie.",
        "req": [
            "charm 4",
            "mind 2"
        ],
        "dice": 2,
        "is_passive": false
    },
    "154": {
        "name": "Pull the Strings",
        "effect": "Choose a creature within range, do a Charm contest against them. If you succeed the creature immediately makes a weapon attack against another creature of your choice within their weapon range. They use the dice given for this attack.",
        "req": [
            "charm 5",
            "mind 3"
        ],
        "dice": 2,
        "is_passive": false
    },
    "155": {
        "name": "Ventriloquism",
        "effect": "Do a contested Soul roll against a creature within range 6. On success you make the target recites a sentence as well as it can and in the same tone. They believe the sentence was their own and have no memory of the magic. On failure they someone tried to cast magic on them but not what it was or who cast it.",
        "req": [
            "charm 2",
            "soul 1"
        ],
        "dice": 2,
        "is_passive": false
    },
    "156": {
        "name": "Positive Influence",
        "effect": "When you cast a spell on an ally then their next dice roll is increased by 1. This does not go off on a 6.",
        "req": [
            "BROKEN",
            "charm 4",
            "soul 2"
        ],
        "dice": 0,
        "is_passive": true
    },
    "157": {
        "name": "Negative Influence",
        "effect": "When you cast a spell on an enemy then their next dice roll is decreased by 1. This does not go off on a 1.",
        "req": [
            "BROKEN",
            "charm 4",
            "soul 2"
        ],
        "dice": 0,
        "is_passive": true
    },
    "158": {
        "name": "Change Face",
        "effect": "You can magically change your appearance to look like another. This illusion covers your entire body letting you change clothes, race, sex, and general appearance. It is, however, still an illusion and touching it reveals the illusion. A creature can make a Core Roll against you to discern if it is an illusion. If a creature discovers this illusion then they are able to see through it regardless of what you look like.",
        "req": [
            "charm 2",
            "soul 1"
        ],
        "dice": 1,
        "is_passive": false
    },
    "159": {
        "name": "Intrusive Soul",
        "effect": "You can cast Intrusive Thoughts without gaining Soul Strain. Additionally you can use Charm instead of Soul when using the save.",
        "req": [
            "charm 4",
            "soul 2"
        ],
        "dice": 2,
        "is_passive": true
    },
    "160": {
        "name": "Goad",
        "effect": "Make a Contested Charm roll against a creature you can see. On success the creature must make an attack against you, if its not in range it must spend a dice to move closer if possible. If the attack hits you gain Ward  1 then take the damage.",
        "req": [
            "body 1",
            "charm 4",
            "mind 1"
        ],
        "dice": 2,
        "is_passive": false
    },
    "161": {
        "name": "Battle Medic",
        "effect": "You gain 2 Speed when moving to an ally who has half or less health. \nThis can be taken multiple times to increase the Speed by 3 each time this is taken.",
        "req": [
            "medicine 1"
        ],
        "dice": 0,
        "is_passive": true
    },
    "162": {
        "name": "Potion Maker",
        "effect": "You can use Medicine instead of Arcana when making potions.",
        "req": [
            "medicine 1"
        ],
        "dice": 0,
        "is_passive": true
    },
    "163": {
        "name": "Blood Magic",
        "effect": "You gain an amount of Spells equal to twice your Medicine. (When you cast a spell while at max Soul Strain, you take an amount of damage equal to how far you go over your max Soul Strain when casting.",
        "req": [
            "body 1",
            "medicine 2"
        ],
        "dice": 0,
        "is_passive": true
    },
    "164": {
        "name": "Blood of Thine Enemy",
        "effect": "When a creature dies within 6 tiles of you, you can cast a spell with a Strain cost equal to the creature’s Difficulty Rating (DR) or lower once. The creature’s corpse then dries up.",
        "req": [
            "body 2",
            "medicine 4"
        ],
        "dice": 0,
        "is_passive": true
    },
    "165": {
        "name": "Bloody Mess",
        "effect": "When you cause a creature to Bleed this turn, heal for how much Bleed you cause. Additionally, when trying to roll Charm you get Advantage if you or the creatures are bloody.",
        "req": [
            "body 2",
            "medicine 4"
        ],
        "dice": 1,
        "is_passive": false
    },
    "166": {
        "name": "Improved Healer",
        "effect": "When you use a Bandage use your full Medicine roll instead of half.",
        "req": [
            "medicine 2",
            "mind 1"
        ],
        "dice": 0,
        "is_passive": true
    },
    "167": {
        "name": "Plague Doctor",
        "effect": "You gain immunity to Poisons.",
        "req": [
            "medicine 2",
            "mind 1"
        ],
        "dice": 0,
        "is_passive": true
    },
    "168": {
        "name": "Placebo",
        "effect": "Give a Creature within Range 6 an amount of Temporary Health equal to your Medicine. You can only do this up to half your Medicine (rounded up) per Rest.",
        "req": [
            "medicine 2",
            "mind 1"
        ],
        "dice": 1,
        "is_passive": false
    },
    "169": {
        "name": "Recycled Meds",
        "effect": "You no-longer use up Bandages and can use a Medkit twice before it is expent.",
        "req": [
            "medicine 2",
            "mind 1"
        ],
        "dice": 0,
        "is_passive": true
    },
    "170": {
        "name": "Medical Genius",
        "effect": "When you use a Medkit on a creature they gain all the benefits of a Rest except for fully healing. (Medkit healing is still the same)",
        "req": [
            "medicine 4",
            "mind 2"
        ],
        "dice": 0,
        "is_passive": true
    },
    "171": {
        "name": "Resuscitate",
        "effect": "Touch a creature. You Reduce the target’s Death’s Door Count to go back to a 2 or less. Additionally, heal the creature as if you used a Medkit.",
        "req": [
            "medicine 4",
            "mind 2"
        ],
        "dice": 2,
        "is_passive": false
    },
    "172": {
        "name": "Healthy Hands",
        "effect": "When you cast the Healing Hands Spell use your full Medicine roll instead of half.",
        "req": [
            "medicine 2",
            "soul 1"
        ],
        "dice": 0,
        "is_passive": true
    },
    "173": {
        "name": "Holy Guardian",
        "effect": "When you use the Create Familiar at the end of a Rest you can instead create a Holy Guardian (See Creatures). This replaces the familiar, dispelling the familiar if one already exists. \nYou can control up to your level of personal minions with your dice, but they must all be given the same Command. If the guardian is not given any commands it does not do any action. When you spend a dice to move you may also have the guardian move as well.",
        "req": [
            "medicine 2",
            "soul 1"
        ],
        "dice": 0,
        "is_passive": true
    },
    "174": {
        "name": "soul Healer",
        "effect": "Touch a living creature, cannot target Undead or Constructs. The creature regains Half their max Health. You can do this once per Rest.",
        "req": [
            "medicine 4",
            "soul 2"
        ],
        "dice": 2,
        "is_passive": false
    },
    "175": {
        "name": "Chain Healing",
        "effect": "When you heal a creature you may heal another creature within 1 tile of them for half the healing (rounded down).",
        "req": [
            "medicine 4",
            "soul 2"
        ],
        "dice": 0,
        "is_passive": true
    },
    "176": {
        "name": "Beginner Artificer Group",
        "effect": "You gain the following traits: Get Creative, Trap Maker, and Pitcher.  This trait costs 2 trait points. You can only select this trait at level 1.",
        "req": [
            "body 1",
            "crafting 1"
        ],
        "dice": 0,
        "is_passive": true
    },
    "177": {
        "name": "Improvised Weapon",
        "effect": "You can quickly make an improvised weapon. Spend 10 gold and pick a Core weapon, the improvised weapon has the stats of that weapon. It breaks after 4 uses loosing all gold spent in the process.",
        "req": [
            "crafting 1"
        ],
        "dice": 1,
        "is_passive": false
    },
    "178": {
        "name": "Get Creative",
        "effect": "You can quickly make a set of improvised tools. Spend 2 gold and pick a set of tools, you are able to use these tools for one crafting roll after which they break loosing all gold spent in the process.",
        "req": [
            "crafting 1"
        ],
        "dice": 2,
        "is_passive": false
    },
    "179": {
        "name": "Tunneler",
        "effect": "You can remove a number of tiles equal to your crafting stat. Different types of tiles cost more or less to dig through \n(Cost : Tiles removed). \nSoft (1:1), such as dirt or loose stones\nDence (2:1), such as stone walls\nReinforced (3:1), such as metal walls or solid stone",
        "req": [
            "body 1",
            "crafting 2"
        ],
        "dice": 2,
        "is_passive": false
    },
    "180": {
        "name": "Weapon Smith",
        "effect": "At the end of a Rest you can modify a weapon to remove or add one of the following tags: Two Handed, Loading, Returning, Throw Range 6, Armor Piercing, or Glow. A weapon can only have one of the changes applied to it. Applying an additional change to a weapon replaces the first change.",
        "req": [
            "body 1",
            "crafting 2"
        ],
        "dice": 0,
        "is_passive": true
    },
    "181": {
        "name": "Flaming Blow",
        "effect": "Do a Melee Attack it gives an additional 1 Burn,",
        "req": [
            "body 2",
            "crafting 3"
        ],
        "dice": 3,
        "is_passive": false
    },
    "182": {
        "name": "Weapon Smiting Master",
        "effect": "At the end of a Rest you can create an enhanced weapon, it does an additional damage, and can be sold for twice its value (on average). You can only gain this benefit if you wield this weapon.",
        "req": [
            "body 2",
            "crafting 3"
        ],
        "dice": 0,
        "is_passive": true
    },
    "183": {
        "name": "Grappling Hook",
        "effect": "Target a location or target within within Range 6. If you target a location Pull yourself to that location. If you target an object or creature pull a light object to you or make a Mind Attack. On hit pull the target 3 tiles to you.",
        "req": [
            "crafting 2",
            "mind 1"
        ],
        "dice": 2,
        "is_passive": false
    },
    "184": {
        "name": "Turreted Weapon",
        "effect": "Spend 2 dice to turn one of your weapons into a semi automated Turret. If the Turret is destroyed the weapon drops and is broken. The weapon can be picked up by you and returns to being a normal weapon.\nYou can control up to your level of personal minions with your dice, but they must all be given the same Command. When you spend a dice to move you may also have the turrets move as well.",
        "req": [
            "crafting 2",
            "mind 1"
        ],
        "dice": 2,
        "is_passive": false
    },
    "185": {
        "name": "Steam Weapons",
        "effect": "At the end of a Rest you can create 1 of 3 specialty weapons. You may only have 1 of these weapons at a time.\nThe Bronze Bolter; a repeating crossbow, \nSteamthrower: a steam based Flamethrower\nClockwork Cannon; a large blunderbuss that shoots scrap. See Weapons for more info.",
        "req": [
            "crafting 3",
            "mind 2"
        ],
        "dice": 0,
        "is_passive": true
    },
    "186": {
        "name": "Overclock",
        "effect": "Give a weapon a stack of Overclock to a maximum of 5 stacks, increasing its Damage by 1 per stack of Overclock. When the weapon hits a target it looses all stacks of Overclock.",
        "req": [
            "crafting 3",
            "mind 2"
        ],
        "dice": 2,
        "is_passive": false
    },
    "187": {
        "name": "Steam Weapon Inovations",
        "effect": "At the end of a Rest you can create 1 of 3 specialty weapons. You may only have 1 of these weapons at a time.\nThe Silver Slicer; an improved repeating crossbow, \nSteamdragon: an improved steam based Flamethrower\nGearwork Grand Cannon; a two handed cannon that shoots scrap. See Weapons for more info.\n(This trait is designed to replace the Steam Weapons Trait, though you can take it in addition to get 2 steam weapons.)",
        "req": [
            "crafting 6",
            "mind 4"
        ],
        "dice": 0,
        "is_passive": true
    },
    "188": {
        "name": "Enchanted Item",
        "effect": "You can spend 1 hour, which can be over the course of a rest, to imbue a spell into an item of your choice. The item gets an amount of Soul Strain equal to your level. Someone can then later cast this spell giving the item Soul Strain instead of the user. You can only have one spell in the item at a time, and you can only have 1 item with this effect.",
        "req": [
            "crafting 2",
            "soul 1"
        ],
        "dice": 0,
        "is_passive": true
    },
    "189": {
        "name": "Simple Golem",
        "effect": "When you use the Create Familiar at the end of a Rest you can instead create a Personal Golem (See Creatures). This replaces the familiar, dispelling the familiar if one already exists.\nYou can control up to your level of personal minions with your dice, but they must all be given the same Command. If the golem is not given any commands it does not do any action. When you spend a dice to move you may also have the golem move as well.",
        "req": [
            "crafting 2",
            "soul 1"
        ],
        "dice": 2,
        "is_passive": true
    },
    "190": {
        "name": "Golem Ranger Module",
        "effect": "Your Golem’s Soul Weapon gets +4 range and gains Armor Piercing. Additionally, it’s Armor Becomes Light",
        "req": [
            "crafting 4",
            "soul 2"
        ],
        "dice": 0,
        "is_passive": true
    },
    "191": {
        "name": "Rune Maker",
        "effect": "You can craft 2 Lesser Runes of your choosing. You can only have 2 active at once any new rune will replace the oldest crafted rune. \nThis skill can be taken multiple times to increase the number of active runes by 1.",
        "req": [
            "arcana 1"
        ],
        "dice": 0,
        "is_passive": true
    },
    "192": {
        "name": "Combative Runing",
        "effect": "You have figured out how to improve the flow of runic magic through your tools. Weapons you wield and armor you wear can have an additional rune inserted into it. Additionally, Craft a Lesser Rune. This rune must be put in your weapon or armor.",
        "req": [
            "arcana 3",
            "body 2"
        ],
        "dice": 0,
        "is_passive": true
    },
    "193": {
        "name": "Blade Wave",
        "effect": "You can Expel runic magic to create a wave of runic energy. Suppress the magic of one of your active runes to deal your Melee Weapons damage to all creatures in a 8 tile line. While suppressed the rune has no effect. This suppression lasts for 10 minutes.",
        "req": [
            "arcana 3",
            "body 2"
        ],
        "dice": 2,
        "is_passive": false
    },
    "194": {
        "name": "Magical Siphon",
        "effect": "When you get a kill using a magic weapon or a weapon inscribed with a rune, you gain 1 Ward.",
        "req": [
            "arcana 4",
            "body 3"
        ],
        "dice": 0,
        "is_passive": true
    },
    "195": {
        "name": "Runic Augmentation",
        "effect": "You are able to cast Flesh Shaper on yourself at will. However, the affects are Permanent instead of temporary.",
        "req": [
            "arcana 6",
            "body 4"
        ],
        "dice": 1,
        "is_passive": false
    },
    "196": {
        "name": "Potent Poisons",
        "effect": "Poisons you brew have a save of 6,4,4 instead of 5,4,4.",
        "req": [
            "arcana 4",
            "mind 4"
        ],
        "dice": 0,
        "is_passive": true
    },
    "197": {
        "name": "Double Dosing",
        "effect": "Potions you brew can be used twice before it is consumed.",
        "req": [
            "arcana 6",
            "mind 4"
        ],
        "dice": 0,
        "is_passive": true
    },
    "198": {
        "name": "Complex Brews",
        "effect": "You can brew a potion with 2 effects.",
        "req": [
            "arcana 6",
            "mind 4"
        ],
        "dice": 0,
        "is_passive": true
    },
    "199": {
        "name": "Scroll Crafting",
        "effect": "You can create a magical scroll. This scroll can contain any Spell you know when crafting, and can be used by anyone with Magic (St). The person using the scroll can cast the spell on the scroll for half its St cost if they know the spell or at full cost if they don't. You can only have 1 scroll written at a time, if another one is written the first one loses its power.",
        "req": [
            "arcana 2",
            "soul 1"
        ],
        "dice": 0,
        "is_passive": true
    },
    "200": {
        "name": "Spell Manipulator",
        "effect": "The next spell you cast this turn has one of the following:  \nSoul Slinger, an extra 4 Range but gain 1 Soul Strain.\nMaintain Spell Form, the spells duration is increased by an extra 2 turns but gain 1 Soul Strain.\nIntensify Spell, do 1 extra damage but gain 2 Soul Strain.",
        "req": [
            "arcana 3",
            "soul 2"
        ],
        "dice": 1,
        "is_passive": false
    },
    "201": {
        "name": "Simple Golem (Arcana)",
        "effect": "At the end of a Rest you can create a Personal Golem (See Creatures).\nYou can control up to your level of personal minions with your dice, but they must all be given the same Command. When you spend a dice to move you may also have the golem move as well.",
        "req": [
            "arcana 2",
            "BROKEN",
            "soul 1"
        ],
        "dice": 2,
        "is_passive": true
    },
    "202": {
        "name": "Strongarm",
        "effect": "enhanced Grappling / Restraining? or taking",
        "req": [
            "BROKEN",
            "body 1",
            "thieving 2"
        ],
        "dice": 0,
        "is_passive": false
    },
    "203": {
        "name": "Undead Thrawl",
        "effect": "When you use the Create Familiar at the end of a Rest you can instead create a Undead Thrall (See Creatures). This replaces the familiar, dispelling the familiar if one already exists. \nYou can control up to your level of personal minions with your dice, but they must all be given the same Command. \nIf the Thrall is not given any commands it does not do any action. When you spend a dice to move you may also have the Thrall move as well.",
        "req": [
            "soul 2",
            "medicine 2"
        ],
        "dice": 0,
        "is_passive": true
    },
    "204": {
        "name": "If These Walls Could Talk",
        "effect": "Spend a moment at crime sceen or dead body, the spirits wisper what happened up to 24 hours prior. You may ask up to 3 questions. The spirits will answer the best they can but will never give more than a rough discription. The spirits also cannot describe something that happend through magic or if it was hidden with magic, such as a creature moving under the Invisibility spell.",
        "req": [
            "medicine 2"
        ],
        "dice": 3,
        "is_passive": false
    },
    "205": {
        "name": "Curse of Pain",
        "effect": "Gain 2 Soul Strain and target a Creature or Object within range 6. Give the target the following Curse. If this targets an object, the curse can affect anyone who touches the object. \nThe curse goes away after 1 minute (6 turns), until dispelled by Purge (must beat the number next to the curse), you use this curse on another creatue, or the target dies. The target knows you cursed it.\nCurse of Pain (6,5): You get Disadvantage on all Checks and Contests for a Skill (Body, Mind, Soul). This skill is chosen by the Curse's Caster. Additionaly, when you take 3 or more damage (before armor) take an additional damage.",
        "req": [
            "soul 2",
            "medicine 3"
        ],
        "dice": 3,
        "is_passive": false
    },
    "206": {
        "name": "Eyebite",
        "effect": "When you effect someone with a spell that you cast, you can Blinded them until the start of your next turn.",
        "req": [
            "soul 1",
            "medicine 3"
        ],
        "dice": 0,
        "is_passive": true
    },
    "207": {
        "name": "Curse Ward",
        "effect": "You get Advantage when rolling to succed against a Curse or using Purge to remove a Curse. Additionaly, you can cast Purge once per rest without gaining Soul Strain.",
        "req": [
            "medicine 3"
        ],
        "dice": 0,
        "is_passive": true
    },
    "208": {
        "name": "Eyes of the Night",
        "effect": "You can see in poorly light areas as if they where iluminated, and can see through magical darkness. You cannot be blinded by magic.",
        "req": [
            "medicine 3"
        ],
        "dice": 0,
        "is_passive": true
    },
    "209": {
        "name": "Undead Tinkerer",
        "effect": "When you cast the spell Raise Undead, Instead of making a Zombie you can make a Shambler, Burster, or Spitter instead.",
        "req": [
            "soul 2",
            "medicine 4"
        ],
        "dice": 0,
        "is_passive": true
    },
    "210": {
        "name": "Curse of Bones",
        "effect": "Gain 4 Soul Strain and target a Creature or Object within range 6. Give the target the following Curse. You can only use this curse on one target at a time. If this targets an object, the curse can affect anyone who touches the object. \nThe curse goes away after 1 minute (6 turns), until dispelled by Purge (must beat the number next to the curse), you use this curse on another creatue, or the target dies. The target knows you cursed it.\nCurse of Bones (6,5,4): You get Disadvantage on all Checks and Contests for Subskills (Arcana, Charm, Crafting, Nature, Medicine, Theiving).",
        "req": [
            "soul 2",
            "medicine 4"
        ],
        "dice": 3,
        "is_passive": false
    },
    "211": {
        "name": "Curse of Fear",
        "effect": "Gain 4 Soul Strain and target a Creature or Object within range 6. Give the target the following Curse. You can only use this curse on one target at a time. If this targets an object, the curse can affect anyone who touches the object. \nThe curse goes away after 1 minute (6 turns), until dispelled by Purge (must beat the number next to the curse), you use this curse on another creatue, or the target dies. The target knows you cursed it.\nCurse of Fear (6,5,4): You see things that are not real. At the begining of your turn a terifying visage appears in an empty tile nearby. Roll a dice, On a 1 or 2 you spend your turn runnning from that space trying to hide, On a 3 or 4, spend all dice attacking that space. On a 5, or 6 you act normaly.",
        "req": [
            "soul 2",
            "medicine 4"
        ],
        "dice": 3,
        "is_passive": false
    },
    "212": {
        "name": "Undead King",
        "effect": "You do not get attacked by creatures with the Undead type unless you attack them. \nAdditionaly, you can do a Soul Contest against uncontrolled Undead (No owner) to try to gain control of them. This has no effect on targets with this trait.",
        "req": [
            "soul 6",
            "medicine 6"
        ],
        "dice": 2,
        "is_passive": false
    },
    "213": {
        "name": "Curse of Life",
        "effect": "Gain 6 Soul Strain and target a Creature or Object within range 6. Give the target the following Curse. You can only use this curse on one target at a time. If this targets an object, the curse can affect anyone who touches the object. \nThe curse goes away if dispelled by Purge (must beat the number next to the curse), you use this curse on another creatue, or the target dies. The target knows you cursed it.\nCurse of Life (6,5,5): You get an additional 50% of your current health (rounded up). But you can nolonger roll Deaths Door Rolls. (You die if you reach 0 or less health)",
        "req": [
            "soul 4",
            "medicine 6"
        ],
        "dice": 3,
        "is_passive": false
    },
    "214": {
        "name": "Concuror of Darkness",
        "effect": "Reduce the Soul Strain cost by 1 for any Dark Spells you cast. (Dark Spells have the tag Dark) (Curses from traits do not activate this trait) This cannot reduce the cost of spells below 1.",
        "req": [
            "soul 4",
            "medicine 6"
        ],
        "dice": 0,
        "is_passive": true
    },
    "215": {
        "name": "Trap Maker",
        "effect": "Make one of 3 traps listed below. Each trap costs 5 gold to craft, and covers 1 tile or item. Traps can be reclaimed if unused. Creatures roll a Nature contest to detect the trap.\nTripwire: A small hidden wire which will knock over any creature that steps on it. Can trigger non magical items. \nSnare: A loop of rope that when triggered Grapples and lifts its prey 2 tiles up. \nPopmine: A plate that when activated knocks its prey 3 tiles in a direction. The direction is decided during the trap's creation.",
        "req": [
            "nature 1"
        ],
        "dice": 2,
        "is_passive": false
    },
    "216": {
        "name": "Knoledge of the Forest",
        "effect": "You get Advantage when trying to remember information about: your aproximite location, local flora and fauna, or aproximate time of day (even underground).",
        "req": [
            "nature 1"
        ],
        "dice": 0,
        "is_passive": true
    },
    "217": {
        "name": "Hidden in the Bush",
        "effect": "You can use Nature instead of Theiving to Hide, and can Travel while Hidden at a normal Speed instead of 1 tile slower.",
        "req": [
            "nature 2"
        ],
        "dice": 0,
        "is_passive": true
    },
    "218": {
        "name": "At Home in Nature",
        "effect": "Spend some time searching the local flora. Heal yourself or another creature 2 Health. Alternitivly, you can forge for (1d6)/2 (rounded up) Cheap meals. \nYou cannot use this more than half your level (rounded up) times in the same Large tile (2160 tiles). This effect resets after 1 day.",
        "req": [
            "nature 2"
        ],
        "dice": 3,
        "is_passive": false
    },
    "219": {
        "name": "Marked as Prey",
        "effect": "When you damage a Marked target, you do an extra Damage and reduce the targets Mark stacks by 1. \nAdditonaly, you know the rough direction of creatures you Mark.",
        "req": [
            "mind 2",
            "nature 3"
        ],
        "dice": 0,
        "is_passive": true
    },
    "220": {
        "name": "Marked as Dangerous",
        "effect": "When a target you Marked does damage. You may remove 1 Stack of Marked to reduce the damage by 1. This cannot reduce the damage below 1.\nAdditionaly, if the target is a creature, you know the creatures highest Stat and Substat (name and number).",
        "req": [
            "mind 2",
            "nature 3"
        ],
        "dice": 0,
        "is_passive": true
    },
    "221": {
        "name": "Improved Traps",
        "effect": "Make one of 3 traps listed below. Each trap costs 5 gold to craft, and covers 1 tile or item. Some traps can be reclaimed if unused. Creatures roll a Nature contest to detect the trap.\nPitfall: A 5 tile deep hole covered in camoflouge that breaks when stepped on. The edge is covered in a slick surface which provents climbing up it. (Not reclaimable)\nPoison: A gas canister that when triggered unleashes poisoness gas. The gas explodes in Burst 3, Blinding any creature inside. At the start of a creatures turn, they take 1 damage if they are in the gas.\nGoo: An orb of strange goo that bursts on touch. The goo explodes in Burst 3, giving all targets in this area Burn 3 and destroying 3 Armor.",
        "req": [
            "nature 4"
        ],
        "dice": 2,
        "is_passive": false
    },
    "222": {
        "name": "Hightened Scenses",
        "effect": "You can see in poorly light areas as if they where iluminated. Additionaly, you get Advantage when doing Perception rolls.",
        "req": [
            "nature 4"
        ],
        "dice": 0,
        "is_passive": true
    },
    "223": {
        "name": "Mark of the Hunter",
        "effect": "Your Marks dont go away while you are within 2 Large tiles (4,320x4,320 tiles) the Marked Creature.",
        "req": [
            "mind 3",
            "nature 4"
        ],
        "dice": 0,
        "is_passive": true
    },
    "224": {
        "name": "Elemental Shots",
        "effect": "You infuse ammo with elemental energy. Make a Ranged Weapon Attack. The infused ammo does 1 additional damage. Additionally, choose one of the following effects: \nFire: On hit, give the target 2 stacks of Burn \nIce: On hit, give the target 1 stack of Stun \nEarth: On hit, the target is knocked back 2 tiles \nWind: On hit, another target within 2 tiles takes half damage (rounded down).",
        "req": [
            "mind 4",
            "nature 5"
        ],
        "dice": 3,
        "is_passive": false
    },
    "225": {
        "name": "One with Nature",
        "effect": "You do not get attacked by creatures with the Beasts type unless you attack them. \nAdditionaly, you get Double Advantage when interacting (Checks and Contests) with creatures with the Beasts type.",
        "req": [
            "nature 6"
        ],
        "dice": 0,
        "is_passive": true
    },
    "226": {
        "name": "Dagger Master",
        "effect": "When attacking with a Dagger you spend 1 less AP to do a Weapon Attack.",
        "req": [
            "body 5"
        ],
        "dice": 0,
        "is_passive": true
    },
    "227": {
        "name": "Spear Master",
        "effect": "When you activate a Spear's Weapon effect the Range is increased by 1 tile.\nAdditionaly, when you do a running jump you can do a Polevault with your Spear increasing the distance by 2 tiles.",
        "req": [
            "body 5"
        ],
        "dice": 0,
        "is_passive": true
    },
    "228": {
        "name": "Pitcher",
        "effect": "Doubble the Throw Range for all items you Throw. Items that dont have a displayed Throw Range have a Throw Range of 3.",
        "req": [
            "body 1"
        ],
        "dice": 0,
        "is_passive": true
    },
    "229": {
        "name": "Bull Rush",
        "effect": "Move up to half your speed in a strait line in any direction. Do a Body Contest against any creature within 1 tile during the move. On Success, knock the target back 3 tiles away from your path.",
        "req": [
            "body 2"
        ],
        "dice": 2,
        "is_passive": false
    },
    "230": {
        "name": "Cleave",
        "effect": "Do a Melee Weapon Attack against all targets infront of you (Directly infront, to the left, and right of that tile). You can only do this once per turn.",
        "req": [
            "body 3"
        ],
        "dice": 3,
        "is_passive": false
    },
    "231": {
        "name": "Rip and Tear",
        "effect": "Do a Melee Weapon Attack, if you activate the Weapons effect, give the target an additional 1 stack of Bleed.",
        "req": [
            "body 3"
        ],
        "dice": 3,
        "is_passive": false
    },
    "232": {
        "name": "Bloodhound",
        "effect": "Gain 2 extra Speed when moving to a Marked or Bleeding (has Bleed stacks) creature.\nThis can be taken multiple times to increase the Speed by 2 each time this is taken.",
        "req": [
            "body 1"
        ],
        "dice": 0,
        "is_passive": true
    },
    "233": {
        "name": "Manipulate",
        "effect": "Combine two dice. If the combination is 7 or more, set 1 dice as a 6 and the other as the remainder\n(3+4= 6,1). You can do this a number of times equal to your COMBAT DICE per Rest.",
        "req": [
            "mind 2"
        ],
        "dice": 0,
        "is_passive": true
    },
    "234": {
        "name": "Enhanced Motivate",
        "effect": "When you use Motivate, increase the dice’s value by 1. This effect doesn’t apply if the dice is already 6.",
        "req": [
            "mind 4"
        ],
        "dice": 0,
        "is_passive": true
    },
    "235": {
        "name": "Recalculate",
        "effect": "You may flip this dice to show its opposite face. (1⇔6, 2⇔5, 3⇔4) You can only do this once per turn. This can be done outside of Combat for checks. You can do this a number of times eqal to your COMBAT DICE per Rest.",
        "req": [
            "mind 4"
        ],
        "dice": 0,
        "is_passive": true
    },
    "236": {
        "name": "Double Ammo Stores",
        "effect": "You may spend a Rest modifying a weapon you weild. For this weapon you double the Capacity of ammo a Loading weapon can hold. A weapon can only have this effect aplied to it once.",
        "req": [
            "mind 2",
            "crafting 4"
        ],
        "dice": 0,
        "is_passive": true
    }
}